[
    {
        "subjectId": "90101002",
        "thaiSubjectsName": "คณิตศาสตร์ในชีวิตประจำวัน",
        "engSubjectsName": "MATHEMATICS IN DAILY LIFE",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": " หลักการและกระบวนการคิดของมนุษย์  การวิเคราะห์ข้อมูลและข่าวสาร  มูลค่าที่เพิ่มขึ้นและมูลค่าที่ลดลง  ดอกเบี้ยเชิงเดียว ดอกเบี้ยทบต้น ค่ารายงวด  เงินออมและการลงทุนเพื่อการลดหย่อนภาษี  การคิดภาษีเงินได้บุคคลธรรมดา  ค่าเสื่อมราคาและมูลค่าสุทธิของทรัพย์สินถาวร  และการประยุกต์อื่นๆ ในชีวิตประจำวัน ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90302003",
        "thaiSubjectsName": "มนุษยสัมพันธ์",
        "engSubjectsName": "HUMAN RELATIONS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความสัมพันธ์ระหว่างบุคคลและกลุ่มต่างๆในสังคม อิทธิพลของวัฒนธรรม ขนบธรรมเนียม ประเพณีที่มีบทบาทต่อบุคคลและกลุ่ม ศิลปะการพูด การสนทนาและการฟัง การปรับตัวให้เหมาะสมกับ สภาพแวดล้อมในสังคมไทย โดยเรียนรู้อารยธรรมของมนุษย์ในแง่ของอารมณ์ ความแตกต่างระหว่าง บุคคล และการฝึกพฤติกรรมที่เหมาะสมตลอดจนมารยาททางสังคม",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90306007",
        "thaiSubjectsName": "ทักษะแห่งความสุข",
        "engSubjectsName": "HAPPINESS SKILLS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการและวิะีการทางจิตวิทยา  มนุษย์ศาสตร์  และสังคมศาสตร์เกี่ยวกับความสุขในระดับต่างๆ ทั้งมิติทางกายภาพ  มิติทางสังคม  มิติทางอารมณ์  มิติทางจิตใจ  และมิติทางการรู้คิด  โดยมุ่งเน้นการฝึกปฏิบัติเพื่อบริหารความเครียด  การเข้าใจตนเอง  และการพัฒนาทักษะแห่งความสุข",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90307008",
        "thaiSubjectsName": "ภาษาเพื่อสื่อสารมวลชน",
        "engSubjectsName": "LANGUAGE FOR MASS MEDIA",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": " เทคนิคการใช้ภาษาไทยในสื่อ  การวิเคราะห์ลักษณะเฉพาะของภาษาสื่อสารมวลชน  ที่ปรากฏทางสื่อหนังสือพิมพ์  สื่อวิทยุโทรทัศน์ สื่ออินเทอร์เน็ต  และสื่อมวลชนอื่นๆ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90401011",
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "ENTREPRENEURSHIP",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาเกี่ยวกับผู้ประกอบการที่ประสบความสำเร็จ  ประเภทของผู้ประกอบการ  การจัดตั้งธุรกิจ  องค์ประกอบของการเขียนแผนธุรกิจ  กลยุทธ์การดำเนินการธุรกิจในหน้าที่ต่างๆ   เทคนิคการบริหารธุรกิจสมัยใหม่  และกรณีศึกษาการประกอบการธุรกิจที่ประสบความสำเร็จ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90592008",
        "thaiSubjectsName": "สังคมไทยในวันนี้",
        "engSubjectsName": "TODAY'S THAI SOCIETY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาเรื่องสังคมไทยโดยทั่วไป การเมืองไทยกับทิศทางในการบริหารประเทศ รูปแบบการพัฒนาที่เหมาะสมและสอดคล้องกับความต้องการของชุมชน ปรัชญาเศรษฐกิจพอเพียงกับการพัฒนาที่ยั่งยืน  สังคมไทยกับการให้และแบ่งปัน ความเชื่อและศาสนากับวิถีชีวิตประจำวันในสังคม ปฏิสัมพันธ์และการเลือกปฏิบัติในสังคมไทยปัจจุบัน วิถีผู้สูงวัยกับความตื่นตัวทางสังคม ภาวะปัญหากับวิกฤติของสังคมไทย แนวโน้มการเปลี่ยนแปลงของสังคมไทย",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90593022",
        "thaiSubjectsName": "สนุกกับวิทยาการข้อมูล",
        "engSubjectsName": "FUN WITH DATA SCIENCE",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความสำคัญ หลักการ กระบวนการของวิทยาการข้อมูล การเตรียมข้อมูล วิทยาการวิเคราะห์ข้อมูล แบบจำลองพยากรณ์ การแบ่งประเภท การแบ่งกลุ่ม การอนุมานเชิงสถิติ การถดถอย การวิเคราะห์เครือข่ายสังคม ข้อมูลขนาดใหญ่ โดยมุ่งเน้นการนำข้อมูลรอบตัวในชีวิตประจำวันมาประยุกต์ใช้ให้เกิดประโยชน์ได้จริง",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594002",
        "thaiSubjectsName": "ผู้ประกอบการทางสังคม",
        "engSubjectsName": "SOCIAL ENTREPRENEURS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาบทบาทการเป็นผู้ประกอบการที่มองเห็นปัญหาของสังคม หรือการเพิ่มคุณค่าด้านประกอบการในชุมชนท้องถิ่น และใช้หลักของผู้ประกอบการในการออกแบบ และจัดระบบทางธุรกิจเพื่อบรรลุเป้าหมายในการเปลี่ยนแปลงทางสังคมและการเพิ่มทุนทางสังคม ไม่เน้นกำไรส่วนบุคคล พร้อมกับคิดค้นวิธีการใหม่ๆ ในการแก้ไขปัญหา เพื่อเปลี่ยนแปลงสังคมไปในทางที่ดีขึ้น",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594003",
        "thaiSubjectsName": "การจัดการและภาวะผู้นำสมัยใหม่ ",
        "engSubjectsName": "MODERN MANAGEMENT AND LEADERSHIP",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการการบริหารจัดการยุคใหม่ ทฤษฎีผู้นำยุคใหม่ และทฤษฎีผู้นำยุคปัจจุบัน ศึกษาความสัมพันธ์ระหว่างการจัดการและภาวะผู้นำ การเรียนรู้แนวทางการพัฒนาทักษะการจัดการ และทักษะภาวะความเป็นผู้นำ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90595022",
        "thaiSubjectsName": "การฟังและการอ่านเพื่อพัฒนาคุณภาพชีวิต",
        "engSubjectsName": "LISTENING AND READING FOR IMPROVING LIFE QUALITY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการรับสารอย่างมีวิจารณญาณ รู้เท่าทันสื่อและการสื่อสาร ฝึกทักษะการฟังและการอ่านเพื่อพัฒนาคุณภาพชีวิต ให้เกิดความรอบรู้ มีประสบการณ์และสร้างจินตนาการ การพัฒนาความสามารถในการจับใจความสำคัญ การสรุปประเด็น การวิเคราะห์และประเมินค่าสารทั้งสาระความรู้และบันเทิงคดี",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "14026711",
        "thaiSubjectsName": "หัวข้อเฉพาะทางการบริหารธุรกิจอุตสาหกรรม 1 ",
        "engSubjectsName": "SELECTED TOPICS IN INDUSTRIAL BUSINESS 1",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาถึงเรื่องที่น่าสนใจทางธุรกิจอุตสาหกรรมมีเนื้อหาที่เป็นปัจจุบัน และเปลี่ยนไปแต่ละภาคการศึกษา",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "14026711",
        "thaiSubjectsName": "การพัฒนาสุขภาพแบบองค์รวม",
        "engSubjectsName": "HOLISTIC HEALTH DEVELOPMENT",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความสำคัญของการรักษาสุขภาพกายและสุขภาพจิต องค์ประกอบของการพัฒนาสุขภาพกายและสุขภาพจิตที่ดี กระบวนการพัฒนาสุขภาพกายและสุขภาพจิตโดยใช้หลักการบริหารกาย นันทนาการและกีฬา ปัจจัยที่มีผลต่อการพัฒนาสุขภาพกายและสุขภาพจิต อาทิ โภชนาการ บุคลิกภาพ และอื่นๆ การปรับตัวเพื่อการอยู่ร่วมกับผู้อื่นในสังคมอย่างเป็นสุข รวมทั้งการศึกษาดูงานนอกสถานที่ ในหน่วยงานและองค์กรที่มีส่วนร่วมในการพัฒนาสุขภาพกายและสุขภาพจิต",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90306008",
        "thaiSubjectsName": "สมาธิเพื่อพัฒนาชีวิต",
        "engSubjectsName": "MEDITATION FOR LIFE DEVELOPMENT",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความหมายของการทำสมาธิ  จุุดประสงค์   วิธีการ  ขั้นตอน  จุดเริ่มต้นของการทำสมาธิ  ลักษณะของการบริกรรมและการทำสมาธิ  ประโยชน์ของสมาธิ   ลักษณะอาการต่อต้านสมาธิ  และการนำสมาธิไปใช้ในชีวิตประจำวัน  สมาธิกับการเรียนและการทำงาน  ลักษณะ  ขั้นตอน  คุณสมบัติ  ประโยชน์ของฌานและญาณ  สิ่งที่ควรรู้เรื่องวิปัสสนา  ความแตกต่างระหว่างสมถะกับวิปัสสนา   แผนผังสมถะกับวิปัสสนา  ชาวโลกกับวิปัสสนา",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90403011",
        "thaiSubjectsName": "การจัดการเทคโนโลยีชีวิตประจำวัน",
        "engSubjectsName": "TECHNOLOGY MANAGEMENT IN DAILY LIFE",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการจัดการเทคโนโลยี  บทบาทของเทคโนโลยีชิวิตประจำวัน  วงจรชีวิตของเทคโนโลยี  การถ่ายโอนเทคโนโลยี  ซึ่งครอบคลุมถึงกระบวนการประเมินเทคโนโลยี   การจัดการการเปลี่ยนแปลงและการบริหารความเสี่ยงในยุคโลกาภิวัฒน์",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90591027",
        "thaiSubjectsName": "สุนทรียะเพลงแรป",
        "engSubjectsName": "RAP APPRECIATION",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษารูปแบบการแต่งเพลงแรป วิวัฒนาการของเพลงแรพจากทั่วโลกและในประเทศไทย วิเคราะห์ สังเคราะห์และตีความการใช้ภาษาในเพลงอย่างมีวิจารณญาณ การมองสะท้อนวัฒนธรรมที่สอดแทรกในบทเพลงเพื่อให้เข้าใจบริบทและเข้าใจคุณค่าของบทเพลง การฝึกแต่งและร้องเพลงแรปแบบปัญญาชน",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594007",
        "thaiSubjectsName": "กฎหมายสำหรับผู้ประกอบการ",
        "engSubjectsName": "LAW FOR ENTREPRENEURS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการจัดตั้งองค์กรธุรกิจ บทบาทขององค์การธุรกิจต่อการด าเนินธุรกิจสมัยใหม่ ศึกษาแนวทางการจัดการด้านภาษีเพื่อประโยชน์ของธุรกิจ หลักการในการจัดท าสัญญาประเภทต่าง ๆ สัญญาซื้อขาย สัญญาเช่า สัญญาจ้างแรงงาน สิทธิประโยชน์ตามกฎหมายที่ภาครัฐมีขึ้นเพื่อสนับสนุนและส่งเสริมการประกอบธุรกิจของ SMES ตามกฎหมายส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม หลักการทางกฎหมายที่เกี่ยวกับการซื้อขายสินค้าทางออนไลน์ และข้อควรระวังส าหรับผู้ประกอบธุรกิจดิจิทัลในการปฏิบัติตามกฎหมายเพื่อคุ้มครองผู้ซื้อ การคุ้มครองข้อมูลส่วนบุคคล",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594007",
        "thaiSubjectsName": "ห้องภาพอิเล็กทรอนิกส์",
        "engSubjectsName": "E-GALLERY OWNER",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาวิธีการ และรูปแบบของการท าคลังรูปภาพ กฏและระเบียบ ลิขสิทธิ์ที่จ าเป็นต้องรู้เกี่ยวข้องกับการคลังรูปภาพออนไลน์ และเรียนรู้เรื่องกล้องถ่ายภาพ ประเภทของเลนส์ การจัดแสง การโฟกัส การวางต าแหน่งภาพและการตัดภาพ การจัดวางภาพแบบ isolation การควบคุมกล้องถ่ายภาพ ชนิดของไฟล์รูปภาพค าส าคัญที่เลือกใช้ ค าแนะน าเรื่องการขายภาพออนไลน์ และเรียนรู้การจัดการการขายภาพออนไลน์",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90595033",
        "thaiSubjectsName": "ภาษาจีนเพื่อการท่องเที่ยว",
        "engSubjectsName": "CHINESE FOR TRAVEL",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาและฝึกฝนการใช้คำศัพท์ สำนวน ลักษณะเฉพาะของภาษาจีนเชิงการท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการเดินทาง ทักษะการโต้ตอบอย่างเหมาะสม รวมทั้งเข้าใจการสื่อสารในวัฒนธรรมที่แตกต่าง",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90595044",
        "thaiSubjectsName": "การผลิตสื่อดิจิทัล",
        "engSubjectsName": "DIGITAL MEDIA PRODUCTION",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การฝึกทักษะในการผลิตสื่อดิจิทัลโดยเน้นการสร้างไอเดียด้วยหลักการวิเคราะห์ข้อมูลหลักการนำเสนอแบบเรื่องเล่า (STORY TELLING) การออกแบบและสร้างสื่อประเภทต่างๆ การนำเสนอในรูปแบบกราฟฟิกและวีดีโอผ่านช่องทางต่างๆ ทั้งแบบ OFF-LINE , ONLINE และ SOCIAL MEDIA",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90642149",
        "thaiSubjectsName": "ศิลปะสร้างสรรค์เพื่อพัฒนาอารมณ์และจิตวิญญาณ",
        "engSubjectsName": "IMAGINATIVE ART",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "เรียนรู้การบูรณาการการสร้างสรรค์ผลงานศิลปะงานที่ไม่กำหนดผลลัพธ์ ไม่ยึดติดกับอุปกรณ์ทฤษฎี และความสวยงามของผลงาน ให้ความสำคัญกับความคิด การวางแผน และการลงมือทำ เน้นที่การสะท้อนตัวตนเพื่อให้เกิดความรับรู้และเข้าใจในตนเอง รวมถึงการพัฒนาอารมณ์ สติปัญญา สมาธิ ความคิดสร้างสรรค์ และจิตวิญญาณ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90302013",
        "thaiSubjectsName": "การพัฒนาบุคลิกภาพและสุขภาพจิต",
        "engSubjectsName": "PERSONALITY AND MENTAL HEALTH DEVELOPMENT",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาทฤษฎีทางบุคลิกภาพ  วิธีการวัดบุคลิกภาพ  พัฒนาการทางบุคลิกภาพของบุคคล  แนวความคิดและทฤษฎีเกี่ยวกับสุขภาพจิต  ปัจจัยที่มีผลต่อสุขภาพจิต   พฤติกรรมอปกติ  ความผิดปกติทางอารมณ์และความเจ็บป่วยทางจิตใจ  ตลอดจนการบำบัดรักษา  การฟื้นฟู  การป้องกันและส่งเสริมสุขภาพจิตขอบบุคคล",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90302001",
        "thaiSubjectsName": "จิตวิทยาทั่วไป",
        "engSubjectsName": "GENERAL PSYCHOLOGY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาประวัติและวิธีการศึกษาทางจิตวิทยา การนำวิธีการทางวิทยาศาสตร์มาใช้ในการศึกษาพฤติกรรมมนุษย์ กระบวนการทำงานของสมองที่มีผลต่อพฤติกรรม อิทธิพลของพันธุกรรมและสิ่งแวดล้อม พัฒนาการของมนุษย์ในวัยต่างๆ การรับรู้ การเรียนรู้ การจูงใจ อารมณ์ บุคลิกภาพ พฤติกรรมทางสังคม สุขภาพจิต ตลอดจนการนำความรู้ทางจิตวิทยามาประยุกต์ใช้กับงานด้านการสื่อสารระหว่างกัน",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90303005",
        "thaiSubjectsName": "การพลศึกษาเบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO PHYSICAL EDUCATION",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การศึกษาถึงความหมายและความสำคัญของพลศึกษา ความรู้เบื้องต้นของการออกกำลังกาย และสมรรถภาพของร่างกาย การเรียนรู้ทักษะการเคลื่อนไหวต่างๆ เพื่อส่งเสริมสุขภาพและพัฒนาจิตใจ ความรู้เกี่ยวกับขอบข่ายของกิจกรรมทางพลศึกษา กิจกรรมกีฬาทั้งประเภทบุคคลและประเภททีม การจัดกิจกรรมพลศึกษาและกิจกรรมเพื่อนันทนาการ การป้องกันการบาดเจ็บทางกีฬา ตลอดจนการปฐมพยาบาล (ทั้งภาคทฤษฎีและภาคปฏิบัติ)",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90303016",
        "thaiSubjectsName": "การเตรียมความพร้อมสหกิจศึกษา",
        "engSubjectsName": "COOPERATIVE EDUCATION PREPARATION",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "หลักการ แนวคิด และกระบวนการของสหกิจศึกษา ระเบียบข้อบังคับที่เกี่ยวข้อง ความรู้พื้นฐาน และเทคนิคในการสมัครงาน เช่น การเลือกสถานประกอบการ การเขียนจดหมายสมัครงาน และการ สัมภาษณ์งาน ความรู้พื้นฐานที่จำเป็นสำหรับการปฏิบัติงานในสถานประกอบการ กฎหมายแรงงานและ กฎหมายอื่นๆ ที่เกี่ยวข้อง การพัฒนาบุคลิกภาพ เทคนิคการสร้างความมั่นใจในตนเอง การพัฒนาทักษะ การสื่อสาร ทักษะการทำงานเป็นทีม เทคนิคการเขียนรายงานและการนำเสนอโครงการหรือผลงาน ปัญหาอุปสรรคและแนวทางแก้ไขระหว่างการปฏิบัติงาน",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90305005",
        "thaiSubjectsName": "มนุษย์กับการท่องเที่ยว",
        "engSubjectsName": "HUMAN AND TOURISM",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความสำคัญและความหมายของการท่องเที่ยว ความเป็นมา แนวโน้มบทบาท และองค์ประกอบที่สำคัญของอุตสาหกรรมการท่องเที่ยว ศึกษาโครงสร้างพื้นฐานของอุตสาหกรรมการท่องเที่ยว ปัจจัยต่างๆ ที่มีอิทธิพลต่อการท่องเที่ยวได้แก่ การคมนาคม การขนส่ง ที่พักแรม ร้านอาหารและสวัสดิการ ร้านค้าของที่ระลึก ตลอดจนการให้ความปลอดภัยต่อชีวิต และทรัพย์สินของนักท่องเที่ยวมีการศึกษานอกสถานที่",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "16166206",
        "thaiSubjectsName": "ภาษาจีนเบื้องต้น 1",
        "engSubjectsName": "ELEMENTARY CHINESE 1",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ทักษะการฟัง  การพูด  การอ่านและการเขียนภาษาจีนที่ใช้ในชีวิตประจ าวัน คำศัพท์ ไวยากรณ์และโครงสร้างรูปประโยคพื้นฐาน กฎเกณฑ์พื้นฐานการเขียนตัวอักษรจีนประมาณ 400 ตัวอักษร ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90307004",
        "thaiSubjectsName": "ภาษาในสังคมไทย",
        "engSubjectsName": "LANGUAGE IN THAI SOCIETY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาโครงสร้างของภาษาและความหลากหลายของภาษาที่ใช้ในสังคมไทย  ความสัมพันธ์ระหว่างภาษา  บริบททางสัมและวัฒนธรรม  ธรรมชาติและการเปลี่ยนแปลงของภาษา  รวมทั้งการพัฒนาภาษากับการพัฒนาสังคมและประเทศชาติ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90101008",
        "thaiSubjectsName": "คณิตศาสตร์ในธุรกิจและอุตสาหกรรม",
        "engSubjectsName": "MATHEMATICS IN BUSINESS AND INDUSTRY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การสร้างตัวแบบปัญหาทางคณิตศาสตร์  ตัวแบบกำหนดการเชิงเส้นและการแก้ปัญหาโดยวิธีกราฟ  ตัวแบบข่ายงาน  ระเบียบวิธีต้นไม้แผ่ทั่วที่น้อยที่สุด  ระเบียบวิธีระยะทางที่สั้นที่สุด  เทคนิคการไหลมากที่สุด  ระบบสมการเชิงเส้น  การหาผลเฉลยของระบบสมการเชิงเส้น  ระเบียบวิธีการจำกัดแบบเกาส์  การประยุกต์กับการไหลในข่ายงาน  ความรู้เบื้องต้นเกี่ยวกับอนุพันธ์  ปัญหาการหาค่าเหมาะสมที่สุด  การประยุกต์ในเรื่องส่วนที่เผื่อเอาไว้ในทางเศรษฐศาสตร์  การปรับข้อมูล  การถดถอยเชิงเส้น  การปรับเส้นโค้งพหุนาม กาปรรับเส้นโค้งเลขชี้กำลัง",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90104007",
        "thaiSubjectsName": "วิทยาศาสตร์การอาหารสำหรับชีวิตประจำวัน",
        "engSubjectsName": "FOOD SCIENCE IN DAILY LIFE",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "สถานการณ์ปัจจุบันของอาหารแปรรูปที่มีผลกระทบต่อชีวิตประจำวัน  ผลิตภัณฑ์อาหารแปรรูปประเภทต่างๆ อาหารเพื่อสุขภาพ  หลักการกระบวนการแปรรูปอาหารพื้นฐาน  กฏหมายอาหารที่เกี่ยวข้องกับชีวิตประจำวัน  การเลือกซื้อและการเลือกบริโภคอาหารแปรรูปต่างๆ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90402010",
        "thaiSubjectsName": "ความรู้เบื้องต้นเกี่ยวกับกฎหมายไทย",
        "engSubjectsName": "INTRODUCTION TO THAI LAWS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความจำเป็นที่ต้องมีกฏหมายใช้บังคับในสังคม  ความหมายของกฏหมาย  ลักษณะของกฏหมาย  ประเภทของกฏหมาย  กฎหมายการทะเบียนราษฎร์  กฎหมายเกี่ยวกับการรับราชการทหาร  กฏหมายแพ่งที่เกี่ยวข้องในชีวิตประจำวัน  บุคคล  ครอบครัว  มรดก  พินัยกรรม  การทำเอกสารและสัญญาความรู้เกี่ยวกับทรัพย์  ความรู้เกี่ยวกับที่ดิน  หลักเกณฑ์กฏหมายในการทำนิติกรรมและสัญญา  สัญญาประเภทต่างๆ ที่พบได้บ่อย  ความรู้พื้นฐานเกี่ยวกับกฏหมายอาญา  ความรับผิดในทางอาญา  เหตุยกเว้นความผิดและเหตุยกเว้นโทษ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90591004",
        "thaiSubjectsName": "ศิลปะการพัฒนาอารมณ์",
        "engSubjectsName": "ARTS OF EMOTION DEVELOPMENT",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความหมาย ความสําคัญ หลักการ แนวคิดทฤษฎีที่เกี่ยวข้องอารมณ์ที่มีอิทธิพลต่อการดํารงชีวิต การปรับเปลี่ยนความคิด การคิดเชิงบวก การเผชิญปัญหา การจัดการอารมณ์ในการทํางานและการดําเนินชีวิตประจําวัน",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90591010",
        "thaiSubjectsName": "สุนทรียะดนตรี",
        "engSubjectsName": "MUSIC APPRECIATION",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษารูปแบบ ลักษณะ ธรรมชาติ และองค์ประกอบของดนตรี ความรู้เบื้องต้นเกี่ยวกับดนตรีไทยและสากล การชื่นชมความงามและการตระหนักถึงคุณค่าของดนตรี ทักษะและมารยาทในการฟังดนตรี",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90591011",
        "thaiSubjectsName": "สศิลปะสร้างสรรค์เพื่อพัฒนาอารมณ์และจิตวิญญาณ",
        "engSubjectsName": "IMAGINATIVE ART",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "เรียนรู้การบูรณาการการสร้างสรรค์ผลงานศิลปะงานที่ไม่กำหนดผลลัพธ์   ไม่ยึดติดกับอุปกรณ์  ทฤษฎี และความสวยงามของผลงาน (End Product) แต่จะให้ความส าคัญกับ 'ความคิด การวางแผน และการลงมือทำ' เน้นที่การสะท้อนตัวตนเพื่อให้เกิดความรับรู้และเข้าใจ (Acknowledge and Make sense) ในตนเอง   รวมถึงการพัฒนาอารมณ์  สติปัญญา  สมาธิ ความคิดสร้างสรรค์ และจิตวิญญาณ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90592022",
        "thaiSubjectsName": "โหราศาสตร์ไทย",
        "engSubjectsName": "THAI ASTROLOGY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความเป็นมาเกี่ยวกับโหราศาสตร์และการพยากรณ์ เน้นโหราศาสตร์ไทยและการพยากรณ์ที่มีหลักเกณฑ์และสถิติเพื่อความเข้าใจที่ถูกต้องเกี่ยวกับโหราศาสตร์ที่มีพื้นฐานจากวิทยาศาสตร์และดาราศาสตร์ และเรียนรู้รูปแบบการพยากรณ์ในแบบของโหราศาสตร์ไทยเพื่อให้สามารถนำไปปรับใช้ในชีวิตประจำวัน",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90592028",
        "thaiSubjectsName": "หมอต้นไม้",
        "engSubjectsName": "TREE DOCTOR",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาประเภทของต้นไม้ คุณค่าของต้นไม้กับการอยู่ร่วมกันระหว่างมนุษย์กับต้นไม้ วิธีการดูแล รู้จักอนุรักษ์ต้นไม้ การลงพื้นที่สำรวจต้นไม้ที่อยู่ในความสนใจ การใช้สื่อเพื่อการรณรงค์รักษา และรู้คุณค่าของต้นไม้",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90592033",
        "thaiSubjectsName": "สังคมสูงวัยเชิงรุก",
        "engSubjectsName": "ACTIVE AGING SOCIETY",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การเตรียมตัวสำหรับคนต่างรุ่น ในการเข้าสู่วัยสูงอายุ และสังคมสูงวัยอย่างสมบูรณ์ของประเทศไทย และสังคมโลก เข้าใจแนวคิดสูงวัยเชิงรุก (Active Aging) ซึ่งเป็นกรอบแนวนโยบายที่สร้างโดยองค์การอนามัยโลก ที่มุ่งเน้นในด้านสุขภาพกายและจิตที่ดี การมีความมั่นคงทางเศรษฐกิจและครอบครัว และการมีส่วนร่วมในสังคม เพื่อให้ผู้สูงอายุ และคนต่างรุ่นได้อยู่ร่วมกันอย่างมีความสุขในสังคมสูงวัยและสังคมสูงวัยอย่างสมบูรณ์ในอนาคต",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90593006",
        "thaiSubjectsName": "มนุษย์ เงิน และคณิตศาสตร์",
        "engSubjectsName": "MAN MONEY & MATH",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาหลักการทางคณิตศาตร์ที่เกี่ยวข้องในการใช้ชีวิตประจำวัน การทำความเข้าใจ และการนำไปประยุกต์ให้ชีวิตมีความสุขและยั่งยืน โดยมุ่งเน้นความสัมพันธ์ ความสอดคล้องและความสมดุล ในด้านการบริหารจัดการ ด้านการใช้เงิน การออม และการลงทุนในสินทรัพย์ประเภทต่างๆ เช่น เงินฝาก พันธบัตร� หุ้นกู้ หุ้นสามัญ ตลอดจนสินทรัพย์ประเภทอื่นๆ ตามความเหมาะสม และความถนัดของแต่ละบุคคล",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90593008",
        "thaiSubjectsName": "วิชาเอาตัวรอด",
        "engSubjectsName": "SURVIVORS",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การวิเคราะห์ปัจจัยเสี่ยงต่อการด ารงชีวิตในอดีต ปัจจุบัน และอนาคต การวิเคราะห์ทักษะการดำรงชีวิตเชิงกลยุทธ์เพื่อการจัดลำดับความต้องการจำเป็นในการดำรงชีวิตอย่างมีคุณภาพในแต่ละช่วงวัย การแก้ไขผลกระทบเชิงลบในอดีต การส่งเสริมการใช้ชีวิตในปัจจุบันอย่างมีคุณภาพ การวางแผนการดำรงชีวิตในอนาคต การออกแบบชีวิต การสร้างภูมิคุ้มกันชีวิต การออกแบบแผนการดำรงชีวิตอย่างไม่ประมาท บนพื้นฐานของหลักการและสถิติอย่างเป็นเหตุเป็นผลและเป็นระบบ",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594010",
        "thaiSubjectsName": "การทำงานเป็นทีม",
        "engSubjectsName": "TEAMWORK",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาความหมายและความสำคัญของการสร้างทีมงาน แนวคิดพื้นฐานในการพัฒนาองค์การ แนวคิดเกี่ยวกับการทำงานเป็นทีม การพัฒนาการทำงานเป็นทีม แผนการสื่อสารในทีม การเป็นผู้นำและผู้ตามที่ดี ประโยชน์และอุปสรรคในการท างานเป็นทีม การบริหารความขัดแย้งในทีม ทักษะในการสร้างทีมงานที่มีประสิทธิผล การสร้างความภาคภูมิใจในทีมงาน ปัญหาในการสร้างทีมงานและแนวทางแก้ไข",
        "category": "หมวดวิชาเสรี"
    },
    {
        "subjectId": "90594004",
        "thaiSubjectsName": "การวางแผนเพื่อการลงทุน",
        "engSubjectsName": "INVESTMENT PLANNING",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาประเภทของการลงทุน ทฤษฎีการเงินที่ใช้เพื่อการลงทุน การบริหารความเสี่ยงในการลงทุูน หลักการวิเคราะห์และการลงทุูนเพื่อผลตอบแทนที่คุ้มค่า การคำนวณหาความคุ้มค่าในการลงทุน",
        "category": "หมวดวิชาเสรี"
    }
]