[
    {
        "subjectId": "06026100",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ"
    },
    {
        "subjectId": "06026104",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการของการแก้ปัญหาการคำนวณโดยใช้โปรแกรมคอมพิวเตอร์ พื้นฐานของแนวคิดการเขียนโปรแกรม นิพจน์ การควบคุมขั้นตอนในการทำงาน และ การวนซ้ำ ฟังก์ชั่น ชนิดของข้อมูล มาตรฐานในการเขียนโปรแกรมเบื้องต้น การคิดเป็นขั้นตอน การวิเคราะห์ความซับซ้อนขั้นพื้นฐาน คลังโปรแกรม ตัวอย่างของการประยุกต์ใช้วิทยาการข้อมูล การเขียนโปรแกรมที่ดี ซึ่งรวมถึง เอนแคปซูเลชัน เจนเนอรัลไลเซชัน การออกแบบส่วนต่อประสาน การจัดการรหัสต้นทาง การพัฒนาแบบใช้การทดสอบเป็นตัวขับเคลื่อน การทำการทดสอบแบบหน่วย การรีแฟกเทอรี่ง การทบทวนรหัสต้นทางโดยเพียร์ และการจับคู่เขียนโปรแกรม"
    },
    {
        "subjectId": "90101007",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401013",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90101xxx",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกทางวิทยาศาสตร์กับคณิตศาสตร์ 2",
        "engSubjectsName": "Elective Course in Scientific and Mathematics 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026101",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชัน อนุพันธ์อันดับสูง การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน การอินทิเกรตและเทคนิคของการอินทเกรต การประยุกต์ของการอินทิเกรต ฟังก์ชันสองตัวแปร อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์ ระบบสมการเชิงเส้น และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก"
    },
    {
        "subjectId": "06026105",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "หลักการพื้นฐานเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูล สถาปัตยกรรมเครือข่าย การแบ่งระดับชั้นการทำงานเครือข่ายแบบโอเอสไอและทีซีพีไอพี โพรโทคอลระดับแอปพลิเคชัน สถาปัตยกรรมแอปพลิเคชัน โพรโทคอลระดับทรานสปอร์ต รูปแบบการส่งข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโทคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิทชิงและแพ็คเก็ตสวิทชิง โพรโทคอลอินเตอร์เน็ต รูปแบบการหาเส้นทาง โพรโทคอลระดับดาต้าลิงก์ การควบคุมการเข้าถึงสื่อ ระบบหมายเลขที่อยู่บนเครือข่าย เทคโนโลยีอีเทอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายเสมือน เครือข่ายพื้นที่กว้าง เครือข่ายท้องถิ่นแบบไร้สาย โพรโทคอลและฟังก์ชั่นการทำงานระดับกายภาพ"
    },
    {
        "subjectId": "06026106",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณ-ภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่าง เอนทิตี นอร์มัลไลซ์เซชัน เอสคิว แนะนำการจัดการทรานแซคชันและการบริหารฐานข้อมูล ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล แนะนำข้อมูลสนันสนุนการตัดสินใจสำหรับระดับบริหารและระบบคลังข้อมูล แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์"
    },
    {
        "subjectId": "06026107",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Data Structures and Algorithms",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสต์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมแบบละโมภ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "90201002",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401012",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความรู้เบื้องต้นทางการตลาด",
        "engSubjectsName": "Introduction to Marketing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026102",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "Discrete Mathematics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกและเซ็ท ความสัมพันธ์และฟังก์ชัน คอมบินาทอรี่ส์ กราฟและทรี พีชคณิตบูลีน ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด"
    },
    {
        "subjectId": "06026103",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "06026108",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06026109",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "เทคโนโลยีเว็บ",
        "engSubjectsName": "Web Technology",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "องค์ประกอบและแนวคิดพื้นฐานของระบบเว็บ หลักการทำงานของระบบเว็บ แนะนำเทคโนโลยีเว็บฝั่งไคลแอนท์ ได้แก่ เอชทีเอ็มแอล ซีเอสเอส จาวาสคริปต์ และ ดีโอเอ็ม เทคโนโลยีเว็บฝั่งเซิร์ฟเวอร์สำหรับการสร้างหน้าเว็บแบบปรับเปลี่ยนเนื้อหาได้ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ บริการทั่วไปบนอินเทอร์เน็ตและเว็บ เช่น เซิร์จเอ็นจินต์ บริการวีดีโอสตรีมมิ่ง บริการแผนที่และการระบุตำแหน่ง"
    },
    {
        "subjectId": "06026110",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บัญชีการเงิน",
        "engSubjectsName": "Financial Accounting",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ภาพรวมของธุรกรรมทางธุรกิจ รายงานที่ใช้ในบัญชีการเงิน มาตรฐานและขั้นตอนทางการบัญชี การบันทึกรายวัน บัญชีแยกประเภท การปรับปรุงรายการและปิดบัญชี การจัดทำงบการเงิน งบกำไรขาดทุน งบดุล และงบกระแสเงินสด การวิเคราะห์ผลการดำเนินธุรกิจจากงบการเงิน"
    },
    {
        "subjectId": "06026111",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ฐานข้อมูลแบบโนเอสคิวแอล",
        "engSubjectsName": "Practical NoSQL Database",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-2-1)",
        "thaiSubjectDetails": "แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ ความแตกต่างจากระบบฐานข้อมูลเชิงสัมพันธ์ ข้อดีและข้อเสียของฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ ชนิดและโครงสร้างฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แบบคอลัมน์ แบบคีย์แวลยู แบบเอกสาร และแบบกราฟ ตัวอย่างการออกแบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ การใช้ภาษาเจสันกับฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แนะนำภาษาเจสัน ไวยากรณ์ของเจสัน ชนิดข้อมูลของเจสัน การใช้เจสันกับฝั่งเซิร์ฟเวอร์"
    },
    {
        "subjectId": "90201012",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและการเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skills in English",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026112",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจ",
        "engSubjectsName": "Business Information System Analysis and Design",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "เครื่องมือและวิธีการสำหรับการพัฒนาระบบสารสนเทศทางธุรกิจ แนวคิดการวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจในปัจจุบัน แบบจำลองการวิเคราะห์ระบบ แบบจำลองการออกแบบระบบ ความสำคัญของกระบวนการควบคุมในขั้นตอนการวางแผน วิเคราะห์ จัดสร้าง และทดสอบระบบสารสนเทศทางธุรกิจเพื่อแก้ปัญหาการจัดการด้านธุรกิจ กรณีศึกษา"
    },
    {
        "subjectId": "06026113",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การสร้างโปรแกรมทางสถิติ",
        "engSubjectsName": "Statistical Programming",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-2-1)",
        "thaiSubjectDetails": "แนะนำการเขียนโปรแกรมทางสถิติ เช่น ภาษาอาร์ การวิเคราะห์ทางคณิตศาสตร์ ประเภทข้อมูล ข้อมูลตัวแปรเดี่ยว ข้อมูลตัวแปรคู่ ข้อมูลหลายตัวแปร สถิติเชิงพรรณา ตัวแปรอาร์เรย์ เมตริกซ์ ข้อมูลรายการและเฟรมข้อมูล โครงสร้างการควบคุม การวนลูป  การพล๊อตกราฟและกราฟฟิค การจัดการข้อมูล การสร้างฟังก์ชันและแพคเกจ"
    },
    {
        "subjectId": "06026114",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "กระบวนการธุรกิจและการวางแผนทรัพยากรองค์กร",
        "engSubjectsName": "Business Processes and Enterprise Resource Planning",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กระบวนการธุรกิจหลักในองค์กร กระบวนการทางบัญชี กระบวนการได้มาซึ่งทรัพยากร กระบวนการจัดการสินค้าและคลังสินค้า กระบวนการการผลิต และกระบวนการการขายสินค้าหรือบริการ การบูรณาการกระบวนการธุรกิจด้วยระบบวางแผนทรัพยากรองค์กร แนวคิดการวางแผนทรัพยากรองค์กร เรียนรู้ทักษะเชิงปฏิบัติในการนำกระบวนการธุรกิจมาใช้งานบนแอปพลิเคชันมาตรฐานของระบบวางแผนทรัพยากรองค์กร"
    },
    {
        "subjectId": "06026115",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "อัจฉริยะทางธุรกิจเบื้องต้น",
        "engSubjectsName": "Introduction to Business Intelligence",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของอัจฉริยะทางธุรกิจ องค์ประกอบของอัจฉริยะทางธุรกิจ โครงสร้างพื้นฐานของอัจฉริยะทางธุรกิจ คลังข้อมูล เหมืองข้อมูล การบริหารสมรรถนะของธุรกิจ บาลานซ์สกอร์การ์ด เครื่องมือต่างๆ ในการสร้างอัจฉริยะทางธุรกิจในองค์กร การประยุกต์ใช้อัจฉริยะทางธุรกิจบนระบบสารสนเทศต่าง ๆ ในองค์กร แอปพลิเคชันต่างๆ ของอัจฉริยะทางธุรกิจที่ใช้ในปัจจุบัน"
    },
    {
        "subjectId": "06026116",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์ข้อมูลเชิงธุรกิจ",
        "engSubjectsName": "Business Data Analytics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำการวิเคราะห์ข้อมูลเชิงธุรกิจและการตัดสินใจ การรวบรวมข้อมูล การสำรวจข้อมูล และการสรุปข้อมูล การประมาณค่าแนวโน้มและความเบี่ยงเบนของข้อมูล การอนุมานเชิงสถิติ การวิเคราะห์เชิงถดถอย การพยากรณ์ และอนุกรมเวลา การหาค่าที่เหมาะสมที่สุด การสร้างแบบจำลองสถานการณ์ การวิเคราะห์ข้อมูลชั้นสูง โปรแกรมทางสถิติ"
    },
    {
        "subjectId": "06026117",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานวิทยาการข้อมูล",
        "engSubjectsName": "Fundamental of Data Science",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "วิทยาการข้อมูลกับแรงจูงใจเชิงธุรกิจ การจัดการข้อมูล การวิเคราะห์ข้อมูลโดยใช้สถิติและการเรียนรู้ของเครื่องจักร การสร้างภาพเพื่อสื่อข่าวสาร การทำเหมืองข้อมูล การสกัดข่าวสารและความรู้จากข้อมูล การค้นคืนข่าวสารและอัลกอริทึมการสืบค้น การประมวลผลข้อความและเสียง การจัดเก็บและวิเคราะห์ข้อมูลขนาดใหญ่"
    },
    {
        "subjectId": "90201026",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการสื่อสาร",
        "engSubjectsName": "ENGLISH FOR COMMUNICATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026118",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ  การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ องค์ความรู้สำหรับการบริหารโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการ การประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ  การจัดการความเสี่ยง การควบคุมโครงการ และประเมินผลโครงการ"
    },
    {
        "subjectId": "06026119",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฎหมายไอที",
        "engSubjectsName": "Information Technology Security and IT Laws",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ กฎหมายและปัญหาจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ อาชญากรรมคอมพิวเตอร์"
    },
    {
        "subjectId": "06026120",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การสร้างคลังข้อมูล",
        "engSubjectsName": "Data Warehousing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "สถาปัตยกรรมของคลังข้อมูล การสร้างแบบจำลองข้อมูลเชิงมิติ เช่น แบบจำลองข้อมูลแบบสตาร์ และแบบจำลองข้อมูลแบบสโนเฟค การสกัดข้อมูล การแปลงข้อมูลและการนำข้อมูลเข้าระบบคลังข้อมูล เมตดาต้า การบำรุงรักษาคลังข้อมูล การประมวลผลการวิเคราะห์ทางออนไลน์ (โอแลป) แดชบอร์ด"
    },
    {
        "subjectId": "06026121",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การทำเหมืองข้อมูลและการวิเคราะห์ข้อมูลขนาดใหญ่",
        "engSubjectsName": "Data Mining and Big Data Analytics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กระบวนการทำเหมืองข้อมูล  การแบ่งกลุ่มข้อมูล การจัดกลุ่มข้อมูล การค้นหากฎความสัมพันธ์ของข้อมูล เครื่องมือต่างๆ ในการทำคลังข้อมูลและเหมืองข้อมูล กระบวนการวิเคราะห์ข้อมูลขนาดใหญ่  สถาปัตยกรรมการประมวลผลข้อมูลแบบฮาร์ดูปและแมบรีดิ้ว การติดตั้งแมบรีดิ้ว การเขียนโปรแกรมแมบรีดิ้ว ระบบอื่นๆที่เกี่ยวข้องกับฮาร์ดูป เช่น โปรแกรมมาเอ้าท์ โปรแกรมพิก และโปรแกรมไฮฟ"
    },
    {
        "subjectId": "06026122",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "วิทยาการข้อมูลสำหรับธุรกิจ",
        "engSubjectsName": "Data Science for Business",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักปฏิบัติเบื้องต้นของวิทยาการข้อมูล การสร้างโมเดลการทำนาย การแบ่งส่วนแบบมีผู้สอน ฟังก์ชันดิสคริมิแนนต์ การวิเคราะห์การปฏิบัติงานของโมเดล การคิดเชิงวิเคราะห์สำหรับการตัดสินใจ การแสดงภาพการปฏิบัติงานของโมเดล การทำนายโดยใช้การรวมหลายหลักฐาน การทำเหมืองและแทนข้อความอักษร ความคล้ายคลึงและเพื่อนบ้านที่ใกล้ที่สุด การจัดกลุ่มและทำเหมืองข้อมูลแบบไม่มีผู้สอน เทคนิคและงานต่าง ๆ ในวิทยาการข้อมูล กลยุทธ์เชิงธุรกิจและวิทยาการข้อมูล"
    },
    {
        "subjectId": "90304004",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026123",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "สัมมนาทางด้านทักษะการสื่อสารในวิชาชีพ",
        "engSubjectsName": "Seminar on Professional Communication Skills",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(1-0-2)",
        "thaiSubjectDetails": "ทักษะต่างๆ สำหรับการสมัครงานและการประกอบอาชีพ เทคนิคการเขียนจดหมายสมัครงาน เทคนิคการสอบสัมภาษณ์งาน การพัฒนาบุคลิกภาพและการแต่งกาย ทักษะในการนำเสนองานทางธุรกิจ ทักษะในการพูดและการสื่อสาร มารยาทในการเข้าสังคม การบริหารอารมณ์"
    },
    {
        "subjectId": "06026124",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การแสดงข้อมูลด้วยแผนภาพ",
        "engSubjectsName": "Data Visualization",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการการแสดงข้อมูลด้วยแผนภาพ การออกแบบการแสดงข้อมูลด้วยแผนภาพ เครื่องมือที่ใช้ การแสดงข้อมูลด้วยแผนภาพ การได้มาซึ่งข้อมูล การจัดระเบียบข้อมูล การเลือกแผนภูมิต่างๆ ที่เหมาะสม เช่น ฮีทโตรแกรม แผนภูมิการกระจาย แผนภูมิเส้น แผนภูมิแท่ง แผนภูมิวงกลม แผนภูมิต้นไม้ แผนภูมิแบบเครือข่าย กราฟสตรีม แผนภูมิตัวชี้วัดผลงาน แผนที่ แผนภูมิแบบปฏิสัมพันธ์ การอธิบายแผนภูมิ"
    },
    {
        "subjectId": "06026125",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การเรียนรู้ของเครื่องจักร",
        "engSubjectsName": "Machine Learning",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ความรู้พื้นฐานของการเรียนรู้ของเครื่องจักร การเรียนรู้แบบมีผู้สอน การถดถอยเชิงเส้น วิธีกำลังสองน้อยที่สุด การถดถอยโลจิสติก โครงข่ายประสาทเทียม อัลกอริทึมเพื่อนบ้านที่ใกล้ที่สุด ซัพพอร์ทเวกเตอร์แมชชีน การเรียนรู้แบบไม่มีผู้สอน การจัดกลุ่มแบบเคมีน อัลกอริทึมการหาค่าความคาดหวังสูงสุด การลดมิติข้อมูล การวิเคราะห์องค์ประกอบหลัก การตรวจสอบไขว้ การประเมินผลของการทำนาย การประยุกต์ใช้ของการเรียนรู้ของเครื่องจักร"
    },
    {
        "subjectId": "06026126",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การบริหารเชิงกลยุทธ์และสมรรถะของธุรกิจ",
        "engSubjectsName": "Business Strategic and Performance Management",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "แนะนำการวางแผนเชิงกลยุทธ์ของธุรกิจ การกำหนดสมรรถนะของธุรกิจและการเลือกหลักการวัดสมรรถนะ  กระบวนการบริหารสมรรถนะของธุรกิจ การวางแผนสมรรถนะ การนำแผนไปสู่การปฏิบัติ การประเมินสมรรถนะ และการพิจารณาทบทวนสมรรถนะ การแนะนำระบบการบริหารสมรรถนะของธุรกิจ และแนวทางปฏิบัติที่ดีของการบริหารสมรรถนะของธุรกิจ"
    },
    {
        "subjectId": "06026127",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "โครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1",
        "engSubjectsName": "Project in Data Science and Business Analytics 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา สามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ"
    },
    {
        "subjectId": "060261xx",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "หัวข้อพิเศษวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1",
        "engSubjectsName": "Selected Topic in Data Science and Business Analytics 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06026129",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 3,
        "thaiSubjectsName": "ฝึกวิชาชีพวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ",
        "engSubjectsName": "Data Science and Business Analytics Professional Practices",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(0-35-0)"
    },
    {
        "subjectId": "06026128",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "โครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 2",
        "engSubjectsName": "Project in Data Science and Business Analytics 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา สามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1"
    },
    {
        "subjectId": "060261xx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "หัวข้อพิเศษวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 2",
        "engSubjectsName": "Selected Topic in Data Science and Business Analytics 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกทางมนุษยศาสตร์ 2",
        "engSubjectsName": "Elective Course in Humanity 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026100",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ"
    },
    {
        "subjectId": "06026104",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการของการแก้ปัญหาการคำนวณโดยใช้โปรแกรมคอมพิวเตอร์ พื้นฐานของแนวคิดการเขียนโปรแกรม นิพจน์ การควบคุมขั้นตอนในการทำงาน และ การวนซ้ำ ฟังก์ชั่น ชนิดของข้อมูล มาตรฐานในการเขียนโปรแกรมเบื้องต้น การคิดเป็นขั้นตอน การวิเคราะห์ความซับซ้อนขั้นพื้นฐาน คลังโปรแกรม ตัวอย่างของการประยุกต์ใช้วิทยาการข้อมูล การเขียนโปรแกรมที่ดี ซึ่งรวมถึง เอนแคปซูเลชัน เจนเนอรัลไลเซชัน การออกแบบส่วนต่อประสาน การจัดการรหัสต้นทาง การพัฒนาแบบใช้การทดสอบเป็นตัวขับเคลื่อน การทำการทดสอบแบบหน่วย การรีแฟกเทอรี่ง การทบทวนรหัสต้นทางโดยเพียร์ และการจับคู่เขียนโปรแกรม"
    },
    {
        "subjectId": "90101007",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201001",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401013",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90101xxx",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกทางวิทยาศาสตร์กับคณิตศาสตร์ 2",
        "engSubjectsName": "Elective Course in Scientific and Mathematics 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026101",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชัน อนุพันธ์อันดับสูง การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน การอินทิเกรตและเทคนิคของการอินทเกรต การประยุกต์ของการอินทิเกรต ฟังก์ชันสองตัวแปร อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์ ระบบสมการเชิงเส้น และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก"
    },
    {
        "subjectId": "06026105",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "หลักการพื้นฐานเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูล สถาปัตยกรรมเครือข่าย การแบ่งระดับชั้นการทำงานเครือข่ายแบบโอเอสไอและทีซีพีไอพี โพรโทคอลระดับแอปพลิเคชัน สถาปัตยกรรมแอปพลิเคชัน โพรโทคอลระดับทรานสปอร์ต รูปแบบการส่งข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโทคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิทชิงและแพ็คเก็ตสวิทชิง โพรโทคอลอินเตอร์เน็ต รูปแบบการหาเส้นทาง โพรโทคอลระดับดาต้าลิงก์ การควบคุมการเข้าถึงสื่อ ระบบหมายเลขที่อยู่บนเครือข่าย เทคโนโลยีอีเทอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายเสมือน เครือข่ายพื้นที่กว้าง เครือข่ายท้องถิ่นแบบไร้สาย โพรโทคอลและฟังก์ชั่นการทำงานระดับกายภาพ"
    },
    {
        "subjectId": "06026106",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณ-ภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่าง เอนทิตี นอร์มัลไลซ์เซชัน เอสคิว แนะนำการจัดการทรานแซคชันและการบริหารฐานข้อมูล ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล แนะนำข้อมูลสนันสนุนการตัดสินใจสำหรับระดับบริหารและระบบคลังข้อมูล แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์"
    },
    {
        "subjectId": "06026107",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Data Structures and Algorithms",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสต์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมแบบละโมภ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "90201002",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401012",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความรู้เบื้องต้นทางการตลาด",
        "engSubjectsName": "Introduction to Marketing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026102",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "Discrete Mathematics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกและเซ็ท ความสัมพันธ์และฟังก์ชัน คอมบินาทอรี่ส์ กราฟและทรี พีชคณิตบูลีน ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด"
    },
    {
        "subjectId": "06026103",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "06026108",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06026109",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "เทคโนโลยีเว็บ",
        "engSubjectsName": "Web Technology",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "องค์ประกอบและแนวคิดพื้นฐานของระบบเว็บ หลักการทำงานของระบบเว็บ แนะนำเทคโนโลยีเว็บฝั่งไคลแอนท์ ได้แก่ เอชทีเอ็มแอล ซีเอสเอส จาวาสคริปต์ และ ดีโอเอ็ม เทคโนโลยีเว็บฝั่งเซิร์ฟเวอร์สำหรับการสร้างหน้าเว็บแบบปรับเปลี่ยนเนื้อหาได้ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ บริการทั่วไปบนอินเทอร์เน็ตและเว็บ เช่น เซิร์จเอ็นจินต์ บริการวีดีโอสตรีมมิ่ง บริการแผนที่และการระบุตำแหน่ง"
    },
    {
        "subjectId": "06026110",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บัญชีการเงิน",
        "engSubjectsName": "Financial Accounting",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ภาพรวมของธุรกรรมทางธุรกิจ รายงานที่ใช้ในบัญชีการเงิน มาตรฐานและขั้นตอนทางการบัญชี การบันทึกรายวัน บัญชีแยกประเภท การปรับปรุงรายการและปิดบัญชี การจัดทำงบการเงิน งบกำไรขาดทุน งบดุล และงบกระแสเงินสด การวิเคราะห์ผลการดำเนินธุรกิจจากงบการเงิน"
    },
    {
        "subjectId": "06026111",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ฐานข้อมูลแบบโนเอสคิวแอล",
        "engSubjectsName": "Practical NoSQL Database",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-2-1)",
        "thaiSubjectDetails": "แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ ความแตกต่างจากระบบฐานข้อมูลเชิงสัมพันธ์ ข้อดีและข้อเสียของฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ ชนิดและโครงสร้างฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แบบคอลัมน์ แบบคีย์แวลยู แบบเอกสาร และแบบกราฟ ตัวอย่างการออกแบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ การใช้ภาษาเจสันกับฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แนะนำภาษาเจสัน ไวยากรณ์ของเจสัน ชนิดข้อมูลของเจสัน การใช้เจสันกับฝั่งเซิร์ฟเวอร์"
    },
    {
        "subjectId": "90201012",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและการเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skills in English",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026112",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจ",
        "engSubjectsName": "Business Information System Analysis and Design",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "เครื่องมือและวิธีการสำหรับการพัฒนาระบบสารสนเทศทางธุรกิจ แนวคิดการวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจในปัจจุบัน แบบจำลองการวิเคราะห์ระบบ แบบจำลองการออกแบบระบบ ความสำคัญของกระบวนการควบคุมในขั้นตอนการวางแผน วิเคราะห์ จัดสร้าง และทดสอบระบบสารสนเทศทางธุรกิจเพื่อแก้ปัญหาการจัดการด้านธุรกิจ กรณีศึกษา"
    },
    {
        "subjectId": "06026113",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การสร้างโปรแกรมทางสถิติ",
        "engSubjectsName": "Statistical Programming",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-2-1)",
        "thaiSubjectDetails": "แนะนำการเขียนโปรแกรมทางสถิติ เช่น ภาษาอาร์ การวิเคราะห์ทางคณิตศาสตร์ ประเภทข้อมูล ข้อมูลตัวแปรเดี่ยว ข้อมูลตัวแปรคู่ ข้อมูลหลายตัวแปร สถิติเชิงพรรณา ตัวแปรอาร์เรย์ เมตริกซ์ ข้อมูลรายการและเฟรมข้อมูล โครงสร้างการควบคุม การวนลูป  การพล๊อตกราฟและกราฟฟิค การจัดการข้อมูล การสร้างฟังก์ชันและแพคเกจ"
    },
    {
        "subjectId": "06026114",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "กระบวนการธุรกิจและการวางแผนทรัพยากรองค์กร",
        "engSubjectsName": "Business Processes and Enterprise Resource Planning",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กระบวนการธุรกิจหลักในองค์กร กระบวนการทางบัญชี กระบวนการได้มาซึ่งทรัพยากร กระบวนการจัดการสินค้าและคลังสินค้า กระบวนการการผลิต และกระบวนการการขายสินค้าหรือบริการ การบูรณาการกระบวนการธุรกิจด้วยระบบวางแผนทรัพยากรองค์กร แนวคิดการวางแผนทรัพยากรองค์กร เรียนรู้ทักษะเชิงปฏิบัติในการนำกระบวนการธุรกิจมาใช้งานบนแอปพลิเคชันมาตรฐานของระบบวางแผนทรัพยากรองค์กร"
    },
    {
        "subjectId": "06026115",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "อัจฉริยะทางธุรกิจเบื้องต้น",
        "engSubjectsName": "Introduction to Business Intelligence",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของอัจฉริยะทางธุรกิจ องค์ประกอบของอัจฉริยะทางธุรกิจ โครงสร้างพื้นฐานของอัจฉริยะทางธุรกิจ คลังข้อมูล เหมืองข้อมูล การบริหารสมรรถนะของธุรกิจ บาลานซ์สกอร์การ์ด เครื่องมือต่างๆ ในการสร้างอัจฉริยะทางธุรกิจในองค์กร การประยุกต์ใช้อัจฉริยะทางธุรกิจบนระบบสารสนเทศต่าง ๆ ในองค์กร แอปพลิเคชันต่างๆ ของอัจฉริยะทางธุรกิจที่ใช้ในปัจจุบัน"
    },
    {
        "subjectId": "06026116",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์ข้อมูลเชิงธุรกิจ",
        "engSubjectsName": "Business Data Analytics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำการวิเคราะห์ข้อมูลเชิงธุรกิจและการตัดสินใจ การรวบรวมข้อมูล การสำรวจข้อมูล และการสรุปข้อมูล การประมาณค่าแนวโน้มและความเบี่ยงเบนของข้อมูล การอนุมานเชิงสถิติ การวิเคราะห์เชิงถดถอย การพยากรณ์ และอนุกรมเวลา การหาค่าที่เหมาะสมที่สุด การสร้างแบบจำลองสถานการณ์ การวิเคราะห์ข้อมูลชั้นสูง โปรแกรมทางสถิติ"
    },
    {
        "subjectId": "06026117",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานวิทยาการข้อมูล",
        "engSubjectsName": "Fundamental of Data Science",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "วิทยาการข้อมูลกับแรงจูงใจเชิงธุรกิจ การจัดการข้อมูล การวิเคราะห์ข้อมูลโดยใช้สถิติและการเรียนรู้ของเครื่องจักร การสร้างภาพเพื่อสื่อข่าวสาร การทำเหมืองข้อมูล การสกัดข่าวสารและความรู้จากข้อมูล การค้นคืนข่าวสารและอัลกอริทึมการสืบค้น การประมวลผลข้อความและเสียง การจัดเก็บและวิเคราะห์ข้อมูลขนาดใหญ่"
    },
    {
        "subjectId": "90201026",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการสื่อสาร",
        "engSubjectsName": "ENGLISH FOR COMMUNICATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026118",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ  การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ องค์ความรู้สำหรับการบริหารโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการ การประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ  การจัดการความเสี่ยง การควบคุมโครงการ และประเมินผลโครงการ"
    },
    {
        "subjectId": "06026119",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฎหมายไอที",
        "engSubjectsName": "Information Technology Security and IT Laws",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ กฎหมายและปัญหาจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ อาชญากรรมคอมพิวเตอร์"
    },
    {
        "subjectId": "06026120",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การสร้างคลังข้อมูล",
        "engSubjectsName": "Data Warehousing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "สถาปัตยกรรมของคลังข้อมูล การสร้างแบบจำลองข้อมูลเชิงมิติ เช่น แบบจำลองข้อมูลแบบสตาร์ และแบบจำลองข้อมูลแบบสโนเฟค การสกัดข้อมูล การแปลงข้อมูลและการนำข้อมูลเข้าระบบคลังข้อมูล เมตดาต้า การบำรุงรักษาคลังข้อมูล การประมวลผลการวิเคราะห์ทางออนไลน์ (โอแลป) แดชบอร์ด"
    },
    {
        "subjectId": "06026121",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การทำเหมืองข้อมูลและการวิเคราะห์ข้อมูลขนาดใหญ่",
        "engSubjectsName": "Data Mining and Big Data Analytics",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กระบวนการทำเหมืองข้อมูล  การแบ่งกลุ่มข้อมูล การจัดกลุ่มข้อมูล การค้นหากฎความสัมพันธ์ของข้อมูล เครื่องมือต่างๆ ในการทำคลังข้อมูลและเหมืองข้อมูล กระบวนการวิเคราะห์ข้อมูลขนาดใหญ่  สถาปัตยกรรมการประมวลผลข้อมูลแบบฮาร์ดูปและแมบรีดิ้ว การติดตั้งแมบรีดิ้ว การเขียนโปรแกรมแมบรีดิ้ว ระบบอื่นๆที่เกี่ยวข้องกับฮาร์ดูป เช่น โปรแกรมมาเอ้าท์ โปรแกรมพิก และโปรแกรมไฮฟ"
    },
    {
        "subjectId": "06026122",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "วิทยาการข้อมูลสำหรับธุรกิจ",
        "engSubjectsName": "Data Science for Business",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักปฏิบัติเบื้องต้นของวิทยาการข้อมูล การสร้างโมเดลการทำนาย การแบ่งส่วนแบบมีผู้สอน ฟังก์ชันดิสคริมิแนนต์ การวิเคราะห์การปฏิบัติงานของโมเดล การคิดเชิงวิเคราะห์สำหรับการตัดสินใจ การแสดงภาพการปฏิบัติงานของโมเดล การทำนายโดยใช้การรวมหลายหลักฐาน การทำเหมืองและแทนข้อความอักษร ความคล้ายคลึงและเพื่อนบ้านที่ใกล้ที่สุด การจัดกลุ่มและทำเหมืองข้อมูลแบบไม่มีผู้สอน เทคนิคและงานต่าง ๆ ในวิทยาการข้อมูล กลยุทธ์เชิงธุรกิจและวิทยาการข้อมูล"
    },
    {
        "subjectId": "90304004",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026123",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "สัมมนาทางด้านทักษะการสื่อสารในวิชาชีพ",
        "engSubjectsName": "Seminar on Professional Communication Skills",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(1-0-2)",
        "thaiSubjectDetails": "ทักษะต่างๆ สำหรับการสมัครงานและการประกอบอาชีพ เทคนิคการเขียนจดหมายสมัครงาน เทคนิคการสอบสัมภาษณ์งาน การพัฒนาบุคลิกภาพและการแต่งกาย ทักษะในการนำเสนองานทางธุรกิจ ทักษะในการพูดและการสื่อสาร มารยาทในการเข้าสังคม การบริหารอารมณ์"
    },
    {
        "subjectId": "06026124",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การแสดงข้อมูลด้วยแผนภาพ",
        "engSubjectsName": "Data Visualization",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการการแสดงข้อมูลด้วยแผนภาพ การออกแบบการแสดงข้อมูลด้วยแผนภาพ เครื่องมือที่ใช้ การแสดงข้อมูลด้วยแผนภาพ การได้มาซึ่งข้อมูล การจัดระเบียบข้อมูล การเลือกแผนภูมิต่างๆ ที่เหมาะสม เช่น ฮีทโตรแกรม แผนภูมิการกระจาย แผนภูมิเส้น แผนภูมิแท่ง แผนภูมิวงกลม แผนภูมิต้นไม้ แผนภูมิแบบเครือข่าย กราฟสตรีม แผนภูมิตัวชี้วัดผลงาน แผนที่ แผนภูมิแบบปฏิสัมพันธ์ การอธิบายแผนภูมิ"
    },
    {
        "subjectId": "06026125",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การเรียนรู้ของเครื่องจักร",
        "engSubjectsName": "Machine Learning",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ความรู้พื้นฐานของการเรียนรู้ของเครื่องจักร การเรียนรู้แบบมีผู้สอน การถดถอยเชิงเส้น วิธีกำลังสองน้อยที่สุด การถดถอยโลจิสติก โครงข่ายประสาทเทียม อัลกอริทึมเพื่อนบ้านที่ใกล้ที่สุด ซัพพอร์ทเวกเตอร์แมชชีน การเรียนรู้แบบไม่มีผู้สอน การจัดกลุ่มแบบเคมีน อัลกอริทึมการหาค่าความคาดหวังสูงสุด การลดมิติข้อมูล การวิเคราะห์องค์ประกอบหลัก การตรวจสอบไขว้ การประเมินผลของการทำนาย การประยุกต์ใช้ของการเรียนรู้ของเครื่องจักร"
    },
    {
        "subjectId": "06026126",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การบริหารเชิงกลยุทธ์และสมรรถะของธุรกิจ",
        "engSubjectsName": "Business Strategic and Performance Management",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "แนะนำการวางแผนเชิงกลยุทธ์ของธุรกิจ การกำหนดสมรรถนะของธุรกิจและการเลือกหลักการวัดสมรรถนะ  กระบวนการบริหารสมรรถนะของธุรกิจ การวางแผนสมรรถนะ การนำแผนไปสู่การปฏิบัติ การประเมินสมรรถนะ และการพิจารณาทบทวนสมรรถนะ การแนะนำระบบการบริหารสมรรถนะของธุรกิจ และแนวทางปฏิบัติที่ดีของการบริหารสมรรถนะของธุรกิจ"
    },
    {
        "subjectId": "06026127",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "โครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1",
        "engSubjectsName": "Project in Data Science and Business Analytics 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา สามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ"
    },
    {
        "subjectId": "060261xx",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "หัวข้อพิเศษวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1",
        "engSubjectsName": "Selected Topic in Data Science and Business Analytics 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06026128",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "โครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 2",
        "engSubjectsName": "Project in Data Science and Business Analytics 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา สามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงานวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ 1"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกทางมนุษยศาสตร์ 2",
        "engSubjectsName": "Elective Course in Humanity 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06026130 หรือ 06026131",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "สหกิจศึกษาทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ หรือ สหกิจศึกษาต่างประเทศทางวิทยาการข้อมูลและการวิเคราะห์เชิงธุรกิจ",
        "engSubjectsName": "Cooperative Education in Data Science and Business Analytics or Cooperative Education in Data Science and Business Analytics",
        "category": "หมวดวิชาบังคับ",
        "credit": "6(0-35-0)"
    }
]