[
    {
        "subjectId": "06016301",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ",
        "engSubjectDetails": "Evolution of information technology; components of computer systems; data processing systems; hardware and software; overview of operating system; data and data representation; data management; basic concepts for programming; database technology; data communication; computer network systems and the Internet; ethical and social issues in information technology"
    },
    {
        "subjectId": "06016314",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Problem Solving in Information Technology",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำการเขียน โปรแกรมคอมพิวเตอร์",
        "engSubjectDetails": "Problem solving strategies and concepts; algorithmic thinking; flowchart; concepts and introduction to computer programming."
    },
    {
        "subjectId": "06016319",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ระบบคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Systems",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบจำนวน ระบบฐานสอง พีชคณิตบูลีน เทคนิคการออกแบบเชิงดิจิทัล ลอจิกเกตและการลดจำนวน วงจรเชิงผสมเบื้องต้น หน่วยคำนวณและตรรกะ วิวัฒนาการของคอมพิวเตอร์ องค์ประกอบของระบบคอมพิวเตอร์และการเชื่อมต่อระหว่างกัน วิธีการคำนวณทางคณิตศาสตร์ของเครื่องคอมพิวเตอร์",
        "engSubjectDetails": "Number systems, binary system, Boolean algebras, digital design techniques, logic gate and minimization, basic combinational circuits, arithmetic logic units, computer evolution, computer function and interconnection, computer arithmetic."
    },
    {
        "subjectId": "90101007",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201001",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401013",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016302",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชัน อนุพันธ์อันดับสูง การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน การอินทิเกรตและเทคนิคของการอินทเกรต การประยุกต์ของการอินทิเกรต ฟังก์ชันสองตัวแปร อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์ ระบบสมการเชิงเส้น และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก",
        "engSubjectDetails": "Limit and continuity, derivative of functions, higher derivatives, applications of derivative, maxima and minima of functions, integration and techniques of integration, applications of integration, functions of two variables, partial derivatives, linear algebra, matrices and determinants, system of linear equations and its solutions, vector spaces, linear transformations, matrix transformation, orthogonal matrix."
    },
    {
        "subjectId": "06016311",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีสื่อประสม",
        "engSubjectsName": "Multimedia Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบสื่อประสม ประเภทข้อมูลของสื่อประสม การสร้างสื่อประสม การประมวลผลข้อมูลสื่อประสม การส่งผ่านข้อมูลสื่อประสม ประเภทของไฟล์สื่อประสม อุปกรณ์การเก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม แอพลิเคชั่นสื่อประสม เครื่องมือการประพันธ์สื่อประสม",
        "engSubjectDetails": "Multimedia Systems; types of multimedia data; creation of multimedia; multimedia data processing; multimedia data transmission; multimedia file formats; multimedia data storage devices; multimedia data presentation; applications of multimedia; multimedia authoring tools."
    },
    {
        "subjectId": "06016315",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนะนำภาษาการสร้างโปรแกรม การเขียนผังงาน แนวคิดของโปรแกรมภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้นและข้อความสั่งกำ หนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การประมวลผลสตริง การเขียนการเขียนฟังก์ชัน ตัวชี้ การเขียนข้อมูลชนิดโครงสร้าง การกำหนดคุณสมบัติของตัวแปร การจัดการหน่วยความจำ แฟ้มอินพุตและเอาต์พุต การประยุกต์ใช้กับไมโครคอนโทรลเลอร์",
        "engSubjectDetails": "Introduction to programming languages; flowchart; concepts of C programming language; data and data types in C; assignment statement and basic functions; conditional and loop structures; array; string; function; pointer; structure; variable storage class; memory management; file input and output; micro-controller programming."
    },
    {
        "subjectId": "06016320",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "โครงสร้างระบบคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "Computer Systems Organization and Operating System",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "องค์ประกอบของคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ อินพุตและเอาต์พุต การทำงานร่วมกันขององค์ประกอบต่างๆ ภาพรวมการทำงานของระบบปฏิบัติการ กระบวนการ โพรเซสและเธรด การสลับการทำงาน การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการแฟ้ม อินพุตและเอาต์พุต",
        "engSubjectDetails": "Computer components; CPU; memory; I/O; components co-operation; overview of operating system; process and thread; processing switching; memory management; virtual memory; file; input/output management."
    },
    {
        "subjectId": "90201002",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201012",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skill in English",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016303",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "Discrete Mathematics",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกและเซ็ท ความสัมพันธ์และฟังก์ชัน คอมบินาทอรี่ส์ กราฟและทรี พีชคณิตบูลีน ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด",
        "engSubjectDetails": "Number systems, logic and sets, relations and functions, combinatories, graphs and trees, Boolean algebra, algebraic systems, coding and information theories, and finite state automata."
    },
    {
        "subjectId": "06016305",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "90401013 GENERAL BUSINESS",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม",
        "engSubjectDetails": "Roles of information technology in business; information system concepts and management; IT strategy; strategic information technology planning; aligning IT with business strategy; information system acquisition; functional information systems; enterprise systems; trends in applications of information technology; ethical and social issues."
    },
    {
        "subjectId": "06016312",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีเว็บ",
        "engSubjectsName": "Web Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "องค์ประกอบและแนวคิดพื้นฐานของระบบเว็บ หลักการทำงานของระบบเว็บ แนะนำเทคโนโลยีเว็บฝั่งไคลแอนท์ ได้แก่ เอชทีเอ็มแอล ซีเอสเอส จาวาสคริปต์ และ ดีโอเอ็ม เทคโนโลยีเว็บฝั่งเซิร์ฟเวอร์สำหรับการสร้างหน้าเว็บแบบปรับเปลี่ยนเนื้อหาได้ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ บริการทั่วไปบนอินเทอร์เน็ตและเว็บ เช่น เซิร์จเอ็นจินต์ บริการวีดีโอสตรีมมิ่ง บริการแผนที่และการระบุตำแหน่ง",
        "engSubjectDetails": "Components and basic concepts of a web system; how a web system works; introduction to client-side web technologies i.e. HTML, CSS, JavaScript and DOM; technologies for creating server-side dynamic web pages; tools for web design and development; common Internet and web services e.g. search engines, video streaming services, map and location services."
    },
    {
        "subjectId": "06016313",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการพื้นฐานเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูล สถาปัตยกรรมเครือข่าย การแบ่งระดับชั้นการทำงานเครือข่ายแบบโอเอสไอและทีซีพีไอพี โพรโทคอลระดับแอพลิเคชัน สถาปัตยกรรมแอพลิเคชัน โพรโทคอลระดับทรานสปอร์ต รูปแบบการส่งข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโทคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิทชิงและแพ็คเก็ตสวิทชิง โพรโทคอลอินเตอร์เน็ต รูปแบบการหาเส้นทาง โพรโทคอลระดับดาต้าลิงก์ การควบคุมการเข้าถึงสื่อ ระบบหมายเลขที่อยู่บนเครือข่าย เทคโนโลยีอีเทอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายเสมือน เครือข่ายพื้นที่กว้าง เครือข่ายท้องถิ่นแบบไร้สาย โพรโทคอลและฟังก์ชั่นการทำงานระดับกายภาพ",
        "engSubjectDetails": "Basic concepts of computer networks and data communications; network architecture; OSI and TCP/IP network layering model; application layer protocols, application architecture; transport layer protocols, reliable data transfer model, congestion control; network layer protocols, circuit and packet switching networks, internet protocol, routing models; data link layer protocols, medium access control, network addressing systems, Ethernet technology, local area network (LAN), virtual LAN (VLAN), wireless LAN, and wide area network (WAN); Physical layer protocols and its functions."
    },
    {
        "subjectId": "06016316",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Data Structures and Algorithms",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016315 PROBLEM SOLVING IN INFORMATION TECHNOLOGY or 06016315 COMPUTER PROGRAMMING",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต",
        "engSubjectDetails": "Data types; data structures and abstract data types; basic data structures e.g. list, stack, and queue; dynamic data structures; terminology of trees; binary trees; binary search trees; AVL trees; graph; time and space analysis of programs; sorting and searching algorithms; greedy algorithm; divide and conquer algorithm; graph algorithms; and dynamic programming."
    },
    {
        "subjectId": "06016317",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การสร้างโปรแกรมเชิงอ็อบเจกต์",
        "engSubjectsName": "Object-Oriented Programming",
        "year": 2,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016315 COMPUTER PROGRAMMING",
        "thaiSubjectDetails": "การออกแบบและพัฒนาโปรแกรมเชิงอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะ ภาวะพหุสัณฐาน การพัฒนาส่วนต่อประสานกราฟิกกับผู้ใช้ และการจัดการกับเหตุการณ์ อาร์เรย์และคอลเลคชัน การจัดการกับสิ่งผิดปกติ คลาสที่เกี่ยวข้องกับอินพุตและเอาต์พุต เธรด",
        "engSubjectDetails": "Object-oriented program design and development; encapsulation; classes and objects; methods and message passing; inheritance and polymorphism; graphical user interface development and event handling; data structures: arrays and collections; exception handling; input/output classes; threads."
    },
    {
        "subjectId": "06016304",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์",
        "engSubjectDetails": "Probability and random variables, some discrete and continuous probability distributions, functions of random variables, sampling distribution, estimation and test of hypotheses, simple and multiple linear regression and correlation analyses."
    },
    {
        "subjectId": "06016306",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศ",
        "engSubjectsName": "Information Systems Analysis and Design",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การพัฒนาระบบเชิงอ็อบเจกต์ การวิเคราะห์และออกแบบ การเลือกโครงการและการจัดการ โครงการสารสนเทศ กำหนดความต้องการระบบ การวิเคราะห์ด้วยยูสเคส แบบจำลองกระบวนการ แบบจำลองข้อมูล การออกแบบสถาปัตยกรรมและกลยุทธการออก การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบส่วนจัดเก็บข้อมูล การออกแบบโปรแกรม คลาสและเมธอด การสร้างและการติดตั้งระบบ",
        "engSubjectDetails": "Object-oriented approaches to system development; system analysis and design; project selection and management; system requirement determination; use case analysis; process model; data model; design strategy and architecture design; user interface design; data storage design; program, class, and method design; system implementation and installation."
    },
    {
        "subjectId": "06016308",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "year": 2,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016316 DATA STRUCTURE AND ALGORITHM",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพ แวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่างเอนทิตี นอร์มัลไลซ์เซชัน เอสคิวแอล แนะนำการจัดการทรานแซคชันและการบริหารฐานข้อมูล ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล แนะนำข้อมูลสนันสนุนการตัดสินใจสำหรับระดับบริหารและระบบคลังข้อมูล",
        "engSubjectDetails": "Introduction to the database and DBMS; file systems; database systems and environment; database management systems; types of databases; data models; relational database model; tables; keys; integrity rules; data dictionary; entity relationship model; normalization; SQL; introduction to transaction management and database administration; data modeling and database language laboratory; introduction to decision support data for management level and data warehouse."
    },
    {
        "subjectId": "90201026",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการสื่อสาร",
        "engSubjectsName": "English for Communication",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016321",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "วิศวกรรมซอฟต์แวร์",
        "engSubjectsName": "Software Engineering",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016306 INFORMATION SYSTEMS ANALYSIS AND DESIGN",
        "thaiSubjectDetails": "ความรู้เบื้องต้นเกี่ยวกับวิศวกรรมซอฟต์แวร์ กลุ่มซอฟต์แวร์และแนวโน้มความเปลี่ยนแปลง กรอบงานของกระบวนการวิศวกรรมซอฟต์แวร์ กระบวนการพัฒนาซอฟต์แวร์แบบอไจล์ แม่แบบสำหรับการ ออกแบบ วิธีปฏิบัติด้านวิศวกรรมซอฟต์แวร์ สภาพแวดล้อมการพัฒนาซอฟต์แวร์โดยใช้เวอร์ชั่นคอนโทรล แบบจำลองวุฒิภาวะและความสามารถเชิงบูรณาการ (ซีเอ็มเอ็มไอ) วิศวกรรมความต้องการ วิศวกรรมการวิเคราะห์และออกแบบ ความรู้เบื้องต้นเกี่ยวกับการทดสอบซอฟต์แวร์ กระบวนการยูนิฟาย์ การประเมินกระบวนการ และแบบจำลองกระบวนการเชิงบัญญัติและเชิงวิวัฒน์",
        "engSubjectDetails": "Introduction to software engineering; software categories and evolution; software engineering process framework; agile software development methodology; design pattern; software engineering practice; software development environment using version control; capability maturity model integration (CMMI); requirement engineering; analysis and design engineering; introduction to software testing; unified process; process evaluation; and prescriptive and evolutionary process models."
    },
    {
        "subjectId": "06016322",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การสร้างโปรแกรมเว็บ",
        "engSubjectsName": "Web Programming",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การพัฒนาไดนามิกเว็บเพจ โพรโทคอลเอชทีทีพี แม่ข่ายเว็บ การพัฒนาโปรแกรมเว็บฝั่งแม่ข่าย การจัดการคุ้กกี้ การติดตามเซสชัน การพัฒนาโปรแกรมเว็บติดต่อกับฐานข้อมูล จาวาสคริปต์และเทคโนโลยีเอ แจ๊กซ์",
        "engSubjectDetails": "Dynamic web pages development; HTTP protocol; web servers; server-side web programming; cookies handling; session tracking; web database application development; Javascript and AJAX technology."
    },
    {
        "subjectId": "06016331",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์ภาคปฏิบัติ",
        "engSubjectsName": "Practical Computer Networking",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "การนำทฤษฎีการเชื่อมโยงเครือข่ายคอมพิวเตอร์ไปปฏิบัติกับอุปกรณ์เชื่อมโยงเครือข่าย เช่น อุปกรณ์หาเส้นทาง และอุปกรณ์สวิทชิ่ง และระบบปลายทางอย่างระบบเครือข่ายไอพี ทั้งแบบเซกเมนต์เดียว และหลายเซกเมนต์ โพรโทคอลการหาเส้นทางแบบสถิตและพลวัต การควบคุมการเข้าถึงเครือข่าย การสร้างเครือข่ายด้วยอุปกรณ์แลนสวิทชิ่ง การสร้างเครือข่ายแลนเสมือน โพรโทคอลชั้นทรานสปอร์ตต่างๆ ไอพีเวอร์ชั่น 4 ไอพีเวอร์ชั่น 6 โพรโทคอลสนับสนุนการแปลงหมายเลขไอพี โพรโทคอลการตั้งค่าโฮสแบบพลวัต ดีเอชซีพี และโพรโทคอลบนเครือข่ายพื้นที่กว้าง เช่น พีพีพี และเฟรมรีเลย์",
        "engSubjectDetails": "Taking computer networking theory into practice with network equipments (i.e., routers, switches), and end-systems in the areas of both single segment IP networks and multiple segment IP networks; static and dynamic routing protocols; network access control; LAN switching, virtual LAN (VLAN); transport layer protocols; IPv4, IPv6; Network Address Translation (NAT) protocol; Dynamic Host Configuration Protocol (DHCP); WAN Protocols (i.e. PPP, and frame-relay)."
    },
    {
        "subjectId": "06016332",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การเชื่อมต่อเครือข่ายสื่อสาร",
        "engSubjectsName": "Interconnected Communication Networks",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความต้องการการเชื่อมต่อเครือข่ายสื่อสารในการใช้งานจริง โพรโตคอลเพื่อรองรับการทำงานผิดพลาดในเครือข่าย โพรโตตอลเลือกเส้นทางแบบพลวัต เช่น อาร์ไอพี โอเอสพีเอฟ ไอเอสไอเอส บีจีพี เป็นต้น แนวคิดเครือข่ายพื้นที่กว้าง เช่น พีพีพี เฟรมรีเลย์ เอ็มพีแอลเอส การติดตั้งที่อยู่และการเปลี่ยนแปลงของไอพีเวอร์ชั่น 6 ความมั่นคงบนเครือข่าย การควบคุมการเข้าถึงเครือข่าย โพรโตคอลของการสื่อสารเครือข่ายไร้สาย",
        "engSubjectDetails": "Requirements for interconnected networks in practical scenarios; network redundancy protocols; dynamic routing protocols such as RIP, OSPF, IS-IS and BGP; Wide Area Network (WAN) technologies, such as PPP, Frame-Relay, MPLS; IPv6 addressing and transition; network security; network access control; wireless LAN communication protocols."
    },
    {
        "subjectId": "06016341",
        "cooperativeEducation": false,
        "subjectAreas": "พัฒนาสื่อประสมและเกม ",
        "thaiSubjectsName": "การโปรแกรมสื่อประสม",
        "engSubjectsName": "Multimedia Programming",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนวคิดพื้นฐานโปรแกรมประยุกต์สื่อประสมบนเว็บไซต์และมือถือ ได้แก่ แพลทฟอร์ม สถาปัตยกรรม และกระบวนการพัฒนา เทคนิคการโปรแกรมสำหรับการจัดการและควบคุมสื่อดิจิทัล การโปรแกรมอนิเมชั่นแบบมีปฏิสัมพันธ์ การโปรแกรมอนิเมชั่นสองมิติ การโปรแกรมเกม และการโปรแกรมแบบเชิงเหตุการณ์ การพัฒนาโปรแกรมส่วนเชื่อมต่อประสานกับผู้ใช้แบบหลากหลายสื่อ เครื่องมือในการพัฒนา ไลบรารี่ และมาตรฐานการเชื่อมต่อกับโปรแกรมประยุกต์สื่อประสม การฝึกปฎิบัติเพื่อการพัฒนาทักษะในการสร้างเนื้อหาและโปรแกรมประยุกต์สื่อประสม",
        "engSubjectDetails": "Basic concepts in multimedia applications for web and mobile i.e. platforms, architectures, and development process; programming techniques for handling and manipulating digital multimedia; interactive animation programming; 2D animation; game and event driven programming; development of rich media user interface; technologies and standard for web and mobile based applications development; multimedia software development tools; libraries and applications programming interfaces; hand-on development of skills for multimedia content and application development."
    },
    {
        "subjectId": "06016342",
        "cooperativeEducation": false,
        "subjectAreas": "พัฒนาสื่อประสมและเกม ",
        "thaiSubjectsName": "คอมพิวเตอร์กราฟิกส์และแอนิเมชัน",
        "engSubjectsName": "Computer Graphics and Animation",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "กราฟิกแบบราสเตอร์และแบบเวกเตอร์ การจัดเก็บข้อมูลรูปทรงวัตถุแบบสองและสามมิติ กระบวนการสร้างภาพสามมิติ เทคนิคการฉายภาพและการแปลง เทคนิคด้านแสงและแสงเงาสามมิติ เทคนิคการสร้างลวดลายของพื้นผิวสามมิติ เทคนิคการเรนเดอร์ภาพสามมิติ แนวคิดพื้นฐานการสร้างภาพเคลื่อนไหวด้วยคอมพิวเตอร์แบบสองและสามมิติ การใช้งานซอฟต์แวร์สร้างภาพกราฟิกสามมิติและการสร้างภาพเคลื่อนไหวสามมิติเบื้องต้น",
        "engSubjectDetails": "Raster and vector graphics; 2D and 3D object representations; 3D rendering pipeline; 3D projection and transformation techniques; 3D lighting and shading techniques; 3D texture mapping techniques; 3D rendering techniques; basic 2D and 3D computer animation concepts; use of 3D computer graphics application software for basic 3D modeling and animation."
    },
    {
        "subjectId": "06016309",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฏหมายไอที",
        "engSubjectsName": "Information System Security and IT Laws",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ กฎหมายและปัญหาจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ อาชญากรรมคอมพิวเตอร์",
        "engSubjectDetails": "Information system security; threats, vulnerabilities, risk assessment and analysis; information system security policies; information system security management; cryptography; authentication; access control; network security; IT laws and ethical problems associated with Information Technology; privacy and confidentiality; computer crime."
    },
    {
        "subjectId": "06016310",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "Human Interface Design",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการออกแบบโดยอาศัยผู้ใช้เป็นศูนย์กลาง ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ ขอบเขตของการออกแบบการเชื่อมต่อกับผู้ใช้และการออกแบบประสบการณ์ในการใช้งาน กระบวนการในการออกแบบการเชื่อมต่อกับผู้ใช้ เครื่องมือในการออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมิน การออกแบบการเชื่อมต่อกับผู้ใช้บนระบบปฏิบัติการสมัยใหม่และอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ",
        "engSubjectDetails": "Principles of user-centered design; human factors and psychological principles for user interface design; human-machine interface technologies; interaction models; interaction styles; scope of user interface design and user experience design; user interface design process; design tools; design principles and guidelines; evaluation techniques; user interface design for modern operating systems and mobile computing devices."
    },
    {
        "subjectId": "90304004",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016323",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การโปรแกรมอุปกรณ์เคลื่อนที่",
        "engSubjectsName": "Mobile Device Programming",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การแนะนำเทคโนโลยีและการเขียนโปรแกรมที่เกี่ยวข้องกับอุปกรณ์เคลื่อนที่ ได้แก่ มือถือแบบสมาร์ทโฟน แพด และแทบเลต การพัฒนาและทดสอบโปรแกรมประยุกต์สำหรับอุปกรณ์ เคลื่อนที่โดยการทำงานจริงบนเครื่องจำลอง",
        "engSubjectDetails": "Introduction to technology and the programming of applications for mobile computing including devices i.e. smart phones, pads, and tablets; developing mobile applications and using device emulators for coding and testing."
    },
    {
        "subjectId": "06016324",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "วิศวกรรมความต้องการ",
        "engSubjectsName": "Requirement Engineering",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "เทคนิคการจัดการความต้องการ การวิเคราะห์ปัญหา การเข้าถึงและเก็บเกี่ยวความต้องการจาก ผู้ที่มีส่วนได้ส่วนเสีย การจัดทำเอกสารโดยใช้ยูสเคสโมเดล การจัดลำดับชั้นของเอกสาร การกำหนดระดับของ ความต้องการ การนิยามระบบ การจัดการขอบเขตและความคาดหวัง การกลั่นกรองความชัดเจนของระบบ คุณลักษณะของความต้องการ การติดตามย้อนรอยความต้องการ การบริหารจัดการการเปลี่ยนแปลงความต้องการ การนำความต้องการมาขับเคลื่อนการออกแบบ การทดสอบ การจัดทำเอกสารสำหรับผู้ใช้งาน",
        "engSubjectDetails": "Requirements management technique; problem analysis; stakeholder needs; document requirements with use-case model; document hierarchy and standard for define requirements level; system definition; scope managing; requirement attributes and traceability; manage change; using requirements to drive ongoing design, test, and user documentation."
    },
    {
        "subjectId": "06016325",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การโปรแกรมเชิงบริการ",
        "engSubjectsName": "Service-Oriented Programming",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนวคิดและโครงสร้างของเว็บเซอร์วิส มาตรฐานเว็บเซอร์วิส การพัฒนาและติดตั้งโปรแกรม ประยุกต์เว็บเซอร์วิส หลักการออกแบบสถาปัตยกรรมเชิงบริการ ลักษณะและประโยชน์ของตัวกลาง เชื่อมต่อบริการ ของระบบต่างๆ การจัดการกระบวนการทางธุรกิจ",
        "engSubjectDetails": "Concepts and structures of web services; web services standards; development and deployment of web service applications; concepts of Service-Oriented Architecture (SOA); features and benefits of enterprise service bus (ESB); business process management (BPM)."
    },
    {
        "subjectId": "06016333",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เทคโนโลยีการให้บริการอินเตอร์เน็ต",
        "engSubjectsName": "Internet Service Technology",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความรู้พื้นฐานของการให้บริการอินเตอร์เน็ต การให้บริการเชื่อมต่อเครือข่ายอินเตอร์เน็ต หลักการทำงานและการประยุกต์ใช้งานของ เทลเน็ต เอฟทีพี ระบบดีเอ็นเอส ระบบจดหมายอิเล็กทรอนิกส์ โพรโทคอลเอสเอ็มทีพี พีโอพี ไอเอ็มเอพี ระบบเว็บและโพรโทคอลเอชทีทีพี ไฟร์วอลล์ และ การแปลงที่อยู่เครือข่าย กรณีศึกษาในห้องปฏิบัติการโดยใช้ซอฟท์แวร์ต่างๆ ที่ทำงานบนระบบปฏิบัติการลักษณะยูนิกส์ เพื่อให้สามารถนำไปสร้างระบบสำหรับการให้บริการในระบบเครือข่ายอินเทอร์เน็ตได้",
        "engSubjectDetails": "Basics of Internet services; Internet connectivity services; Internet applications of TELNET, FTP, Domain Name System (DNS); electronic mail system with SMTP, POP and IMAP; web system with HTTP; firewall; Network Address Translation (NAT); case studies in laboratories with software on UNIX-based operating system for creating Internet services."
    },
    {
        "subjectId": "06016334",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เทคโนโลยีเครือข่ายไร้สาย",
        "engSubjectsName": "Wireless Network Technology",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ภาพรวมของเทคโนโลยีเครือข่ายไร้สายและการประยุกต์ใช้งาน พื้นฐานการส่งผ่านแบบไร้สาย การแพร่กระจายคลื่นวิทยุ เสาอากาศ การม๊อดดูเลท การมัลติเพล็กซ์ การควบคุมการเข้าถึงแบบหลายทางพร้อมกัน เครือข่ายท้องถิ่นแบบไร้สาย มาตรฐาน IEEE 802.11 การสำรวจสถานที่ การวางแผน การออกแบบและการปรับใช้เครือข่ายท้องถิ่นแบบไร้สาย ความปลอดภัยบนเครือข่ายท้องถิ่นแบบไร้สายและมาตรฐานที่เกี่ยวข้อง เครือข่ายส่วนบุคคลแบบไร้สาย เครือข่ายเมืองแบบไร้สาย เครือข่ายระยะไกลแบบไร้สาย การจัดการและการแก้ปัญหาเครือข่ายไร้สายเบื้องต้น",
        "engSubjectDetails": "An overview of wireless network technologies and applications; wireless transmission basis: radio propagation, antennas, modulation, multiplexing, multiple access control; wireless local area network (WLAN); IEEE 802.11 standard; site survey; planning; design and deploying WLAN; WLAN security and related standards; wireless personal area network (WPAN); wireless metropolitan area network (WMAN); wireless wide area network (WWAN); managing and troubleshooting wireless network basics."
    },
    {
        "subjectId": "06016335",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีกลุ่มเมฆเบื้องต้น",
        "engSubjectsName": "Introduction to cloud computing",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "การแนะนำโครงสร้างของระบบคลาวด์, รูปแบบการให้บริการของระบบคลาวด์, รูปแบบการติดตั้งระบบคลาวด์, เทคโนโลยีที่ใช้ในการสร้างระบบคลาวด์, การบริหารจัดการระบบคลาวด์, ความปลอดภัยสำหรับระบบคลาวด์, ค่าชี้วัดประสิทธิภาพของการบริการ และ ค่าชี้วัดในทางธุรกิจและรูปแบบการคิดค่าบริการของบริการของระบบคลาวด์",
        "engSubjectDetails": "Introduction to cloud architecture, cloud delivery models, cloud deployment models, cloud-Enabling technology, cloud management, cloud security, service quality metrics, and business cost metrics and pricing models  for cloud services"
    },
    {
        "subjectId": "06016343",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การออกแบบและพัฒนาเกม",
        "engSubjectsName": "Game Design and Development",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "ประเภทของเกม แนวคิดและแนวปฏิบัติในการออกแบบเกม กระบวนการพัฒนาเกม การออกแบบตัวละคร การออกแบบวิธีการเล่าเรื่องในเกม การออกแบบโครงสร้างหลักของเกม การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบกลไกหลักของเกม การออกแบบระดับชั้นของเกม ระเบียบวิธีคิดที่สำคัญสำหรับการพัฒนาเกม การพัฒนาเกมคอมพิวเตอร์เบื้องต้น",
        "engSubjectDetails": "Game genres; game design concepts and guidelines; game development process; storytelling design; gameplay design; user interface design; core mechanic design; level design; important algorithms for game; computer game development."
    },
    {
        "subjectId": "06016344",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "หลักการออกแบบกราฟิกส์",
        "engSubjectsName": "Graphics Design Principles",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนะนำศิลปะในรูปแบบต่าง ๆ หลักการและองค์ประกอบพื้นฐานของการออกแบบ ทฤษฎีสี หลักการจัดองค์ประกอบศิลป์ ตัวพิมพ์ การร่างและวาดภาพ ประเภทของซอฟต์แวร์เพื่อการออกแบบกราฟิก เรียนรู้ทักษะเชิงปฏิบัติในการสร้างเนื้อหากราฟิกสำหรับสื่อดิจิทัล",
        "engSubjectDetails": "Introduction to different art forms, basic principles and elements of design, color theories, composition principles, typography, sketching and drawing, types of graphics design software tools, learning practical skills in creating graphics for digital media."
    },
    {
        "subjectId": "06016345",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "คอมพิวเตอร์แอนิเมชันสามมิติ",
        "engSubjectsName": "3D Computer Animation",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "หลักการพื้นฐานของการทำแอนิเมชัน เทคนิคด้านแสงและแสงเงาสามมิติขั้นสูง เทคนิคการสร้างภาพเคลื่อนไหวด้วยคอมพิวเตอร์สามมิติ แนวคิดและเทคนิคการสร้างโมเดลและภาพเคลื่อนไหวของตัวละคร การใช้ซอฟต์แวร์คอมพิวเตอร์แอนิเมชันสามมิติในการสร้างภาพเคลื่อนไหวของตัวละครขั้นสูง การประมวลผลหลังการสร้างภาพสำหรับคอมพิวเตอร์แอนิเมชันสามมิติ",
        "engSubjectDetails": "Fundamental principles of animation; 3D computer animation concepts; advanced lighting and shading techniques; concepts and techniques for character modeling and animation; use of 3D computer animation software for advance character modeling and animation; post production techniques for 3D computer animation."
    },
    {
        "subjectId": "06016307",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ องค์ความรู้สำหรับการบริหารโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการ การประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ การจัดการความเสี่ยง การควบคุมโครงการ และประเมินผลโครงการ",
        "engSubjectDetails": "Nature and life cycle of information technology (IT) projects; project feasibility; project selection techniques; project management body of knowledge; team management; project scope management; project estimation; project scheduling; quality management; change management; project controlling; project evaluation."
    },
    {
        "subjectId": "06016318",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "สัมมนาทางด้านทักษะการสื่อสารในวิชาชีพ",
        "engSubjectsName": "Seminar on Professional Communication Skills",
        "year": 3,
        "semeter": 2,
        "credit": "1(1-0-2)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ทักษะต่างๆ สำหรับการสมัครงานและการประกอบอาชีพ เทคนิคการเขียนจดหมายสมัครงาน เทคนิคการสอบสัมภาษณ์งาน  การพัฒนาบุคลิกภาพและการแต่งกาย ทักษะในการนำเสนองานทางธุรกิจ  ทักษะในการพูดและการสื่อสาร มารยาทในการเข้าสังคม การบริหารอารมณ์",
        "engSubjectDetails": "Skills for applying to a job and working, resume and application letter writing, job interview techniques, wardrobe and personality development, business presentation skills, voice communication skills, social etiquette, EQ."
    },
    {
        "subjectId": "060163xx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Elective Course in Information Technology 1",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06016326",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การทวนสอบและตรวจสอบซอฟต์แวร์",
        "engSubjectsName": "Software Verification and Validation",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016306 INFORMATION SYSTEMS ANALYSIS AND DESIGN",
        "thaiSubjectDetails": "บทบาทของวีแอนด์วีในวิวัฒนาการของซอฟต์แวร์ การตรวจทานเชิงเทคนิค ระดับของการ ทดสอบซอฟต์แวร์ เทคนิคการทดสอบซอฟต์แวร์ การพิสูจน์ความถูกต้อง การจำลองและการสร้างตัวแบบ การตามรอยความต้องการ การวางแผนการทวนสอบและการตรวจสอบซอฟต์แวร์ กิจกรรมการตามรอยการทดสอบ การประเมินและติดตามปัญหา",
        "engSubjectDetails": "Role of V&V in software evolution; software technical reviews; levels of software testing; testing techniques; proof of correctness; simulation and prototyping; requirements tracing; software V&V planning; tracking test activities; problem tracking and assessment."
    },
    {
        "subjectId": "06016327",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การพัฒนาคลาวด์แอปพลิเคชันระดับองค์กร",
        "engSubjectsName": "Cloud-Based Enterprise Application Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016325 SERVICES-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "ความรู้เบื้องต้นของเทคโนโลยีคลาวด์ สถาปัตยกรรมคลาวด์ คุณลักษณะการสร้างเครื่องจำลองและการให้บริการผู้ใช้หลายคนพร้อมกัน หลักการพัฒนาแอปพลิเคชันสำหรับองค์กรในคลาวด์ การพัฒนาแอปพลิเคชันโดยวิธีการประกาศและวิธีระบุปัญหา ข้อจำกัดของการกำกับดูแล ประเด็นที่พบบ่อยระหว่างการพัฒนาคลาวด์แอปพลิเคชันแบบคลาวด์ ปัจจัยด้านความต้องการหรือความสามารถในการเลือกรูปแบบการพัฒนาที่เหมาะสม การวิเคราะห์ข้อมูลโดยใช้แพลตฟอร์มแบบคลาวด์ หลักการจัดการฐานข้อมูลคลาวด์ โนเอสคิวเแอล",
        "engSubjectDetails": "Introduction to Cloud Technology, Cloud Architecture, Virtualization and Multi-Tenancy Features, Principles to Develop Enterprise Application in Cloud, Declarative and Problematic Application Development, Governance Limits, Frequently Encountered Issues during Cloud-based Application Development, Requirement or Capability Factors towards the Selection of Appropriate Development Paradigms, Data Analytics Using Cloud Platforms, principle to cloud database management, NoSQL."
    },
    {
        "subjectId": "06016328",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "เครื่องมือและสภาพแวดล้อมสำหรับการพัฒนาซอฟต์แวร์",
        "engSubjectsName": "Software Development Tools and Environments",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการเพื่อเป็นผู้เชี่ยวชาญด้านซอฟต์แวร์ บทบาทของแอพพลิเคชันในงานด้านวิศวกรรมซอฟต์แวร์ เครื่องมือการพัฒนาซอฟต์แวร์แบบอไจล์ การติดตามความคืบหน้าของการพัฒนาผลิตภัณฑ์ การจัดการเวอร์ชั่นและการกำหนดค่า เครื่องสำหรับสร้างและการบูรณาการอย่างต่อเนื่อง เครื่องสำหรับแก้จุดบกพร่องและการรวบรวมข้อมูลเชิงประสิทธิภาพชองโปรแกรม สภาพแวดล้อมแบบร่วมมือพัฒนา เครื่องมือสำหรับการควบรวบรวมและติดตั้ง",
        "engSubjectDetails": "Principles to Software Professionals, Roles of Applications in Software Engineering Tasks, Agile Software Development Tools, Product Development Tracking, Version and Configuration Management, Build and Continuous Integration Tools, Program Debugging and Profiling Tools, Collaborative Development Environments, Packaging and Deployment Tools"
    },
    {
        "subjectId": "06016336",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การจัดการเครือข่ายและโครงสร้างพื้นฐานเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Network and Information Technology Infrastructure Management",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "หลักการการจัดการเครือข่ายและโครงสร้างพื้นฐานไอทีเบื้องต้นองค์ประกอบและหน้าที่การทำงานของเครือข่ายการจัดการระบบเครือข่ายและการจัดการเครือข่ายด้านต่างๆได้แก่การจัดการด้านการปรับตั้งค่าด้านความผิดพลาดด้านประสิทธิภาพด้านบัญชีและด้านความมั่นคงปลอดภัยสถาปัตยกรรมการจัดการเครือข่ายระบบจัดการและกรอบการทำงานโพรโทคอลและมาตรฐานการจัดการเครือข่าย โพรโทคอลเอสเอ็นเอ็มพีตัวอย่างซอฟต์แวร์และผลิตภัณฑ์การจัดการเครือข่ายการจัดการโครงสร้างพื้นฐานทางด้านเทคโนโลยีสารสนเทศองค์ประกอบและหน้าที่การทำงานของโครงสร้างพื้นฐานไอทีการจัดการโครงสร้างพื้นฐานไอทีด้านต่างๆได้แก่โปรแกรมประยุกต์ซอฟท์แวร์ระดับกลางระบบปฏิบัติการระบบเครือข่ายและสภาพแวดล้อมทางกายภาพรวมทั้งการพิจารณาด้านความมั่นคงปลอดภัยระบบสำหรับให้บริการในโครงสร้างพื้นฐานได้แก่ระบบการจัดเก็บข้อมูล ระบบเครื่องคอมพิวเตอร์แบบเสมือน ระบบการให้บริการไดเร็คทอรีการตรวจสอบยืนยันผู้ใช้การควบคุมสิทธิ์ในการทำงานการบันทึกและตรวจสอบการทำงานตลอดจนหัวข้อการจัดการเครือข่ายและโครงสร้างพื้นฐานไอทีที่น่าสนใจอื่นๆ โดยมีการฝึกปฏิบัติการด้านการจัดการเครือข่ายและหัวข้อที่สำคัญทางด้านโครงสร้างพื้นฐานไอทีด้วย",
        "engSubjectDetails": "Network and IT Infrastructure management concept; network components and functions; network management and functions such as configuration, fault, performance, accounting and security managements, network management architecture, management system and framework, network management protocols and standards, SNMP protocol, examples of network management software and products; Information technology infrastructure management; IT infrastructure components and functions, IT infrastructure functions such as application, middleware software, operating system, network and physical environments, including security consideration; infrastructure serviced systems such as storage services, virtual machine services, directory services, access control, authentication, authorization, auditing; current and updated topics in network and IT infrastructure management; practical workshop in network management and selected topics for IT infrastructure."
    },
    {
        "subjectId": "06016337",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "ประสิทธิภาพเครือข่าย",
        "engSubjectsName": "Network Performance",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "เครื่องมือและเทคโนโลยีสำหรับการประเมินและปรับปรุงประสิทธิภาพเครือข่ายสื่อสาร การวัดประสิทธิภาพ การสร้างแบบจำลอง และการวิเคราะห์ประสิทธิภาพเครือข่ายในด้านต่างๆ เช่น ความน่าเชื่อถือ การสูญเสียแพ็คเก็ต ทรูพุท ดีเลย์ การรองรับการเพิ่มภาระงาน ความพร้อมใช้ และความมั่นคงปลอดภัย ปัจจัยที่มีผลกระทบต่อประสิทธิภาพ การวิเคราะห์ด้วยแบบจำลองทราฟฟิก ห่วงโซ่มาร์คอฟ และทฤษฎีคิว ตัวอย่างโซลูชันจริง เช่น สถาปัตยกรรมเครือข่ายทนทาน กลไกควบคุมทราฟฟิกและรับประกันคุณภาพ และการออกแบบเครือข่ายให้มั่นคงปลอดภัย",
        "engSubjectDetails": "Tools and technologies for evaluating and improving the performance of communication networks; measurement, modeling, and analysis of network performance including reliability, packet loss, throughput, delay, scalability, availability, and security; factors affecting network performance; quantitative methods for performance analysis, using techniques from traffic modeling, Markov chains, and queueing theory; examples of practical solutions: resilient network architecture, traffic control and QoS mechanisms, and network security design."
    },
    {
        "subjectId": "06016338",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การออกแบบระบบเครือข่ายเบื้องต้น",
        "engSubjectsName": "Introduction to Network Design",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความเข้าใจโครงสร้างของระบบเครือข่าย ความต้องการของระบบเครือข่าย หลักการออกแบบระบบเครือข่าย การออกแบบการจัดสรรที่อยู่ไอพีเวอร์ชั่น 4 และไอพีเวอร์ชั่น 6 การเลือกใช้โปรโตคอลสำหรับการเลือกเส้นทาง การรองรับปัญหาเมื่อระบบเครือข่ายทำงานบกพร่อง การออกแบบระบบเครือข่ายสำหรับการใช้งานที่เฉพาะเจาะจง เช่น ระบบเครือข่ายไร้สาย และ ระบบเครือข่ายสำหรับกระแสเสียง",
        "engSubjectDetails": "Understanding architecture of network systems; Network requirements; network design methodology; designing IPv4 and IPv6 addressing; Selecting routing protocols; providing network redundancy; designing network systems for specific applications, such as wireless network and voice network."
    },
    {
        "subjectId": "06016346",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การออกแบบและพัฒนาเว็บ",
        "engSubjectsName": "Web Design and Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016312 WEB TECHNOLOGY OR 06016341 MULTIMEDIA PROGRAMMING",
        "thaiSubjectDetails": "เทคโนโลยีเว็บสำหรับฝั่งไคลเอนท์ กระบวนการออกแบบเว็บโดยมีผู้ใช้เป็นศูนย์กลาง หลักการออกแบบเว็บ การออกแบบเว็บแบบปรับการนำเสนอได้เอง การออกแบบเว็บสำหรับอุปกรณ์เคลื่อนที่ การออกแบบเว็บสำหรับแอพลิเคชันแบบคงหน้าจอเดียว การพัฒนาเว็บส่วนเบื้องหน้าแบบมีปฏิสัมพันธ์ เฟรมเวิร์คและเครื่องมือเพื่อการออกแบบและพัฒนาเว็บ สถาปัตยกรรมสารสนเทศ การเขียนสำหรับนำเสนอบนเว็บ การพัฒนาเว็บโดยใช้เทคโนโลยีซีเอมเอส",
        "engSubjectDetails": "Client-side web technologies; user-centered web design process; web design principles; responsive web design; web design for mobile devices; web design for a single-page application; interactive front-end web development; frameworks and tools for web design and development; information architecture; writing for web; web development using CMS technologies."
    },
    {
        "subjectId": "06016347",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "พื้นฐานการเล่าเรื่องและถ่ายภาพยนตร์ดิจิทัล",
        "engSubjectsName": "Fundamentals of digital storytelling and cinematography",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ภาพรวมของการเล่าเรื่องด้วยภาพ เทคนิคในการเล่าเรื่อง เทคนิคการสร้างสรรค์แนวความคิด แนวคิดเบื้องต้นของการถ่ายภาพระบบดิจิทัล กระบวนการถ่ายภาพยนตร์ การจัดวางและเคลื่อนไหวกล้องถ่ายภาพ การใช้เลนส์ การจัดแสง ความต่อเนื่องและการตัดต่อวีดีโอ ความรู้เรื่องเทคนิคพิเศษด้านภาพเบื้องต้น",
        "engSubjectDetails": "Overview of visual storytelling; storytelling techniques; ideation techniques; basic concepts of digital photography; cinematography process; camera placement and movement; use of lens; lighting; video continuity and editing; basic knowledge of visual effects."
    },
    {
        "subjectId": "06016348",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การพัฒนาเกมขั้นสูง",
        "engSubjectsName": "Advanced Game Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "ความรู้ทางด้านคณิตศาสตร์และฟิสิกส์ที่จำเป็น ปัญญาประดิษฐ์ การออกแบบแผนที่เกม การสร้างเอฟเฟคสำหรับภาพและเสียง ส่วนติดต่อกับผู้ใช้สำหรับเกม แพลตฟอร์มสำหรับเกมในปัจจุบัน การพัฒนาเกมที่เชื่อมต่อเครือข่ายคอมพิวเตอร์ การพัฒนาเกมด้วยเทคโนโลยีความจริงเสริม การพัฒนาเกมสามมิติสำหรับอุปกรณ์พกพา",
        "engSubjectDetails": "Essential mathematics and physics; artificial intelligence; tilemaps; advanced graphical and audio effects; novel interfaces for game; current game platform; network game development; augmented reality game development; 3D game development for mobile devices."
    },
    {
        "subjectId": "060163xx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Elective Course in Information Technology 2",
        "year": 4,
        "semeter": 1,
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางมนุษยศาสตร์ 2",
        "engSubjectsName": "Elective Course in Humanity 2",
        "year": 4,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางวิทยาศาสตร์กับคณิตศาสตร์ 2",
        "engSubjectsName": "Elective Course in Scientific and Mathematics 2",
        "year": 4,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "year": 4,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016329",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "โครงงานทางด้านวิศวกรรมซอฟต์แวร์ 1",
        "engSubjectsName": " Project in Software Engineering 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(0-9-0)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิศวกรรมซอฟต์แวร์ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ",
        "engSubjectDetails": "Study or research of interesting current topics in software engineering undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a project proposal and elementary result from practical solving or academic analysis."
    },
    {
        "subjectId": "06016339",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "โครงงานทางด้านเทคโนโลยีเครือข่ายและระบบ 1",
        "engSubjectsName": "Project in Network and System Technology 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(0-9-0)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางเทคโนโลยีเครือข่ายและระบบ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ",
        "engSubjectDetails": "Study or research of interesting current topics in network and system technology undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a project proposal and elementary result from practical solving or academic analysis."
    },
    {
        "subjectId": "06016349",
        "cooperativeEducation": false,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "โครงงานทางด้านการพัฒนาสื่อประสมและเกม 1",
        "engSubjectsName": "Project in Multimedia and Game Development 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(0-9-0)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางด้านการพัฒนาสื่อประสมและเกม ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ",
        "engSubjectDetails": "Study or research of interesting current topics in multimedia and game development undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a project proposal and elementary result from practical solving or academic analysis."
    },
    {
        "subjectId": "90401011",
        "cooperativeEducation": false,
        "subjectAreas": "All",
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "Entrepreneurship",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016330",
        "cooperativeEducation": false,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "โครงงานทางด้านวิศวกรรมซอฟต์แวร์ 2",
        "engSubjectsName": "Project in Software Engineering 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(0-9-0)",
        "prerequisite": "06016329 PROJECT IN SOFTWARE ENGINEERING 1",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัย ในหัวข้อปัจจุบันที่น่าสนใจทางวิศวกรรมซอฟต์แวร์ ในรูปแบบโครงการที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงาน 1",
        "engSubjectDetails": "Study or research of interesting current topics in software engineering undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a complete result of the proposed topic and study as continued from project 1."
    },
    {
        "subjectId": "06016340",
        "cooperativeEducation": false,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "โครงงานทางด้านเทคโนโลยีเครือข่ายและระบบ 2",
        "engSubjectsName": "Project in Network and System Technology 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(0-9-0)",
        "prerequisite": "06016339 PROJECT IN NETWORK AND SYSTEM TECHNOLOGY 1",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัย ในหัวข้อปัจจุบันที่น่าสนใจทางเทคโนโลยีเครือข่ายและระบบ ในรูปแบบโครงการที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงาน 1",
        "engSubjectDetails": "Study or research of interesting current topics in network and system technology undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a complete result of the proposed topic and study as continued from project 1."
    },
    {
        "subjectId": "06016350",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "โครงงานทางด้านการพัฒนาสื่อประสมและเกม 2",
        "engSubjectsName": "Project in Multimedia and Game Development 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(0-9-0)",
        "prerequisite": "06016349 PROJECT IN MULTIMEDIA AND GAME DEVELOPMENT 1",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัย ในหัวข้อปัจจุบันที่น่าสนใจทางด้านการพัฒนาสื่อประสมและเกม ในรูปแบบโครงการที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงาน 1",
        "engSubjectDetails": "Study or research of interesting current topics in multimedia and game development undertaking a work project based by applying the theoretical aspects of the information technology studies under the supervision of a faculty member to be able to present a complete result of the proposed topic and study as continued from project 1"
    },
    {
        "subjectId": "06016301",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ",
        "engSubjectDetails": "Evolution of information technology; components of computer systems; data processing systems; hardware and software; overview of operating system; data and data representation; data management; basic concepts for programming; database technology; data communication; computer network systems and the Internet; ethical and social issues in information technology"
    },
    {
        "subjectId": "06016314",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Problem Solving in Information Technology",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำการเขียน โปรแกรมคอมพิวเตอร์",
        "engSubjectDetails": "Problem solving strategies and concepts; algorithmic thinking; flowchart; concepts and introduction to computer programming."
    },
    {
        "subjectId": "06016319",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ระบบคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Systems",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบจำนวน ระบบฐานสอง พีชคณิตบูลีน เทคนิคการออกแบบเชิงดิจิทัล ลอจิกเกตและการลดจำนวน วงจรเชิงผสมเบื้องต้น หน่วยคำนวณและตรรกะ วิวัฒนาการของคอมพิวเตอร์ องค์ประกอบของระบบคอมพิวเตอร์และการเชื่อมต่อระหว่างกัน วิธีการคำนวณทางคณิตศาสตร์ของเครื่องคอมพิวเตอร์",
        "engSubjectDetails": "Number systems, binary system, Boolean algebras, digital design techniques, logic gate and minimization, basic combinational circuits, arithmetic logic units, computer evolution, computer function and interconnection, computer arithmetic."
    },
    {
        "subjectId": "90101007",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201001",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90401013",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "year": 1,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016302",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชัน อนุพันธ์อันดับสูง การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน การอินทิเกรตและเทคนิคของการอินทเกรต การประยุกต์ของการอินทิเกรต ฟังก์ชันสองตัวแปร อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์ ระบบสมการเชิงเส้น และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก",
        "engSubjectDetails": "Limit and continuity, derivative of functions, higher derivatives, applications of derivative, maxima and minima of functions, integration and techniques of integration, applications of integration, functions of two variables, partial derivatives, linear algebra, matrices and determinants, system of linear equations and its solutions, vector spaces, linear transformations, matrix transformation, orthogonal matrix."
    },
    {
        "subjectId": "06016311",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีสื่อประสม",
        "engSubjectsName": "Multimedia Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบสื่อประสม ประเภทข้อมูลของสื่อประสม การสร้างสื่อประสม การประมวลผลข้อมูลสื่อประสม การส่งผ่านข้อมูลสื่อประสม ประเภทของไฟล์สื่อประสม อุปกรณ์การเก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม แอพลิเคชั่นสื่อประสม เครื่องมือการประพันธ์สื่อประสม",
        "engSubjectDetails": "Multimedia Systems; types of multimedia data; creation of multimedia; multimedia data processing; multimedia data transmission; multimedia file formats; multimedia data storage devices; multimedia data presentation; applications of multimedia; multimedia authoring tools."
    },
    {
        "subjectId": "06016315",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนะนำภาษาการสร้างโปรแกรม การเขียนผังงาน แนวคิดของโปรแกรมภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้นและข้อความสั่งกำ หนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การประมวลผลสตริง การเขียนการเขียนฟังก์ชัน ตัวชี้ การเขียนข้อมูลชนิดโครงสร้าง การกำหนดคุณสมบัติของตัวแปร การจัดการหน่วยความจำ แฟ้มอินพุตและเอาต์พุต การประยุกต์ใช้กับไมโครคอนโทรลเลอร์",
        "engSubjectDetails": "Introduction to programming languages; flowchart; concepts of C programming language; data and data types in C; assignment statement and basic functions; conditional and loop structures; array; string; function; pointer; structure; variable storage class; memory management; file input and output; micro-controller programming."
    },
    {
        "subjectId": "06016320",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "โครงสร้างระบบคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "Computer Systems Organization and Operating System",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "องค์ประกอบของคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ อินพุตและเอาต์พุต การทำงานร่วมกันขององค์ประกอบต่างๆ ภาพรวมการทำงานของระบบปฏิบัติการ กระบวนการ โพรเซสและเธรด การสลับการทำงาน การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการแฟ้ม อินพุตและเอาต์พุต",
        "engSubjectDetails": "Computer components; CPU; memory; I/O; components co-operation; overview of operating system; process and thread; processing switching; memory management; virtual memory; file; input/output management."
    },
    {
        "subjectId": "90201002",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90201012",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skill in English",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016303",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "Discrete Mathematics",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกและเซ็ท ความสัมพันธ์และฟังก์ชัน คอมบินาทอรี่ส์ กราฟและทรี พีชคณิตบูลีน ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด",
        "engSubjectDetails": "Number systems, logic and sets, relations and functions, combinatories, graphs and trees, Boolean algebra, algebraic systems, coding and information theories, and finite state automata."
    },
    {
        "subjectId": "06016305",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "year": 1,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "90401013 GENERAL BUSINESS",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม",
        "engSubjectDetails": "Roles of information technology in business; information system concepts and management; IT strategy; strategic information technology planning; aligning IT with business strategy; information system acquisition; functional information systems; enterprise systems; trends in applications of information technology; ethical and social issues."
    },
    {
        "subjectId": "06016312",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีเว็บ",
        "engSubjectsName": "Web Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "องค์ประกอบและแนวคิดพื้นฐานของระบบเว็บ หลักการทำงานของระบบเว็บ แนะนำเทคโนโลยีเว็บฝั่งไคลแอนท์ ได้แก่ เอชทีเอ็มแอล ซีเอสเอส จาวาสคริปต์ และ ดีโอเอ็ม เทคโนโลยีเว็บฝั่งเซิร์ฟเวอร์สำหรับการสร้างหน้าเว็บแบบปรับเปลี่ยนเนื้อหาได้ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ บริการทั่วไปบนอินเทอร์เน็ตและเว็บ เช่น เซิร์จเอ็นจินต์ บริการวีดีโอสตรีมมิ่ง บริการแผนที่และการระบุตำแหน่ง",
        "engSubjectDetails": "Components and basic concepts of a web system; how a web system works; introduction to client-side web technologies i.e. HTML, CSS, JavaScript and DOM; technologies for creating server-side dynamic web pages; tools for web design and development; common Internet and web services e.g. search engines, video streaming services, map and location services."
    },
    {
        "subjectId": "06016313",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการพื้นฐานเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูล สถาปัตยกรรมเครือข่าย การแบ่งระดับชั้นการทำงานเครือข่ายแบบโอเอสไอและทีซีพีไอพี โพรโทคอลระดับแอพลิเคชัน สถาปัตยกรรมแอพลิเคชัน โพรโทคอลระดับทรานสปอร์ต รูปแบบการส่งข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโทคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิทชิงและแพ็คเก็ตสวิทชิง โพรโทคอลอินเตอร์เน็ต รูปแบบการหาเส้นทาง โพรโทคอลระดับดาต้าลิงก์ การควบคุมการเข้าถึงสื่อ ระบบหมายเลขที่อยู่บนเครือข่าย เทคโนโลยีอีเทอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายเสมือน เครือข่ายพื้นที่กว้าง เครือข่ายท้องถิ่นแบบไร้สาย โพรโทคอลและฟังก์ชั่นการทำงานระดับกายภาพ",
        "engSubjectDetails": "Basic concepts of computer networks and data communications; network architecture; OSI and TCP/IP network layering model; application layer protocols, application architecture; transport layer protocols, reliable data transfer model, congestion control; network layer protocols, circuit and packet switching networks, internet protocol, routing models; data link layer protocols, medium access control, network addressing systems, Ethernet technology, local area network (LAN), virtual LAN (VLAN), wireless LAN, and wide area network (WAN); Physical layer protocols and its functions."
    },
    {
        "subjectId": "06016316",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Data Structures and Algorithms",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016315 PROBLEM SOLVING IN INFORMATION TECHNOLOGY or 06016315 COMPUTER PROGRAMMING",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต",
        "engSubjectDetails": "Data types; data structures and abstract data types; basic data structures e.g. list, stack, and queue; dynamic data structures; terminology of trees; binary trees; binary search trees; AVL trees; graph; time and space analysis of programs; sorting and searching algorithms; greedy algorithm; divide and conquer algorithm; graph algorithms; and dynamic programming."
    },
    {
        "subjectId": "06016317",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การสร้างโปรแกรมเชิงอ็อบเจกต์",
        "engSubjectsName": "Object-Oriented Programming",
        "year": 2,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016315 COMPUTER PROGRAMMING",
        "thaiSubjectDetails": "การออกแบบและพัฒนาโปรแกรมเชิงอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะ ภาวะพหุสัณฐาน การพัฒนาส่วนต่อประสานกราฟิกกับผู้ใช้ และการจัดการกับเหตุการณ์ อาร์เรย์และคอลเลคชัน การจัดการกับสิ่งผิดปกติ คลาสที่เกี่ยวข้องกับอินพุตและเอาต์พุต เธรด",
        "engSubjectDetails": "Object-oriented program design and development; encapsulation; classes and objects; methods and message passing; inheritance and polymorphism; graphical user interface development and event handling; data structures: arrays and collections; exception handling; input/output classes; threads."
    },
    {
        "subjectId": "06016304",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์",
        "engSubjectDetails": "Probability and random variables, some discrete and continuous probability distributions, functions of random variables, sampling distribution, estimation and test of hypotheses, simple and multiple linear regression and correlation analyses."
    },
    {
        "subjectId": "06016306",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศ",
        "engSubjectsName": "Information Systems Analysis and Design",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การพัฒนาระบบเชิงอ็อบเจกต์ การวิเคราะห์และออกแบบ การเลือกโครงการและการจัดการ โครงการสารสนเทศ กำหนดความต้องการระบบ การวิเคราะห์ด้วยยูสเคส แบบจำลองกระบวนการ แบบจำลองข้อมูล การออกแบบสถาปัตยกรรมและกลยุทธการออก การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบส่วนจัดเก็บข้อมูล การออกแบบโปรแกรม คลาสและเมธอด การสร้างและการติดตั้งระบบ",
        "engSubjectDetails": "Object-oriented approaches to system development; system analysis and design; project selection and management; system requirement determination; use case analysis; process model; data model; design strategy and architecture design; user interface design; data storage design; program, class, and method design; system implementation and installation."
    },
    {
        "subjectId": "06016308",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "year": 2,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016316 DATA STRUCTURE AND ALGORITHM",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพ แวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่างเอนทิตี นอร์มัลไลซ์เซชัน เอสคิวแอล แนะนำการจัดการทรานแซคชันและการบริหารฐานข้อมูล ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล แนะนำข้อมูลสนันสนุนการตัดสินใจสำหรับระดับบริหารและระบบคลังข้อมูล",
        "engSubjectDetails": "Introduction to the database and DBMS; file systems; database systems and environment; database management systems; types of databases; data models; relational database model; tables; keys; integrity rules; data dictionary; entity relationship model; normalization; SQL; introduction to transaction management and database administration; data modeling and database language laboratory; introduction to decision support data for management level and data warehouse."
    },
    {
        "subjectId": "90201026",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการสื่อสาร",
        "engSubjectsName": "English for Communication",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016321",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "วิศวกรรมซอฟต์แวร์",
        "engSubjectsName": "Software Engineering",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016306 INFORMATION SYSTEMS ANALYSIS AND DESIGN",
        "thaiSubjectDetails": "ความรู้เบื้องต้นเกี่ยวกับวิศวกรรมซอฟต์แวร์ กลุ่มซอฟต์แวร์และแนวโน้มความเปลี่ยนแปลง กรอบงานของกระบวนการวิศวกรรมซอฟต์แวร์ กระบวนการพัฒนาซอฟต์แวร์แบบอไจล์ แม่แบบสำหรับการ ออกแบบ วิธีปฏิบัติด้านวิศวกรรมซอฟต์แวร์ สภาพแวดล้อมการพัฒนาซอฟต์แวร์โดยใช้เวอร์ชั่นคอนโทรล แบบจำลองวุฒิภาวะและความสามารถเชิงบูรณาการ (ซีเอ็มเอ็มไอ) วิศวกรรมความต้องการ วิศวกรรมการวิเคราะห์และออกแบบ ความรู้เบื้องต้นเกี่ยวกับการทดสอบซอฟต์แวร์ กระบวนการยูนิฟาย์ การประเมินกระบวนการ และแบบจำลองกระบวนการเชิงบัญญัติและเชิงวิวัฒน์",
        "engSubjectDetails": "Introduction to software engineering; software categories and evolution; software engineering process framework; agile software development methodology; design pattern; software engineering practice; software development environment using version control; capability maturity model integration (CMMI); requirement engineering; analysis and design engineering; introduction to software testing; unified process; process evaluation; and prescriptive and evolutionary process models."
    },
    {
        "subjectId": "06016322",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การสร้างโปรแกรมเว็บ",
        "engSubjectsName": "Web Programming",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การพัฒนาไดนามิกเว็บเพจ โพรโทคอลเอชทีทีพี แม่ข่ายเว็บ การพัฒนาโปรแกรมเว็บฝั่งแม่ข่าย การจัดการคุ้กกี้ การติดตามเซสชัน การพัฒนาโปรแกรมเว็บติดต่อกับฐานข้อมูล จาวาสคริปต์และเทคโนโลยีเอ แจ๊กซ์",
        "engSubjectDetails": "Dynamic web pages development; HTTP protocol; web servers; server-side web programming; cookies handling; session tracking; web database application development; Javascript and AJAX technology."
    },
    {
        "subjectId": "06016331",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์ภาคปฏิบัติ",
        "engSubjectsName": "Practical Computer Networking",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "การนำทฤษฎีการเชื่อมโยงเครือข่ายคอมพิวเตอร์ไปปฏิบัติกับอุปกรณ์เชื่อมโยงเครือข่าย เช่น อุปกรณ์หาเส้นทาง และอุปกรณ์สวิทชิ่ง และระบบปลายทางอย่างระบบเครือข่ายไอพี ทั้งแบบเซกเมนต์เดียว และหลายเซกเมนต์ โพรโทคอลการหาเส้นทางแบบสถิตและพลวัต การควบคุมการเข้าถึงเครือข่าย การสร้างเครือข่ายด้วยอุปกรณ์แลนสวิทชิ่ง การสร้างเครือข่ายแลนเสมือน โพรโทคอลชั้นทรานสปอร์ตต่างๆ ไอพีเวอร์ชั่น 4 ไอพีเวอร์ชั่น 6 โพรโทคอลสนับสนุนการแปลงหมายเลขไอพี โพรโทคอลการตั้งค่าโฮสแบบพลวัต ดีเอชซีพี และโพรโทคอลบนเครือข่ายพื้นที่กว้าง เช่น พีพีพี และเฟรมรีเลย์",
        "engSubjectDetails": "Taking computer networking theory into practice with network equipments (i.e., routers, switches), and end-systems in the areas of both single segment IP networks and multiple segment IP networks; static and dynamic routing protocols; network access control; LAN switching, virtual LAN (VLAN); transport layer protocols; IPv4, IPv6; Network Address Translation (NAT) protocol; Dynamic Host Configuration Protocol (DHCP); WAN Protocols (i.e. PPP, and frame-relay)."
    },
    {
        "subjectId": "06016332",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การเชื่อมต่อเครือข่ายสื่อสาร",
        "engSubjectsName": "Interconnected Communication Networks",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความต้องการการเชื่อมต่อเครือข่ายสื่อสารในการใช้งานจริง โพรโตคอลเพื่อรองรับการทำงานผิดพลาดในเครือข่าย โพรโตตอลเลือกเส้นทางแบบพลวัต เช่น อาร์ไอพี โอเอสพีเอฟ ไอเอสไอเอส บีจีพี เป็นต้น แนวคิดเครือข่ายพื้นที่กว้าง เช่น พีพีพี เฟรมรีเลย์ เอ็มพีแอลเอส การติดตั้งที่อยู่และการเปลี่ยนแปลงของไอพีเวอร์ชั่น 6 ความมั่นคงบนเครือข่าย การควบคุมการเข้าถึงเครือข่าย โพรโตคอลของการสื่อสารเครือข่ายไร้สาย",
        "engSubjectDetails": "Requirements for interconnected networks in practical scenarios; network redundancy protocols; dynamic routing protocols such as RIP, OSPF, IS-IS and BGP; Wide Area Network (WAN) technologies, such as PPP, Frame-Relay, MPLS; IPv6 addressing and transition; network security; network access control; wireless LAN communication protocols."
    },
    {
        "subjectId": "06016341",
        "cooperativeEducation": true,
        "subjectAreas": "พัฒนาสื่อประสมและเกม ",
        "thaiSubjectsName": "การโปรแกรมสื่อประสม",
        "engSubjectsName": "Multimedia Programming",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนวคิดพื้นฐานโปรแกรมประยุกต์สื่อประสมบนเว็บไซต์และมือถือ ได้แก่ แพลทฟอร์ม สถาปัตยกรรม และกระบวนการพัฒนา เทคนิคการโปรแกรมสำหรับการจัดการและควบคุมสื่อดิจิทัล การโปรแกรมอนิเมชั่นแบบมีปฏิสัมพันธ์ การโปรแกรมอนิเมชั่นสองมิติ การโปรแกรมเกม และการโปรแกรมแบบเชิงเหตุการณ์ การพัฒนาโปรแกรมส่วนเชื่อมต่อประสานกับผู้ใช้แบบหลากหลายสื่อ เครื่องมือในการพัฒนา ไลบรารี่ และมาตรฐานการเชื่อมต่อกับโปรแกรมประยุกต์สื่อประสม การฝึกปฎิบัติเพื่อการพัฒนาทักษะในการสร้างเนื้อหาและโปรแกรมประยุกต์สื่อประสม",
        "engSubjectDetails": "Basic concepts in multimedia applications for web and mobile i.e. platforms, architectures, and development process; programming techniques for handling and manipulating digital multimedia; interactive animation programming; 2D animation; game and event driven programming; development of rich media user interface; technologies and standard for web and mobile based applications development; multimedia software development tools; libraries and applications programming interfaces; hand-on development of skills for multimedia content and application development."
    },
    {
        "subjectId": "06016342",
        "cooperativeEducation": true,
        "subjectAreas": "พัฒนาสื่อประสมและเกม ",
        "thaiSubjectsName": "คอมพิวเตอร์กราฟิกส์และแอนิเมชัน",
        "engSubjectsName": "Computer Graphics and Animation",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "กราฟิกแบบราสเตอร์และแบบเวกเตอร์ การจัดเก็บข้อมูลรูปทรงวัตถุแบบสองและสามมิติ กระบวนการสร้างภาพสามมิติ เทคนิคการฉายภาพและการแปลง เทคนิคด้านแสงและแสงเงาสามมิติ เทคนิคการสร้างลวดลายของพื้นผิวสามมิติ เทคนิคการเรนเดอร์ภาพสามมิติ แนวคิดพื้นฐานการสร้างภาพเคลื่อนไหวด้วยคอมพิวเตอร์แบบสองและสามมิติ การใช้งานซอฟต์แวร์สร้างภาพกราฟิกสามมิติและการสร้างภาพเคลื่อนไหวสามมิติเบื้องต้น",
        "engSubjectDetails": "Raster and vector graphics; 2D and 3D object representations; 3D rendering pipeline; 3D projection and transformation techniques; 3D lighting and shading techniques; 3D texture mapping techniques; 3D rendering techniques; basic 2D and 3D computer animation concepts; use of 3D computer graphics application software for basic 3D modeling and animation."
    },
    {
        "subjectId": "06016309",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฏหมายไอที",
        "engSubjectsName": "Information System Security and IT Laws",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ กฎหมายและปัญหาจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ อาชญากรรมคอมพิวเตอร์",
        "engSubjectDetails": "Information system security; threats, vulnerabilities, risk assessment and analysis; information system security policies; information system security management; cryptography; authentication; access control; network security; IT laws and ethical problems associated with Information Technology; privacy and confidentiality; computer crime."
    },
    {
        "subjectId": "06016310",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "Human Interface Design",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการออกแบบโดยอาศัยผู้ใช้เป็นศูนย์กลาง ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ ขอบเขตของการออกแบบการเชื่อมต่อกับผู้ใช้และการออกแบบประสบการณ์ในการใช้งาน กระบวนการในการออกแบบการเชื่อมต่อกับผู้ใช้ เครื่องมือในการออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมิน การออกแบบการเชื่อมต่อกับผู้ใช้บนระบบปฏิบัติการสมัยใหม่และอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ",
        "engSubjectDetails": "Principles of user-centered design; human factors and psychological principles for user interface design; human-machine interface technologies; interaction models; interaction styles; scope of user interface design and user experience design; user interface design process; design tools; design principles and guidelines; evaluation techniques; user interface design for modern operating systems and mobile computing devices."
    },
    {
        "subjectId": "90304004",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06016323",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การโปรแกรมอุปกรณ์เคลื่อนที่",
        "engSubjectsName": "Mobile Device Programming",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016317 OBJECT-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "การแนะนำเทคโนโลยีและการเขียนโปรแกรมที่เกี่ยวข้องกับอุปกรณ์เคลื่อนที่ ได้แก่ มือถือแบบสมาร์ทโฟน แพด และแทบเลต การพัฒนาและทดสอบโปรแกรมประยุกต์สำหรับอุปกรณ์ เคลื่อนที่โดยการทำงานจริงบนเครื่องจำลอง",
        "engSubjectDetails": "Introduction to technology and the programming of applications for mobile computing including devices i.e. smart phones, pads, and tablets; developing mobile applications and using device emulators for coding and testing."
    },
    {
        "subjectId": "06016324",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "วิศวกรรมความต้องการ",
        "engSubjectsName": "Requirement Engineering",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "เทคนิคการจัดการความต้องการ การวิเคราะห์ปัญหา การเข้าถึงและเก็บเกี่ยวความต้องการจาก ผู้ที่มีส่วนได้ส่วนเสีย การจัดทำเอกสารโดยใช้ยูสเคสโมเดล การจัดลำดับชั้นของเอกสาร การกำหนดระดับของ ความต้องการ การนิยามระบบ การจัดการขอบเขตและความคาดหวัง การกลั่นกรองความชัดเจนของระบบ คุณลักษณะของความต้องการ การติดตามย้อนรอยความต้องการ การบริหารจัดการการเปลี่ยนแปลงความต้องการ การนำความต้องการมาขับเคลื่อนการออกแบบ การทดสอบ การจัดทำเอกสารสำหรับผู้ใช้งาน",
        "engSubjectDetails": "Requirements management technique; problem analysis; stakeholder needs; document requirements with use-case model; document hierarchy and standard for define requirements level; system definition; scope managing; requirement attributes and traceability; manage change; using requirements to drive ongoing design, test, and user documentation."
    },
    {
        "subjectId": "06016325",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การโปรแกรมเชิงบริการ",
        "engSubjectsName": "Service-Oriented Programming",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนวคิดและโครงสร้างของเว็บเซอร์วิส มาตรฐานเว็บเซอร์วิส การพัฒนาและติดตั้งโปรแกรม ประยุกต์เว็บเซอร์วิส หลักการออกแบบสถาปัตยกรรมเชิงบริการ ลักษณะและประโยชน์ของตัวกลาง เชื่อมต่อบริการ ของระบบต่างๆ การจัดการกระบวนการทางธุรกิจ",
        "engSubjectDetails": "Concepts and structures of web services; web services standards; development and deployment of web service applications; concepts of Service-Oriented Architecture (SOA); features and benefits of enterprise service bus (ESB); business process management (BPM)."
    },
    {
        "subjectId": "06016333",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เทคโนโลยีการให้บริการอินเตอร์เน็ต",
        "engSubjectsName": "Internet Service Technology",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความรู้พื้นฐานของการให้บริการอินเตอร์เน็ต การให้บริการเชื่อมต่อเครือข่ายอินเตอร์เน็ต หลักการทำงานและการประยุกต์ใช้งานของ เทลเน็ต เอฟทีพี ระบบดีเอ็นเอส ระบบจดหมายอิเล็กทรอนิกส์ โพรโทคอลเอสเอ็มทีพี พีโอพี ไอเอ็มเอพี ระบบเว็บและโพรโทคอลเอชทีทีพี ไฟร์วอลล์ และ การแปลงที่อยู่เครือข่าย กรณีศึกษาในห้องปฏิบัติการโดยใช้ซอฟท์แวร์ต่างๆ ที่ทำงานบนระบบปฏิบัติการลักษณะยูนิกส์ เพื่อให้สามารถนำไปสร้างระบบสำหรับการให้บริการในระบบเครือข่ายอินเทอร์เน็ตได้",
        "engSubjectDetails": "Basics of Internet services; Internet connectivity services; Internet applications of TELNET, FTP, Domain Name System (DNS); electronic mail system with SMTP, POP and IMAP; web system with HTTP; firewall; Network Address Translation (NAT); case studies in laboratories with software on UNIX-based operating system for creating Internet services."
    },
    {
        "subjectId": "06016334",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "เทคโนโลยีเครือข่ายไร้สาย",
        "engSubjectsName": "Wireless Network Technology",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ภาพรวมของเทคโนโลยีเครือข่ายไร้สายและการประยุกต์ใช้งาน พื้นฐานการส่งผ่านแบบไร้สาย การแพร่กระจายคลื่นวิทยุ เสาอากาศ การม๊อดดูเลท การมัลติเพล็กซ์ การควบคุมการเข้าถึงแบบหลายทางพร้อมกัน เครือข่ายท้องถิ่นแบบไร้สาย มาตรฐาน IEEE 802.11 การสำรวจสถานที่ การวางแผน การออกแบบและการปรับใช้เครือข่ายท้องถิ่นแบบไร้สาย ความปลอดภัยบนเครือข่ายท้องถิ่นแบบไร้สายและมาตรฐานที่เกี่ยวข้อง เครือข่ายส่วนบุคคลแบบไร้สาย เครือข่ายเมืองแบบไร้สาย เครือข่ายระยะไกลแบบไร้สาย การจัดการและการแก้ปัญหาเครือข่ายไร้สายเบื้องต้น",
        "engSubjectDetails": "An overview of wireless network technologies and applications; wireless transmission basis: radio propagation, antennas, modulation, multiplexing, multiple access control; wireless local area network (WLAN); IEEE 802.11 standard; site survey; planning; design and deploying WLAN; WLAN security and related standards; wireless personal area network (WPAN); wireless metropolitan area network (WMAN); wireless wide area network (WWAN); managing and troubleshooting wireless network basics."
    },
    {
        "subjectId": "06016335",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "เทคโนโลยีกลุ่มเมฆเบื้องต้น",
        "engSubjectsName": "Introduction to cloud computing",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "การแนะนำโครงสร้างของระบบคลาวด์, รูปแบบการให้บริการของระบบคลาวด์, รูปแบบการติดตั้งระบบคลาวด์, เทคโนโลยีที่ใช้ในการสร้างระบบคลาวด์, การบริหารจัดการระบบคลาวด์, ความปลอดภัยสำหรับระบบคลาวด์, ค่าชี้วัดประสิทธิภาพของการบริการ และ ค่าชี้วัดในทางธุรกิจและรูปแบบการคิดค่าบริการของบริการของระบบคลาวด์",
        "engSubjectDetails": "Introduction to cloud architecture, cloud delivery models, cloud deployment models, cloud-Enabling technology, cloud management, cloud security, service quality metrics, and business cost metrics and pricing models  for cloud services."
    },
    {
        "subjectId": "06016343",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การออกแบบและพัฒนาเกม",
        "engSubjectsName": "Game Design and Development",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "ประเภทของเกม แนวคิดและแนวปฏิบัติในการออกแบบเกม กระบวนการพัฒนาเกม การออกแบบตัวละคร การออกแบบวิธีการเล่าเรื่องในเกม การออกแบบโครงสร้างหลักของเกม การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบกลไกหลักของเกม การออกแบบระดับชั้นของเกม ระเบียบวิธีคิดที่สำคัญสำหรับการพัฒนาเกม การพัฒนาเกมคอมพิวเตอร์เบื้องต้น",
        "engSubjectDetails": "Game genres; game design concepts and guidelines; game development process; storytelling design; gameplay design; user interface design; core mechanic design; level design; important algorithms for game; computer game development."
    },
    {
        "subjectId": "06016344",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "หลักการออกแบบกราฟิกส์",
        "engSubjectsName": "Graphics Design Principles",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "แนะนำศิลปะในรูปแบบต่าง ๆ หลักการและองค์ประกอบพื้นฐานของการออกแบบ ทฤษฎีสี หลักการจัดองค์ประกอบศิลป์ ตัวพิมพ์ การร่างและวาดภาพ ประเภทของซอฟต์แวร์เพื่อการออกแบบกราฟิก เรียนรู้ทักษะเชิงปฏิบัติในการสร้างเนื้อหากราฟิกสำหรับสื่อดิจิทัล",
        "engSubjectDetails": "Introduction to different art forms, basic principles and elements of design, color theories, composition principles, typography, sketching and drawing, types of graphics design software tools, learning practical skills in creating graphics for digital media."
    },
    {
        "subjectId": "06016345",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "คอมพิวเตอร์แอนิเมชันสามมิติ",
        "engSubjectsName": "3D Computer Animation",
        "year": 3,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "หลักการพื้นฐานของการทำแอนิเมชัน เทคนิคด้านแสงและแสงเงาสามมิติขั้นสูง เทคนิคการสร้างภาพเคลื่อนไหวด้วยคอมพิวเตอร์สามมิติ แนวคิดและเทคนิคการสร้างโมเดลและภาพเคลื่อนไหวของตัวละคร การใช้ซอฟต์แวร์คอมพิวเตอร์แอนิเมชันสามมิติในการสร้างภาพเคลื่อนไหวของตัวละครขั้นสูง การประมวลผลหลังการสร้างภาพสำหรับคอมพิวเตอร์แอนิเมชันสามมิติ",
        "engSubjectDetails": "Fundamental principles of animation; 3D computer animation concepts; advanced lighting and shading techniques; concepts and techniques for character modeling and animation; use of 3D computer animation software for advance character modeling and animation; post production techniques for 3D computer animation."
    },
    {
        "subjectId": "06016307",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ องค์ความรู้สำหรับการบริหารโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการ การประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ การจัดการความเสี่ยง การควบคุมโครงการ และประเมินผลโครงการ",
        "engSubjectDetails": "Nature and life cycle of information technology (IT) projects; project feasibility; project selection techniques; project management body of knowledge; team management; project scope management; project estimation; project scheduling; quality management; change management; project controlling; project evaluation."
    },
    {
        "subjectId": "06016318",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "สัมมนาทางด้านทักษะการสื่อสารในวิชาชีพ",
        "engSubjectsName": "Seminar on Professional Communication Skills",
        "year": 3,
        "semeter": 2,
        "credit": "1(1-0-2)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ทักษะต่างๆ สำหรับการสมัครงานและการประกอบอาชีพ เทคนิคการเขียนจดหมายสมัครงาน เทคนิคการสอบสัมภาษณ์งาน  การพัฒนาบุคลิกภาพและการแต่งกาย ทักษะในการนำเสนองานทางธุรกิจ  ทักษะในการพูดและการสื่อสาร มารยาทในการเข้าสังคม การบริหารอารมณ์",
        "engSubjectDetails": "Skills for applying to a job and working, resume and application letter writing, job interview techniques, wardrobe and personality development, business presentation skills, voice communication skills, social etiquette, EQ."
    },
    {
        "subjectId": "060163xx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Elective Course in Information Technology 1",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06016326",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การทวนสอบและตรวจสอบซอฟต์แวร์",
        "engSubjectsName": "Software Verification and Validation",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016306 INFORMATION SYSTEMS ANALYSIS AND DESIGN",
        "thaiSubjectDetails": "บทบาทของวีแอนด์วีในวิวัฒนาการของซอฟต์แวร์ การตรวจทานเชิงเทคนิค ระดับของการ ทดสอบซอฟต์แวร์ เทคนิคการทดสอบซอฟต์แวร์ การพิสูจน์ความถูกต้อง การจำลองและการสร้างตัวแบบ การตามรอยความต้องการ การวางแผนการทวนสอบและการตรวจสอบซอฟต์แวร์ กิจกรรมการตามรอยการทดสอบ การประเมินและติดตามปัญหา",
        "engSubjectDetails": "Role of V&V in software evolution; software technical reviews; levels of software testing; testing techniques; proof of correctness; simulation and prototyping; requirements tracing; software V&V planning; tracking test activities; problem tracking and assessment."
    },
    {
        "subjectId": "06016327",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การพัฒนาคลาวด์แอปพลิเคชันระดับองค์กร",
        "engSubjectsName": "Cloud-Based Enterprise Application Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016325 SERVICES-ORIENTED PROGRAMMING",
        "thaiSubjectDetails": "ความรู้เบื้องต้นของเทคโนโลยีคลาวด์ สถาปัตยกรรมคลาวด์ คุณลักษณะการสร้างเครื่องจำลองและการให้บริการผู้ใช้หลายคนพร้อมกัน หลักการพัฒนาแอปพลิเคชันสำหรับองค์กรในคลาวด์ การพัฒนาแอปพลิเคชันโดยวิธีการประกาศและวิธีระบุปัญหา ข้อจำกัดของการกำกับดูแล ประเด็นที่พบบ่อยระหว่างการพัฒนาคลาวด์แอปพลิเคชันแบบคลาวด์ ปัจจัยด้านความต้องการหรือความสามารถในการเลือกรูปแบบการพัฒนาที่เหมาะสม การวิเคราะห์ข้อมูลโดยใช้แพลตฟอร์มแบบคลาวด์ หลักการจัดการฐานข้อมูลคลาวด์ โนเอสคิวเแอล",
        "engSubjectDetails": "Introduction to Cloud Technology, Cloud Architecture, Virtualization and Multi-Tenancy Features, Principles to Develop Enterprise Application in Cloud, Declarative and Problematic Application Development, Governance Limits, Frequently Encountered Issues during Cloud-based Application Development, Requirement or Capability Factors towards the Selection of Appropriate Development Paradigms, Data Analytics Using Cloud Platforms, principle to cloud database management, NoSQL."
    },
    {
        "subjectId": "06016328",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "เครื่องมือและสภาพแวดล้อมสำหรับการพัฒนาซอฟต์แวร์",
        "engSubjectsName": "Software Development Tools and Environments",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "หลักการเพื่อเป็นผู้เชี่ยวชาญด้านซอฟต์แวร์ บทบาทของแอพพลิเคชันในงานด้านวิศวกรรมซอฟต์แวร์ เครื่องมือการพัฒนาซอฟต์แวร์แบบอไจล์ การติดตามความคืบหน้าของการพัฒนาผลิตภัณฑ์ การจัดการเวอร์ชั่นและการกำหนดค่า เครื่องสำหรับสร้างและการบูรณาการอย่างต่อเนื่อง เครื่องสำหรับแก้จุดบกพร่องและการรวบรวมข้อมูลเชิงประสิทธิภาพชองโปรแกรม สภาพแวดล้อมแบบร่วมมือพัฒนา เครื่องมือสำหรับการควบรวบรวมและติดตั้ง",
        "engSubjectDetails": "Principles to Software Professionals, Roles of Applications in Software Engineering Tasks, Agile Software Development Tools, Product Development Tracking, Version and Configuration Management, Build and Continuous Integration Tools, Program Debugging and Profiling Tools, Collaborative Development Environments, Packaging and Deployment Tools"
    },
    {
        "subjectId": "06016336",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การจัดการเครือข่ายและโครงสร้างพื้นฐานเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Network and Information Technology Infrastructure Management",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "หลักการการจัดการเครือข่ายและโครงสร้างพื้นฐานไอทีเบื้องต้นองค์ประกอบและหน้าที่การทำงานของเครือข่ายการจัดการระบบเครือข่ายและการจัดการเครือข่ายด้านต่างๆได้แก่การจัดการด้านการปรับตั้งค่าด้านความผิดพลาดด้านประสิทธิภาพด้านบัญชีและด้านความมั่นคงปลอดภัยสถาปัตยกรรมการจัดการเครือข่ายระบบจัดการและกรอบการทำงานโพรโทคอลและมาตรฐานการจัดการเครือข่าย โพรโทคอลเอสเอ็นเอ็มพีตัวอย่างซอฟต์แวร์และผลิตภัณฑ์การจัดการเครือข่ายการจัดการโครงสร้างพื้นฐานทางด้านเทคโนโลยีสารสนเทศองค์ประกอบและหน้าที่การทำงานของโครงสร้างพื้นฐานไอทีการจัดการโครงสร้างพื้นฐานไอทีด้านต่างๆได้แก่โปรแกรมประยุกต์ซอฟท์แวร์ระดับกลางระบบปฏิบัติการระบบเครือข่ายและสภาพแวดล้อมทางกายภาพรวมทั้งการพิจารณาด้านความมั่นคงปลอดภัยระบบสำหรับให้บริการในโครงสร้างพื้นฐานได้แก่ระบบการจัดเก็บข้อมูล ระบบเครื่องคอมพิวเตอร์แบบเสมือน ระบบการให้บริการไดเร็คทอรีการตรวจสอบยืนยันผู้ใช้การควบคุมสิทธิ์ในการทำงานการบันทึกและตรวจสอบการทำงานตลอดจนหัวข้อการจัดการเครือข่ายและโครงสร้างพื้นฐานไอทีที่น่าสนใจอื่นๆ โดยมีการฝึกปฏิบัติการด้านการจัดการเครือข่ายและหัวข้อที่สำคัญทางด้านโครงสร้างพื้นฐานไอทีด้วย",
        "engSubjectDetails": "Network and IT Infrastructure management concept; network components and functions; network management and functions such as configuration, fault, performance, accounting and security managements, network management architecture, management system and framework, network management protocols and standards, SNMP protocol, examples of network management software and products; Information technology infrastructure management; IT infrastructure components and functions, IT infrastructure functions such as application, middleware software, operating system, network and physical environments, including security consideration; infrastructure serviced systems such as storage services, virtual machine services, directory services, access control, authentication, authorization, auditing; current and updated topics in network and IT infrastructure management; practical workshop in network management and selected topics for IT infrastructure."
    },
    {
        "subjectId": "06016337",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "ประสิทธิภาพเครือข่าย",
        "engSubjectsName": "Network Performance",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "เครื่องมือและเทคโนโลยีสำหรับการประเมินและปรับปรุงประสิทธิภาพเครือข่ายสื่อสาร การวัดประสิทธิภาพ การสร้างแบบจำลอง และการวิเคราะห์ประสิทธิภาพเครือข่ายในด้านต่างๆ เช่น ความน่าเชื่อถือ การสูญเสียแพ็คเก็ต ทรูพุท ดีเลย์ การรองรับการเพิ่มภาระงาน ความพร้อมใช้ และความมั่นคงปลอดภัย ปัจจัยที่มีผลกระทบต่อประสิทธิภาพ การวิเคราะห์ด้วยแบบจำลองทราฟฟิก ห่วงโซ่มาร์คอฟ และทฤษฎีคิว ตัวอย่างโซลูชันจริง เช่น สถาปัตยกรรมเครือข่ายทนทาน กลไกควบคุมทราฟฟิกและรับประกันคุณภาพ และการออกแบบเครือข่ายให้มั่นคงปลอดภัย",
        "engSubjectDetails": "Tools and technologies for evaluating and improving the performance of communication networks; measurement, modeling, and analysis of network performance including reliability, packet loss, throughput, delay, scalability, availability, and security; factors affecting network performance; quantitative methods for performance analysis, using techniques from traffic modeling, Markov chains, and queueing theory; examples of practical solutions: resilient network architecture, traffic control and QoS mechanisms, and network security design."
    },
    {
        "subjectId": "06016338",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "การออกแบบระบบเครือข่ายเบื้องต้น",
        "engSubjectsName": "Introduction to Network Design",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "prerequisite": "06016313 INTRODUCTION TO COMPUTER NETWORKS",
        "thaiSubjectDetails": "ความเข้าใจโครงสร้างของระบบเครือข่าย ความต้องการของระบบเครือข่าย หลักการออกแบบระบบเครือข่าย การออกแบบการจัดสรรที่อยู่ไอพีเวอร์ชั่น 4 และไอพีเวอร์ชั่น 6 การเลือกใช้โปรโตคอลสำหรับการเลือกเส้นทาง การรองรับปัญหาเมื่อระบบเครือข่ายทำงานบกพร่อง การออกแบบระบบเครือข่ายสำหรับการใช้งานที่เฉพาะเจาะจง เช่น ระบบเครือข่ายไร้สาย และ ระบบเครือข่ายสำหรับกระแสเสียง",
        "engSubjectDetails": "Understanding architecture of network systems; Network requirements; network design methodology; designing IPv4 and IPv6 addressing; Selecting routing protocols; providing network redundancy; designing network systems for specific applications, such as wireless network and voice network."
    },
    {
        "subjectId": "06016346",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การออกแบบและพัฒนาเว็บ",
        "engSubjectsName": "Web Design and Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016312 WEB TECHNOLOGY OR 06016341 MULTIMEDIA PROGRAMMING",
        "thaiSubjectDetails": "เทคโนโลยีเว็บสำหรับฝั่งไคลเอนท์ กระบวนการออกแบบเว็บโดยมีผู้ใช้เป็นศูนย์กลาง หลักการออกแบบเว็บ การออกแบบเว็บแบบปรับการนำเสนอได้เอง การออกแบบเว็บสำหรับอุปกรณ์เคลื่อนที่ การออกแบบเว็บสำหรับแอพลิเคชันแบบคงหน้าจอเดียว การพัฒนาเว็บส่วนเบื้องหน้าแบบมีปฏิสัมพันธ์ เฟรมเวิร์คและเครื่องมือเพื่อการออกแบบและพัฒนาเว็บ สถาปัตยกรรมสารสนเทศ การเขียนสำหรับนำเสนอบนเว็บ การพัฒนาเว็บโดยใช้เทคโนโลยีซีเอมเอส",
        "engSubjectDetails": "Client-side web technologies; user-centered web design process; web design principles; responsive web design; web design for mobile devices; web design for a single-page application; interactive front-end web development; frameworks and tools for web design and development; information architecture; writing for web; web development using CMS technologies."
    },
    {
        "subjectId": "06016347",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "พื้นฐานการเล่าเรื่องและถ่ายภาพยนตร์ดิจิทัล",
        "engSubjectsName": "Fundamentals of digital storytelling and cinematography",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "NONE",
        "thaiSubjectDetails": "ภาพรวมของการเล่าเรื่องด้วยภาพ เทคนิคในการเล่าเรื่อง เทคนิคการสร้างสรรค์แนวความคิด แนวคิดเบื้องต้นของการถ่ายภาพระบบดิจิทัล กระบวนการถ่ายภาพยนตร์ การจัดวางและเคลื่อนไหวกล้องถ่ายภาพ การใช้เลนส์ การจัดแสง ความต่อเนื่องและการตัดต่อวีดีโอ ความรู้เรื่องเทคนิคพิเศษด้านภาพเบื้องต้น",
        "engSubjectDetails": "Overview of visual storytelling; storytelling techniques; ideation techniques; basic concepts of digital photography; cinematography process; camera placement and movement; use of lens; lighting; video continuity and editing; basic knowledge of visual effects."
    },
    {
        "subjectId": "06016348",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การพัฒนาเกมขั้นสูง",
        "engSubjectsName": "Advanced Game Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "prerequisite": "06016342 COMPUTER GRAPHICS AND ANIMATION",
        "thaiSubjectDetails": "ความรู้ทางด้านคณิตศาสตร์และฟิสิกส์ที่จำเป็น ปัญญาประดิษฐ์ การออกแบบแผนที่เกม การสร้างเอฟเฟคสำหรับภาพและเสียง ส่วนติดต่อกับผู้ใช้สำหรับเกม แพลตฟอร์มสำหรับเกมในปัจจุบัน การพัฒนาเกมที่เชื่อมต่อเครือข่ายคอมพิวเตอร์ การพัฒนาเกมด้วยเทคโนโลยีความจริงเสริม การพัฒนาเกมสามมิติสำหรับอุปกรณ์พกพา",
        "engSubjectDetails": "Essential mathematics and physics; artificial intelligence; tilemaps; advanced graphical and audio effects; novel interfaces for game; current game platform; network game development; augmented reality game development; 3D game development for mobile devices."
    },
    {
        "subjectId": "06016393 หรือ 06016394",
        "cooperativeEducation": true,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "สหกิจศึกษาทางด้านวิศวกรรมซอฟต์แวร์ หรือ สหกิจศึกษาต่างประเทศทางด้านวิศวกรรมซอฟต์แวร์",
        "engSubjectsName": "Cooperative Education in Software Engineering หรือ OVERSEA Cooperative Education in Software Engineering",
        "year": 4,
        "semeter": 1,
        "credit": "6(0-36-0) หรือ 6(0-36-0)"
    },
    {
        "subjectId": "06016395 หรือ 06016396",
        "cooperativeEducation": true,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "สหกิจศึกษาทางด้านการเทคโนโลยีเครือข่ายและระบบ หรือ สหกิจศึกษาต่างประเทศทางด้านเทคโนโลยีเครือข่ายและระบบ",
        "engSubjectsName": "Cooperative Education in Network and System Technology หรือ OVERSEA Cooperative Education in Network and System Technoology",
        "year": 4,
        "semeter": 1,
        "credit": "6(0-36-0) หรือ 6(0-36-0)"
    },
    {
        "subjectId": "06016397 หรือ 06016398",
        "cooperativeEducation": true,
        "subjectAreas": "การพัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "สหกิจศึกษาทางด้านการพัฒนาสื่อประสมและเกม หรือ สหกิจศึกษาต่างประเทศทางด้านการพัฒนาสื่อประสมและเกม",
        "engSubjectsName": "Cooperative Education in Multimedia and Game Development หรือ OVERSEA Cooperative Education in Multimedia and Game Developmennt",
        "year": 4,
        "semeter": 1,
        "credit": "6(0-36-0) หรือ 6(0-36-0)"
    },
    {
        "subjectId": "90401011",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "Entrepreneurship",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "060163xx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Elective Course in Information Technology 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางมนุษยศาสตร์ 2",
        "engSubjectsName": "Elective Course in Humanity 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "90xxxxxx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกทางวิทยาศาสตร์กับคณิตศาสตร์ 2",
        "engSubjectsName": "Elective Course in Scientific and Mathematics 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "subjectAreas": "All",
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)"
    }
]