[
    {
        "subjectId": "06016351",
        "thaiSubjectsName": "เทคโนโลยีเชิงวัตถุ",
        "engSubjectsName": "Object-Oriented Technology",
        "thaiSubjectDetails": "หลักการเทคโนโลยีเชิงอ็อบเจกต์ การวิเคราะห์และออกแบบระบบเชิงอ็อบเจกต์ การสร้างแบบจำลอง ซอฟต์แวร์เพื่อใช้ในงานพัฒนาระบบด้วยภาษายูเอ็มแอล การพิจารณาสถาปัตยกรรม ซอฟต์แวร์ รูปแบบของการออกแบบ การแจกแจงยูสเคส การใช้เครื่องมือสำหรับพัฒนาซอฟต์แวร์ ระบบเชิงอ็อบเจกต์",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016352",
        "thaiSubjectsName": "ระบบฐานข้อมูลขั้นสูง",
        "engSubjectsName": "Advanced Database Systems",
        "thaiSubjectDetails": "การจัดการรายการเปลี่ยนแปลง การกู้คืนโดยใช้เทคนิคลงบันทึกและการใช้แชโดว์เพจจิ้ง การจัดการบัฟเฟอร์ เทคนิคการควบคุมภาวะพร้อมกันแบบต่างๆ การกู้คืนจากความขัดข้องของรายการ เปลี่ยนแปลง การแก้ปัญหาภาวะติดตาย การประมวลผลข้อคำถาม การปรับข้อคำถามให้เหมาะที่สุด ฐานข้อมูลแบบกระจาย ฐานข้อมูลเชิงอ็อบเจกต์ หรือหัวข้ออื่นที่ผู้สอนเลือกตามความเหมาะสมกับเทคโนโลยี ปัจจุบัน",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016353",
        "thaiSubjectsName": "การดูแลและบำรุงรักษาระบบฐานข้อมูล",
        "engSubjectsName": "Database System Maintenance and Administration",
        "thaiSubjectDetails": "การสร้างวิวและลำดับ ตัวดำเนินการของเซ็ต การสร้างพีแอล/เอสคิวแอล การจัดการกับสิ่ง ผิดปรกติ กระบวนงานและฟังก์ชัน การจัดการกับโปรแกรมย่อย แพ็คเก็จ การจัดการกับอ็อบเจกต์ขนาดใหญ่ ทริกเกอร์ สถาปัตยกรรมตัวบริการฐานข้อมูล การจัดการฐานข้อมูล ที่เครื่องรับบริการ การสร้างฐานข้อมูล พจนานุกรมข้อมูลและวิวแสดงการปฏิบัติการแบบพลวัต แฟ้มควบคุม แฟ้มรายการทำซ้ำ การบำรุงรักษาเทเบิลสเปซและแฟ้มข้อมูล โครงสร้างหน่วยเก็บ ข้อมูลทำกลับ การบำรุงรักษาตาราง การบำรุงรักษาดรรชนี บูรณภาพของข้อมูล การจัดการผู้ใช้งาน สิทธิ์การใช้งานและบทบาท การนำข้อมูลเข้าฐานข้อมูล การสำรองและการกู้ฐานข้อมูล โปรแกรมอรรถประโยชน์สำหรับการนำเข้า และส่งออกข้อมูล",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016354",
        "thaiSubjectsName": "เมตริกซ์และการวัดซอฟต์แวร์",
        "engSubjectsName": "Software Measurement and Metrics",
        "thaiSubjectDetails": "ทฤษฏีการวัด กรอบแนวคิดเชิงเป้าหมายสำหรับการวัดซอฟต์แวร์ การวิเคราะห์จีคิวเอ็ม เมตริกซ์ผลิตภัณฑ์ซอฟต์แวร์ ลักษณะภายในของผลิตภัณฑ์ ลักษณะภายนอกของผลิตภัณฑ์ เมตริกซ์กระบวนการซอฟต์แวร์ การวัดค่าใช้จ่ายและค่าแรง การวัดความน่าเชื่อถือของซอฟต์แวร์ เมตริกซ์การทดสอบซอฟต์แวร์ เมตริกซ์เชิงวัตถุ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016355",
        "thaiSubjectsName": "การค้นคืนสารสนเทศ",
        "engSubjectsName": "Information Retrieval",
        "thaiSubjectDetails": "ความรู้เบื้องต้นเกี่ยวกับการค้นคืนสารสนเทศ สถาปัตยกรรมของระบบค้นคืนสารสนเทศ เครื่องมือและการประเมินผลการค้นคืนสารสนเทศ แบบจำลองการจัดลำดับแบบพื้นฐาน ของการค้นคืนสารสนเทศ คำศัพท์และรายการของการจัดตำแหน่ง การสร้างดัชนีค้นหา การถ่วงค่าน้ำหนักของคำ การปฏิสัมพันธ์ระหว่างระบบค้นคืนสารสนเทศกับผู้ใช้ การค้นคืนสารสนเทศซึ่งเน้นความหลากหลายของข้อมูล และการประเมินผล การตอบสนองที่เกี่ยวข้องความต้องการสารสนเทศ แบบจำลองการจัดลำดับขั้นสูง ของการค้นคืนสารสนเทศ การจัดกลุ่มและการจำแนกข้อความ การกรองข้อมูลสารสนเทศ การแนะนำและกรองข้อมูลสารสนเทศแบบความร่วมมือ การรวบรวมข้อมูลบนเว็บ การวิเคราะห์ข้อมูลบนเว็บ และการสืบค้นข้อมูลบนเว็บ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016356",
        "thaiSubjectsName": "ระบบประมวลผลแบบกระจาย",
        "engSubjectsName": "Distributed Computing Systems",
        "thaiSubjectDetails": "หลักการและคุณสมบัติของระบบแบบกระจาย ได้แก่ การติดต่อสื่อสาร กระบวนการทำงาน ระบบชื่อ การทำงานร่วมกัน การทำซ้ำและการคงความเหมือนของทรัพยากร การทนต่อความผิดพลาดในการทำงาน ความปลอดภัยของระบบแบบกระจาย หัวข้อที่น่าสนใจที่เกี่ยวข้องกับระบบแบบกระจาย เช่น เว็บเซอร์วิส การประมวลผลแบบกริด เพียร์ทูเพียร์ การกระจายภาระงานของเครื่องให้บริการ ตลอดจนการประมวลผลแบบกลุ่มเมฆ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016357",
        "thaiSubjectsName": "เทคโนโลยีการสื่อสารเคลื่อนที่",
        "engSubjectsName": "Mobile Communication Technology",
        "thaiSubjectDetails": "ภาพรวมของเครือข่ายและระบบโทรคมนาคมเคลื่อนที่ พื้นฐานการสื่อสารเคลื่อนที่ สถาปัตยกรรมและองค์ประกอบของระบบโทรศัพท์เคลื่อนที่ การทำงานของระบบโทรศัพท์เคลื่อนที่ เทคโนโลยีจีเอสเอ็ม ทีดีเอ็มเอ ซีดีเอ็มเอ แอลทีอี และเทคโนโลยีในอนาคต บริการข้อมูลในระบบโทรศัพท์เคลื่อนที่ กลไกความปลอดภัยในระบบสื่อสารเคลื่อนที่เบื้องต้น",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016358",
        "thaiSubjectsName": "การจำลองด้วยคอมพิวเตอร์",
        "engSubjectsName": "Computer simulation and modelling",
        "thaiSubjectDetails": "หลักการสร้างแบบจำลองเลียนแบบและแบบจำลองเชิงวิเคราะห์ รวมไปถึงทฤษฎีที่เกี่ยวเนื่องกันอย่างการจำลองแบบเชิงสถิติ และเชิงลำดับการสุ่ม พื้นฐานทฤษฎีคิว กระบวนการสุ่ม กระบวนการเกิดดับ และกระบวนการมาร์คอฟ การประยุกต์ในหลากหลายวัตถุประสงค์ ตัวอย่างเช่น การวิเคราะห์และทำนายผลในการออกแบบระบบ หรือในการวางแผนกลยุทธทางธุรกิจและการจัดการ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016359",
        "thaiSubjectsName": "ระบบฝังตัวพื้นฐาน",
        "engSubjectsName": "Fundamentals of Embedded Systems",
        "thaiSubjectDetails": "แนะนำอุปกรณ์ระบบฝังตัวและอุปกรณ์เชื่อมต่อกับระบบเครือข่าย การเขียนโปรแกรมบนอุปกรณ์ระบบฝังตัวพื้นฐาน การเชื่อมต่ออุปกรณ์อินพุต เอาต์พุต การเชื่อมต่อแบบอนุกรมและแบบขนาน การเชื่อมต่อแบบซิงโครนัสและอะซิงโครนัส ตลอดจน การเชื่อมต่อระหว่างสัญญาดิจิทัลกับสัญญาณอนาลอก การเชื่อมต่อระบบฝังตัวกับโมดูลเชื่อมต่ออีเธอร์เนต ซิกบี บลูทูธ อาร์เอฟไอดี และ เทคโนโลยีอื่นๆ โดยที่ผู้สอนเป็นผู้คัดเลือก",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016360",
        "thaiSubjectsName": "ไมโครโปรเซสเซอร์",
        "engSubjectsName": "Microprocessors",
        "thaiSubjectDetails": "สถาปัตยกรรมของไมโครโปรเซสเซอร์ ไมโครคอลโทรเลอร์ ชุดคำสั่ง ชนิดของหน่วยความจำไฟฟ้าและแผนผังวงจร การเชื่อมต่ออุปกรณ์อินพุต เอาต์พุต การเชื่อมต่อแบบอนุกรมและแบบขนาน การเชื่อมต่อแบบซิงโครนัสและอะซิงโครนัส การประยุกต์ สั่งงานอุปกรณ์อินพุต เอาต์พุตในลักษณะต่างๆ ตลอดจน การเชื่อมต่อระหว่างสัญญาดิจิทัลกับสัญญาณแอนะล็อก",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016361",
        "thaiSubjectsName": "หุ่นยนต์ศาสตร์ประยุกต์",
        "engSubjectsName": "Applied Robotics",
        "thaiSubjectDetails": "เทคโนโลยีของหุ่นยนต์ รูปแบบทางกลศาสตร์ ประเภทของแหล่งกำเนิดไฟฟ้าต่างๆ การควบคุมผ่านวงจรอิเล็กทรอนิกส์ ตัวตรวจจับชนิดต่างๆ ที่ใช้ในการควบคุมหุ่นยนต์ ไมโครคอนโทรลเลอร์และการเชื่อมต่อระบบหุ่นยนต์ พฤติกรรมของหุ่นยนต์ ที่เน้นการประยุกต์อัลกอริทึมเพื่อออกแบบการทำงานของหุ่นยนต์",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016362",
        "thaiSubjectsName": "ระบบสื่อสารดิจิตอล",
        "engSubjectsName": "Digital Communication Systems",
        "thaiSubjectDetails": "ภาพรวมของระบบสื่อสารดิจิตอล สัญญาณและสเปกตรัม เทคนิคการม๊อดดูเลทสัญญาณดิจิตอลเบสแบนด์ ภาครับดิจิตอล เทคนิคการม๊อดดูเลทและดีม๊อดดูเลทสัญญาณดิจิตอลแบนด์พาส เทคนิคการมัลติเพล็กซ์ การแปลงสัญญาณอนาลอกเป็นดิจิตอลและดิจิตอลเป็นอนาลอก เทคนิคการสเปรดสเปกตรัม การเข้ารหัสควบคุมข้อผิดพลาดเบื้องต้น",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016363",
        "thaiSubjectsName": "การประมวลผลและสื่อสารผ่านอุปกรณ์พกพา",
        "engSubjectsName": "Mobile Computing and Communications",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของการประมวลผลบนอุปกรณ์พกพาและอุปกรณ์ที่มีหน่วยประมวลผลฝังตัวอยู่, การใช้ประโยชน์จากการประมวลผลบนอุปกรณ์พกพา, เทคโนโลยีอุปกรณ์พกพา, เทคโนโลยีการสื่อสารไร้สายผ่านอุปกรณ์พกพาเบื้องต้น, เครือข่ายที่มีโครงสร้างพื้นฐาน, เครือข่ายเฉพาะกิจ, สถาปัตยกรรมระบบและซอฟต์แวร์, ระบบสนับสนุนการทำงาน, และการพัฒนาแอพพลิเคชันบนอุปกรณ์พกพา",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016364",
        "thaiSubjectsName": "การออกแบบวงจรดิจิตอล",
        "engSubjectsName": "Digital Circuit Design",
        "thaiSubjectDetails": "หลักการออกวงจรดิจิตอล ในลักษณะสเตจแมชชิ่งตามหลักการของเมอรี่และมัวล์ หลัการพื้นฐานในการเชื่อมต่อฮาร์ดแวร์พร้อมทั้งการออกแบบ รวมทั้งการเชื่อมต่อสู่ระบบสมองกลฝังตัว การออกแบบฮาร์ดแวร์ด้วยภาษา HDL, ภาษา VHDL และภาษา Virilog อธิบายสถาปัตยกรรมและโครางสร้างของ FPGA พร้อมทั้งการออกแบบ",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016365",
        "thaiSubjectsName": "คอมพิวเตอร์วิชัน",
        "engSubjectsName": "Computer Vision",
        "thaiSubjectDetails": "เทคนิคพื้นฐานในการประมวลผลภาพ การตรวจจับและตัดแยกคุณลักษณะเด่นจากภาพ รูปแบบการจัดเก็บข้อมูลรูปร่างของวัตถุในภาพ สีและความเข้มแสง การรู้จำวัตถุในภาพ วิชัน 3 มิติ การวิเคราะห์ข้อมูลเชิงพลวัต การประยุกต์ใช้คอมพิวเตอร์วิชัน เช่นระบบตรวจผลผลิตในโรงงานอุตสาหกรรม ระบบวิเคราะห์ภาพทางการแพทย์ ระบบรู้จำบุคคลโดยใช้เอกลักษณ์ของบุคคล ระบบขนส่งอัจฉริยะ ระบบรักษาความปลอดภัย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016366",
        "thaiSubjectsName": "การประมวลผลภาพ",
        "engSubjectsName": "Image Processing",
        "thaiSubjectDetails": "องค์ประกอบของระบบประมวลผลภาพ การสร้างภาพและรูปแบบการจัดเก็บข้อมูลภาพ เทคนิคพื้นฐานสำหรับการวิเคราะห์และประมวลผลข้อมูลภาพ การรับภาพ การแปลงภาพ การปรับปรุงภาพโดยใช้หลักการของเอ็นฮานสเม้นท์และรีสทอเรชัน การบีบอัดข้อมูลภาพ การวิเคราะห์ภาพ เช่น การตัดแยกวัตถุ การวัดคุณสมบัติของวัตถุในภาพ การวิเคราะห์ฟูเรีย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016367",
        "thaiSubjectsName": "ความเป็นจริงเสมือน",
        "engSubjectsName": "Virtual Reality",
        "thaiSubjectDetails": "ความรู้พื้นฐานเกี่ยวกับความเป็นจริงเสมือน เทคโนโลยีและการประยุกต์ใช้งาน ทฤษฏีคอมพิวเตอร์กราฟิก 3 มิติ การสร้างแบบจำลองเชิงเรขาคณิต และการแปลงเชิงเรขาคณิต ระบบความเป็นจริงเสมือนทั่วไป สภาพแวดล้อมเสมือนและสภาพแวดล้อมคอมพิวเตอร์ โหมดการโต้ตอบ การทำให้เคลื่อนไหวในสภาพแวดล้อมเสมือน การจำลองกายภาพ และปัจจัยของมนุษย์ ฮาร์ดแวร์ และซอฟต์แวร์ที่เกี่ยวข้องกับระบบความเป็นจริงเสมือน รวมทั้งเครื่องมือในการพัฒนาการประยุกต์ใช้งานความจริงเสมือน และโครงงานที่มอบหมาย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016368",
        "thaiSubjectsName": "การรู้จำรูปแบบ",
        "engSubjectsName": "Pattern Recognition",
        "thaiSubjectDetails": "ทฤษฎีความน่าจะเป็นแบบเบย์ ทฤษฎีการประมาณการ ฟังก์ชันดิสคริมิแนนต์เชิงเส้น ซัพพอร์ตเวกเตอร์แมชชีน โครงข่ายประสาท ต้นไม้ตัดสินใจ การจัดกลุ่ม",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016369",
        "thaiSubjectsName": "เศรษฐศาสตร์เทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Economics of Information Technology",
        "thaiSubjectDetails": "หลักการเศรษฐศาสตร์เบื้องต้น แนวคิดและทฤษฎีเกี่ยวกับกระบวนนวัตกรรมและการเปลี่ยนแปลงเทคโนโลยี ตลาดเทคโนโลยีสารสนเทศ การประเมินการลงทุนทางด้านเทคโนโลยีสารสนเทศ ผลกระทบของการพัฒนาและการเปลี่ยนแปลงเทคโนโลยีต่อการพัฒนาเศรษฐกิจและอุตสาหกรรม การจ้างงาน การเจริญเติบโตของธุรกิจ ผลิตภาพ การถ่ายทอดเทคโนโลยี การวิจัยและพัฒนา การปรับตัวเข้าสู่สังคมสารสนเทศ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016370",
        "thaiSubjectsName": "อัจฉริยะทางธุรกิจเบื้องต้น",
        "engSubjectsName": "Introduction to Business Intelligence",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของอัจฉริยะทางธุรกิจ องค์ประกอบของอัจฉริยะทางธุรกิจ โครงสร้างพื้นฐานของอัจฉริยะทางธุรกิจ คลังข้อมูล เหมืองข้อมูล การบริหารสมรรถนะของธุรกิจ บาลานซ์สกอร์การ์ด เครื่องมือต่างๆ ในการสร้างอัจฉริยะทางธุรกิจในองค์กร การประยุกต์ใช้อัจฉริยะทางธุรกิจบนระบบสารสนเทศต่าง ๆ ในองค์กร แอพพลิเคชันต่างๆ ของอัจฉริยะทางธุรกิจที่ใช้ในปัจจุบัน",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016371",
        "thaiSubjectsName": "การจัดการโซ่อุปทานและโลจิสติกส์",
        "engSubjectsName": "Supply Chain Management and Logistics",
        "thaiSubjectDetails": "ความจำเป็นในด้านการบูรณาการของโซ่อุปทานและในด้านการบริหารจัดการความซับซ้อนในส่วนต่อประสานของระบบ หลักการของการวางแผน การวิเคราะห์ การออกแบบ การพัฒนาและการประเมินของการบริหารโซ่อุปทาน กิจกรรมของการบริหารโซ่อุปทานที่นำมาซึ่งการบูรณาการของความสัมพันธ์ด้านการไหลเวียนของข้อมูลและวัตถุดิบระหว่างองค์กรในโซ่อุปทาน รวมทั้งโซ่อุปทานทั่วโลก บทบาทของผู้ค้า กระบวนการภายในของโซ่อุปทาน และการจัดจำหน่าย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016372",
        "thaiSubjectsName": "วิศวกรรมและการจัดการความรู้",
        "engSubjectsName": "Knowledge Engineering and Management",
        "thaiSubjectDetails": "ลำดับชั้นของข้อมูล ข่าวสารและความรู้ การแทนความรู้ เช่น ตรรกศาสตร์พรีดิเคต ตรรกศาสตร์คลุมเครือ โครงข่ายเชิงความหมาย เฟรมและวัตถุ ออนโทโลยีและเว็บเชิงความหมาย ระบบผู้เชี่ยวชาญ กฎลูกโซ่ไปข้างหน้าและย้อนกลับ การแก้ไขข้อขัดแย้งและการรวมกฎ การใช้เหตุผลเชิงกรณี การใช้เหตุผลเชิงเงื่อนไข โครงข่ายประสาทเทียม การเรียนรู้ของเครื่องจักร เทคนิคการเรียนรู้เชิงสถิติ หัวข้อวิจัยด้านวิศวกรรมข้อมูลและวิศวกรรมความรู้",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016373",
        "thaiSubjectsName": "การบริหารระบบลูกค้าสัมพันธ์",
        "engSubjectsName": "Customer Relationship Management",
        "thaiSubjectDetails": "การระบุ การหามาได้ การเก็บรักษาและการขยายของฐานลูกค้า ซึ่งมุ่งเน้นการเพิ่มผลกำไรในระยะยาวของลูกค้าในองค์กร การบริหารลูกค้าอย่างมีประสิทธิภาพและมีประสิทธิผลโดยการนำอรรถประโยชน์ของระบบสารสนเทศเข้ามาประยุกต์ใช้",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016374",
        "thaiSubjectsName": "การจัดการการปฏิบัติการ",
        "engSubjectsName": "Operations Management",
        "thaiSubjectDetails": "ภาพรวมของการจัดการการปฏิบัติการ โปรแกรมเชิงเส้น โปรแกรมเชิงจำนวนเต็ม การเลือกทำเลที่ตั้ง การวางแผนผังสถานที่ประกอบการ การจัดการสินค้าคงคลัง การควบคุมคุณภาพ การจัดการโครงการ การพยากรณ์",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016375",
        "thaiSubjectsName": "ระบบสนับสนุนการตัดสินใจ",
        "engSubjectsName": "Decision Support Systems",
        "thaiSubjectDetails": "แนะนำระบบสนับสนุนการตัดสินใจ กระบวนการตัดสินใจ คุณสมบัติและองค์ประกอบของระบบสนับสนุนการตัดสินใจ การจำลองและการวิเคราะห์ ปัญญาธุรกิจ การวิเคราะห์เชิงธุรกิจ ระบบสนับสนุนการตัดสินใจแบบกลุ่ม ปัญญาประดิษฐ์และระบบผู้เชี่ยวชาญ ระบบอัจฉริยะ การพัฒนาระบบสนับสนุนการตัดสินใจ การบูรณาการและทิศทางของระบบสนับสนุนการตัดสินใจ",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016376",
        "thaiSubjectsName": "ปัญญาประดิษฐ์",
        "engSubjectsName": "Artificial Intelligence",
        "thaiSubjectDetails": "นิยามของปัญญาประดิษฐ์ ตรรกศาสตร์เชิงประพจน์ พรีดิเคตลอจิกลำดับที่หนึ่ง การแก้ปัญหาสำหรับเกมและการค้นหา การใช้เหตุผลแบบคลุมเครือ การประมวลผลภาษา ระบบผู้เชี่ยวชาญ การเรียนรู้ของเครื่องจักร การทำเหมืองข้อมูล โครงข่ายประสาทเทียม",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016377",
        "thaiSubjectsName": "พื้นฐานวิทยาการข้อมูล",
        "engSubjectsName": "Fundamentals of Data Science",
        "thaiSubjectDetails": "วิทยาการข้อมูลกับแรงจูงใจเชิงธุรกิจ การจัดการข้อมูล การวิเคราะห์ข้อมูลโดยใช้สถิติและการเรียนรู้ของเครื่องจักร การสร้างภาพเพื่อสื่อข่าวสาร การทำเหมืองข้อมูล การสกัดข่าวสารและความรู้จากข้อมูล การค้นคืนข่าวสารและอัลกอริทึมการสืบค้น การประมวลผลข้อความและเสียง การจัดเก็บและวิเคราะห์อภิมหาข้อมูล",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016378",
        "thaiSubjectsName": "การประมวลผลภาษาธรรมชาติเบื้องต้น",
        "engSubjectsName": "Introduction to Natural Language Processing",
        "thaiSubjectDetails": "โมดูลการประมวลผลภาษา นิพจน์ปกติและออโตมาต้า คำและเครื่องจักรจำกัดสถานะ เอ็นแกรมและการกำกับชนิดคำ โมเดลมาคอฟและเอนโทรปีสูงสุด การแจกแจงไวยากรณ์ การแจกแจงเชิงสถิติ คุณลักษณะและการยูนิฟายด์ การแทนความหมาย อรรถศาสตร์เชิงคำนวณ การศึกษาความหมายของคำ บทสนทนาเชิงคำนวณ การประยุกต์ใช้งานการประมวลผลภาษา",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016379",
        "thaiSubjectsName": "แบบจำลองธุรกิจและการตลาด",
        "engSubjectsName": "Business Model and Marketing",
        "thaiSubjectDetails": "เครื่องมือในการคิดและสร้างแบบจำลองธุรกิจ คุณค่าสินค้า/บริการ กลุ่มลูกค้าและความสัมพันธ์กับลูกค้า การแบ่งส่วนตลาด ตลาดเป้าหมาย รูปแบบและวิธีการสร้างรายได้ นวัตกรรมในการสร้างแบบจำลองธุรกิจ กรณีศึกษาของแบบจำลองธุรกิจต่างๆ นวัตกรรมของกลยุทธ์ทางการตลาด แบบจำลองการวิเคราะห์สภาวะการแข่งขัน กลยุทธ์การแข่งขัน",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016380",
        "thaiSubjectsName": "การบริหารจัดการพาณิชย์อิเล็กทรอนิกส์",
        "engSubjectsName": "E-Commerce Management",
        "thaiSubjectDetails": "หลักการพาณิชย์อิเล็กทรอนิกส์ โครงสร้างพื้นฐาน การประยุกต์ใช้ และส่วนสนับสนุนพาณิชย์อิเล็กทรอนิกส์; ระบบชำระเงินอิเล็กทรอนิกส์และระบบรักษาความปลอดภัย การโฆษณา รูปแบบการทำธุรกิจสร้าง และการบริหารจัดการพาณิชย์อิเล็กทรอนิกส์",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016381",
        "thaiSubjectsName": "เทคโนโลยีเครือข่าย",
        "engSubjectsName": "Networking Technology",
        "thaiSubjectDetails": "ความก้าวหน้าทางเทคโนโลยีการเชื่อมโยงเครือข่ายในปัจจุบัน การประยุกต์และบริการเครือข่ายในยุคหน้า ผลกระทบต่อมวลมนุษยชาติ ประโยชน์ต่อคุณภาพชีวิตและโอกาสทางธุรกิจ ความเสี่ยงและภัยที่อาจเกิดขึ้น รวมไปถึงการพัฒนาเทคโนโลยีอย่างยั่งยืน",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016382",
        "thaiSubjectsName": "การโปรแกรมอินเทอร์เน็ต",
        "engSubjectsName": "Internet Programming",
        "thaiSubjectDetails": "สถาปัตยกรรมและโพรโทคอลการติดต่อสื่อสาร การโปรแกรมเพื่อสร้างการเชื่อมต่อในชั้นต่าง ๆ เช่น แอพพลิเคชันและทรานสปอร์ต การต่อประสานซ็อกเก็ตชนิดทีซีพี ยูดีพี และรอว์ กระบวนการทำงานทางผู้รับและผู้ให้บริการ และการเขียนโปรแกรมเพื่อสร้างแอพพลิเคชันบนเครือข่าย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016383",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านวิศวกรรมซอฟต์แวร์ 1",
        "engSubjectsName": "Special Topics in Software Engineering 1",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านการวิศวกรรมซอฟต์แวร์ โดยอาจารย์ผู้สอนทางด้านการวิศวกรรมซอฟต์แวร์เป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016384",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านวิศวกรรมซอฟต์แวร์ 2",
        "engSubjectsName": "Special Topics in Software Engineering 2",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านการวิศวกรรมซอฟต์แวร์ โดยอาจารย์ผู้สอนทางด้านการวิศวกรรมซอฟต์แวร์เป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016385",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านเทคโนโลยีเครือข่ายและระบบ 1",
        "engSubjectsName": "Special Topics in Network and System Technology 1",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านเทคโนโลยีเครือข่ายและระบบ โดยอาจารย์ผู้สอนทางด้านเทคโนโลยีเครือข่ายและระบบเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016386",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านเทคโนโลยีเครือข่ายและระบบ 2",
        "engSubjectsName": "Special Topics in Network and System Technology 2",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านเทคโนโลยีเครือข่ายและระบบ โดยอาจารย์ผู้สอนทางด้านเทคโนโลยีเครือข่ายและระบบเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016387",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านการพัฒนาสื่อประสมและเกม 1",
        "engSubjectsName": "Special Topics in Multimedia and Game Development 1",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านการพัฒนาสื่อประสมและเกม โดยอาจารย์ผู้สอนทางด้านการพัฒนาสื่อประสมและเกมเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016388",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านการพัฒนาสื่อประสมและเกม 2",
        "engSubjectsName": "Special Topics in Multimedia and Game Development 2",
        "thaiSubjectDetails": "วิชานี้จะศึกษาในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านการพัฒนาสื่อประสมและเกม โดยอาจารย์ผู้สอนทางด้านการพัฒนาสื่อประสมและเกมเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016389",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Special Topics in Information Technology 1",
        "thaiSubjectDetails": "วิชานี้จะศึกษาถึงหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจ โดยอาจารย์ผู้สอนทางด้านเทคโนโลยีสารสนเทศเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016390",
        "thaiSubjectsName": "หัวข้อพิเศษทางด้านเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Special Topics in Information Technology 2",
        "thaiSubjectDetails": "วิชานี้จะศึกษาถึงหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจ โดยอาจารย์ผู้สอนทางด้านเทคโนโลยีสารสนเทศเป็นผู้คัดเลือก",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016391",
        "thaiSubjectsName": "ปฎิบัติการพิเศษทางด้านเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Special Workshop in Information Technology 1",
        "thaiSubjectDetails": "ศึกษาและการฝึกภาคปฏิบัติในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านเทคโนโลยีสารสนเทศ โดยอาจารย์ผู้สอนเป็นผู้คัดเลือก",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subjectId": "06016392",
        "thaiSubjectsName": "ปฎิบัติการพิเศษทางด้านเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Special Workshop in Information Technology 2",
        "thaiSubjectDetails": "ศึกษาและการฝึกภาคปฏิบัติในหัวข้อและความก้าวหน้าทางวิชาการที่น่าสนใจทางด้านเทคโนโลยีสารสนเทศ โดยอาจารย์ผู้สอนเป็นผู้คัดเลือก",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาเลือก"
    }
]