[
    {
        "subjectId": "06036001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ"
    },
    {
        "subjectId": "06036021",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Problem Solving in Information Technology",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิด และหลักการสร้างโปรแกรมคอมพิวเตอร์เบื้องต้น"
    },
    {
        "subjectId": "06036027",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โครงสร้างระบบคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "Computer Systems Organization and Operating System",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของคอมพิวเตอร์ องค์ประกอบของคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ อินพุตและเอาต์พุต ระบบปฏิบัติการ กระบวนการ การประสานเวลาของกระบวนการ การจัดกำหนดการของกระบวนการ การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการแฟ้มและอินพุตและเอาต์พุต"
    },
    {
        "subjectId": "06036085",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาเครื่องมือทางคณิตศาสตร์ประกอบด้วย เมทริกซ์ การหาผลเฉลยของระบบสมการเชิงเส้น กฎของคราเมอร์อนุพันธ์ของฟังก์ชัน ฟังก์ชันกําลังสอง ค่าสูงสุดและค่าต่าสุด อนุพันธ์ย่อย และการอินทิเกรต เพื่อประยุกต์ใช้แก้ปัญหาทางเศรษฐศาสตร์และการพาณิชย์เบื้องต้นในชีวิตประจําวัน เช่น หาจุดสมดุลของราคาและปริมาณของสินค้าในตลาด วิเคราะห์การผลิต เมทริกซ์การเปลี่ยนถ่ายสถานะ ฟังก์ชันอุปสงค์ฟังก์ชันอุปทาน ฟังก์ชันต้นทุน ฟังก์ชันรายได้ฟังก์ชันยืดหยุ่น"
    },
    {
        "subjectId": "06036081",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะการใช้ภาษาอังกฤษเพื่อการฟัง การพูด การอ่าน และการเขียนในบริบทที่เกี่ยวข้องกับชีวิตประจําวัน ฝึกการใช้พจนานุกรม ศึกษาศัพท์สํานวน และภาษาจากบทอ่านที่คัดเลือกจากสิ่งพิมพ์ต่าง ๆ เช่น วารสาร หนังสือพิมพ์ทบทวนโครงสร้างไวยากรณ์และการใช้ภาษาในโอกาสต่างๆ"
    },
    {
        "subjectId": "06036083",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skill in English",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาวิธีการอ่านอย่างมีประสิทธิภาพ การอ่านจับใจความ การอ่านหนังสือพิมพ์ การอ่าน เพื่อแปลใจความ การพัฒนาทักษะการเขียน โดยเน้นการเขียนที่ถูกรูปแบบทางภาษาและไวยากรณ์ ฝึกการเขียนที่จะนําไปใช้ประโยชน์ทั้งทางด้านการศึกษาและอาชีพ เช่น การเขียนจดหมาย การกรอกใบสมัคร การเขียนรายงาน เป็นต้น"
    },
    {
        "subjectId": "06036002",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง  อนุพันธ์ของฟังก์ชัน  อนุพันธ์อันดับสูง  การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน  การอินทิเกรตและเทคนิคของการอินทเกรต  การประยุกต์ของการอินทิเกรต  ฟังก์ชันสองตัวแปร  อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์  ระบบสมการเชิงเส้น  และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก"
    },
    {
        "subjectId": "06036004",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "องค์กรและการจัดการ",
        "engSubjectsName": "Management and Organization",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ภาคทฤษฎีและภาคปฏิบัติสำหรับการบริหารจัดการองค์กร ความเป็นผู้นำ การพัฒนากลยุทธ์ทางธุรกิจ พฤติกรรมองค์กร โครงสร้างองค์กร การจัดการทรัพยากรมนุษย์ การเปลี่ยนแปลงในองค์กร องค์กรสมัยใหม่ในยุคดิจิตัล"
    },
    {
        "subjectId": "06036022",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การวิเคราะห์และกระบวนการแก้ปัญหา ผังงาน แนะนำภาษาการสร้างโปรแกรม แนวคิดของโปรแกรมภาษาซี การแก้ปัญหาด้วยภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้น และข้อความสั่งกำหนดค่า โครงสร้างการวนซ้ำและเงื่อนไข การสร้างโปรแกรมเชิงโมดูล โครงสร้างโดยทั่วไปของฟังก์ชันภาษาซี การทำงานกับฟังก์ชัน แถวลำดับและตัวชี้ ชนิดข้อมูลที่ผู้ใช้กำหนดเอง แฟ้มอินพุตและเอาต์พุต"
    },
    {
        "subjectId": "06036090",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาความหมายของกระบวนการบริหาร โดยเป็นเนื้อหาในองค์การธุรกิจ การใช้ทรัพยากรทางการบริหารให้เป็นประโยชน์ต่อธุรกิจ รูปแบบของการดำเนินงานทางธุรกิจ การจัดองค์การ การสร้างมนุษยสัมพันธ์ ความเป็นผู้นำและการจูงใจบุคคลภายในองค์การ และการนําหลักการพื้นฐานและความรู้ทั่วไปทางด้านการตลาดการบริหารงานบุคคลการบรหารการเงิน และการบัญชีมาใช้ในการบริหารธุรกิจขององค์การ"
    },
    {
        "subjectId": "06036082",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะการใช้ภาษาอังกฤษในการอ่าน เขียน ฟัง และพูดเพื่อการศึกษา เช่น การใช้หนังสืออ้างอิง การอ่านกราฟ ตาราง ฯลฯ การเขียนบทสรุป ฟัง พูด โต้ตอบแสดงความคิดเห็นเกี่ยวกับเรื่องที่อ่านหรือ ฟังได้รวมทั้งทบทวนโครงสร้าง ไวยากรณ์และการใช้ภาษาโอกาสต่างๆ เพิ่มเติม"
    },
    {
        "subjectId": "06036084",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการนำเสนอผลงานทางวิชาชีพ",
        "engSubjectsName": "English for Professional Presentation",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะในการติดต่อสื่อความหมายและการพูดนําเสนอผลงานภาษาอังกฤษ มุ่งเน้นการนําทฤษฎีไปใช้รวมทั้งการฝึกปฏิบัติจริง อาทิเช่น การพัฒนาทักษะทั้งการจัดเตรียมข้อมูล การใช้สื่อประกอบการนําเสนอการพัฒนาบุคลิกภาพ เพื่อการนําเสนอผลงานได้อย่างมีประสิทธิภาพ"
    },
    {
        "subjectId": "06036003",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "06036005",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บัญชีการเงิน",
        "engSubjectsName": "Financial Accounting",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ทฤษฏีและฝึกปฏิบัติทางการบัญชี วงจรบัญชี การบันทึกรายการค้าในสมุดรายวันทั่วไป บัญชีแยกประเภท การปิดบัญชีและปรับปรุงรายการ การจัดทำงบการเงิน"
    },
    {
        "subjectId": "06036023",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานของโครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Basic Data Structure and Algorithms",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสต์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมแบบละโมภ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "06036028",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "พื้นฐานแนวคิดเครือข่ายคอมพิวเตอร์ หลักการสื่อสารข้อมูล เช่น สื่อ การเข้ารหัส การมอดูเลชั่น และการมัลติเพล็ก เป็นต้น การสวิทชิ่งแบบวงจรและแพคเกต อุปกรณ์เครือข่าย โมเดลอ้างอิงโอเอสไอ และชั้นของโพรโทคอลทีซีพี/ไอพี โพรโทคอลในชั้นแอพลิเคชั่น เช่น เอชทีทีพี เอฟทีพี เอสเอ็มทีพี พอพธรี และดีเอนเอส เป็นต้น โพรโทคอลในชั้นชั้นทรานสปอร์ต เช่น ทีซีพี และ ยูดีพี เป็นต้น ที่อยู่ไอพีเวอร์ชั่น 4 วีแอลเอสเอ็ม ไซเดอร์ ไอซีเอมพี ดีเอชซีพี และการเลือกเส้นทางแบบสถิต แลน อีเธอร์เน็ต เออาร์พี โพรโทคอลสแปนนิ่งทรี และการควบคุมการเข้าถึงสื่อ และเกริ่นนำเครือข่ายพื้นที่กว้าง"
    },
    {
        "subjectId": "06036087",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษารูปแบบ และวิธีการเขียนรายงาน รวมทั้งฝึกการเขียนรายงานรูปแบบต่าง ๆ เช่น รายงานข่าว รายงานการประชุม และรายงานเชิงวิชาการ เป็นต้น"
    },
    {
        "subjectId": "06036089",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "Entrepreneurship",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาเกี่ยวกับผู้ประกอบการที่ประสบความสําเร็จ ประเภทของผู้ประกอบการ การจัดตั้งธุรกิจ องค์ประกอบของการเขียนแผนธรกุ ิจ กลยทธุ ์การดําเนินการธุรกิจในหน้าที่ต่างๆ เทคนิคการบริหารธุรกิจสมัยใหม ่ และกรณีศึกษาการประกอบการธุรกิจที่ประสบความสําเร็จ"
    },
    {
        "subjectId": "06036006",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร  แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06036008",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เทคโนโลยีธุรกิจดิจิทัล",
        "engSubjectsName": "Digital Business Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การประมวลผลแบบคลาวด์ อุปกรณ์สื่อสารเคลื่อนที่ ข้อมูลขนาดใหญ่ เว็บเซอร์วิส (Web services) และ เครือข่ายทางสังคม (Social networking) เทคโนโลยีและหลักการทำงาน วิธีปฏิบัติที่นิยมในปัจจุบัน แนวโน้มในอนาคต และผลกระทบต่อธุรกิจ"
    },
    {
        "subjectId": "06036011",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณภาพ พีชคณิตเชิงสัมพันธ์ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่าง เอนทิตี การนอร์มัลไลซ์ เอสคิวแอล แนะนำการจัดการรายการเปลี่ยนแปลงและการบริหารฐานข้อมูล และปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล"
    },
    {
        "subjectId": "06036012",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "Human Interface Design",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ปัจจัยที่เกี่ยวกับมนุษย์และบทบาทในการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง เช่น อุปกรณ์ป้อนข้อมูลตัวอักษร อุปกรณ์กำหนดจุดและตำแหน่งเ เทคโนโลยีเสียงพูด และอุปกรณ์ความจริงเสมือน สัมพันธ แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิ เช่นการต่อประสานด้วยชุดคำสั่งการต่อประสานด้วยเมนู การต่อประสานด้วยภาษาธรรมชาตกระบวนการในการออกแบบและเครื่องมือช่วยออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมินผลการออกแบบ ประเด็นการออกแบบบนระบบปฏิบัติการสมัยใหม่และบนอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ"
    },
    {
        "subjectId": "06036013",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เว็บและเทคโนโลยีสื่อประสม",
        "engSubjectsName": "Web and Multimedia Technology",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ระบบสื่อประสม ประเภทของข้อมูลสื่อประสม การสร้างสื่อประสม การประมวลผลข้อมูลสื่อประสม การส่งผ่านข้อมูลสื่อประสม อุปกรณ์เก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม เทคโนโลยีสื่อประสมสำหรับเว็บ การประยุกต์ใช้งานสื่อประสม เครื่องมือในการประพันธ์สื่อประสมและเว็บ"
    },
    {
        "subjectId": "06036024",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจ",
        "engSubjectsName": "Business Information System Analysis and Design",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "เครื่องมือและวิธีการสำหรับการพัฒนาระบบสารสนเทศทางธุรกิจ แนวคิดการวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจในปัจจุบัน แบบจำลองการวิเคราะห์ระบบ แบบจำลองการออกแบบระบบ ความสำคัญของกระบวนการควบคุมในขั้นตอนการวางแผน วิเคราะห์ จัดสร้าง และทดสอบระบบสารสนเทศทางธุรกิจเพื่อแก้ปัญหาการจัดการด้านธุรกิจ กรณีศึกษา"
    },
    {
        "subjectId": "06036007",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ  การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการโครงกาiการประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ  การจัดการการเปลี่ยนแปลง การควบคุมโครงการ และประเมินผลโครงการ"
    },
    {
        "subjectId": "06036009",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "เศรษฐศาสตร์เทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Economics of Information Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "หลักการเศรษฐศาสตร์เบื้องต้น แนวคิดและทฤษฎีเกี่ยวกับกระบวนนวัตกรรมและการเปลี่ยนแปลงเทคโนโลยี ตลาดเทคโนโลยีสารสนเทศ การประเมินการลงทุนทางด้านเทคโนโลยีสารสนเทศ ผลกระทบของการพัฒนาและการเปลี่ยนแปลงเทคโนโลยีต่อการพัฒนาเศรษฐกิจและอุตสาหกรรม การจ้างงาน การเจริญเติบโตของธุรกิจ ผลิตภาพ การถ่ายทอดเทคโนโลยี การวิจัยและพัฒนา การปรับตัวเข้าสู่สังคมสารสนเทศ"
    },
    {
        "subjectId": "06036010",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "กระบวนการธุรกิจและการวางแผนทรัพยากรองค์กร",
        "engSubjectsName": "Business Process and Enterprise Resource Planning",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กระบวนการธุรกิจหลักในองค์กร กระบวนการทางบัญชี กระบวนการได้มาซึ่งทรัพยากร  กระบวนการจัดการสินค้าและคลังสินค้า กระบวนการการผลิต และกระบวนการการขายสินค้าหรือบริการ การบูรณาการกระบวนการธุรกิจด้วยระบบวางแผนทรัพยากรองค์กร  แนวคิดการวางแผนทรัพยากรองค์กร เรียนรู้ทักษะเชิงปฏิบัติในการนำกระบวนการธุรกิจมาใช้งานบนแอพพลิเคชันมาตรฐานของระบบวางแผนทรัพยากรองค์กร"
    },
    {
        "subjectId": "06036014",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฏหมายไอที",
        "engSubjectsName": "Information System Security and IT Laws",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล อาชญากรรมคอมพิวเตอร์ การป้องกันและการสืบสวน การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ ทรัพย์สินทางปัญญา ความเป็นเจ้าของสารสนเทศ กฎหมายเกี่ยวกับลิขสิทธิ สิทธิบัตรและเครื่องหมายการค้า ความลับทางการค้า วัฒนธรรมองค์กร ความเป็นมืออาชีพ กฎระเบียบหลักเกณฑ์ทางวิชาชีพ ปัญหาเกี่ยวกับจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ การละเมิดลิขสิทธิ์ซอฟต์แวร์"
    },
    {
        "subjectId": "06036025",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "เทคโนโลยีเชิงอ็อบเจกต์",
        "engSubjectsName": "Object Oriented Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การออกแบบและพัฒนาโปรแกรมเชิงอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะ ภาวะพหุสัณฐาน การพัฒนาส่วนต่อประสานกราฟิกกับผู้ใช้และการจัดการกับเหตุการณ์ โครงสร้างข้อมูลแบบแถวลำดับและคอลเลคชัน การจัดการกับสิ่งผิดปรกติ คลาสที่เกี่ยวข้องกับอินพุตและเอาต์พุต เธรด"
    },
    {
        "subjectId": "060360xx",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Elective Course in Information Technology 1",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06036015",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การทำการตลาดดิจิทัล",
        "engSubjectsName": "Digital Marketing",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การทำการตลาดและธุรกิจแบบร่วมสมัย การโฆษณาแบบออนไลน์และออฟไลน์ในโลกยุคดิจิทัล เช่น การโฆษณาทางโทรทัศน์ หนังสือพิมพ์ การแสดงผลลัพธ์ การสืบค้น วิดีโอ และโทรศัพท์มือถือ เป็นต้น การจัดการสื่อและการโฆษณาทางดิจิทัล การรณรงค์สื่อสารทางการตลาดและการวางแผนการประเมิน การปฏิบัติทางการตลาดตามหลักจริยธรรม แนวคิดความรับผิดชอบต่อสังคมและการพัฒนาอย่างยั่งยืน กลยุทธ์การสร้างแบรนด์ (ตราสินค้า) หลักการออกแบบเว็บแอปพลิเคชันและแอปพลิเคชันบนโทรศัพท์มือถือสำหรับการตลาดดิจิทัล การคิดในการออกแบบการตลาด สื่อสังคมสำหรับจัดการแบรนด์และการโฆษณา"
    },
    {
        "subjectId": "06036016",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "ธุรกิจอัจฉริยะและข้อมูลขนาดใหญ่",
        "engSubjectsName": "Business Intelligence and Big Data",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ธุรกิจอัจฉริยะ (business Intelligence) และส่วนประกอบของมัน ข้อมูลขนาดใหญ่ (big data) และการวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) ลักษณะเฉพาะ 5 อย่างของข้อมูลขนาดใหญ่ – volume (ข้อมูลมหาศาล ขนาดใหญ่) variety (ข้อมูลที่มีความหลากหลายทั้งที่เป็นแบบโครงสร้าง หรือรูปแบบที่ไม่แน่นอน) velocity (ข้อมูลที่จะต้องวิเคราะห์เข้าสู่ระบบฐานข้อมูลอย่างรวดเร็ว โดยให้ความสำคัญกับข้อมูลที่เป็น real – time) veracity (ความถูกต้อง ครบถ้วนของข้อมูล) และ value (ข้อมูลที่สามารถนำมาใช้งานได้จริง) การทำคลังข้อมูล (data warehousing) การทำเหมืองข้อมูล (data Mining) การวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) การทำรายงานเชิงวิเคราะห์ (analytical reporting) การแสดงผลข้อมูล (data visualization)"
    },
    {
        "subjectId": "06036017",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "ระบบที่ใช้ทั้งองค์กร",
        "engSubjectsName": "Enterprise Systems",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความรู้พื้นฐานของระบบที่ใช้ทั้งองค์กร (Enterprise systems) ระบบเหล่านี้นั้นสามารถนำมาใช้ในการดำเนินธุรกิจในปัจจุบันได้อย่างไร  ระบบการจัดการทรัพยากรในองค์กร (Enterprise resource planning or ERP systems) ระบบการจัดการห่วงโซ่อุปทาน (Supply chain management or SCM systems) ระบบการจัดการลูกค้าสัมพันธ์ (Customer relationship management or CRM systems) ระบบการวิเคราะห์ทางธุรกิจ (Business Analytics) เน้นทั้งด้านวิธีการจัดการทางธุรกิจและด้านเทคโนโลยี"
    },
    {
        "subjectId": "06036018",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "สื่อสังคมและเครือข่ายสังคม",
        "engSubjectsName": "Social Media and Social Network",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ทฤษฏีและวิธีการประยุกต์ใช้สื่อสังคมในองค์กร เข้าใจการปรับเปลี่ยนพฤติกรรมของผู้คนในการมีปฏิสัมพันธ์กันโดยใช้สื่อสังคม ข้อดีและข้อเสียของการใช้สื่อสังคม การใช้สื่อสังคมกับธุรกิจ แนะนำเบื้องต้นเกี่ยวกับเครือข่ายสังคมที่เป็นที่นิยม; แนวคิดพื้นฐานของเครือข่าย พื้นฐานจิตวิทยาของเครือข่ายสังคม การวิเคราะห์เครือข่ายสังคม"
    },
    {
        "subjectId": "06036026",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การพัฒนาโปรแกรมประยุกต์บนอุปกรณ์เคลื่อนที่",
        "engSubjectsName": "Mobile Application Development",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การแนะนำเทคโนโลยีและการเขียนโปรแกรมที่เกี่ยวข้องกับอุปกรณ์เคลื่อนที่ ได้แก่ มือถือแบบสมาร์ทโฟน แพด และแทบเลต การพัฒนาและทดสอบโปรแกรมประยุกต์สำหรับอุปกรณ์เคลื่อนที่โดยการทำงานจริงบนเครื่องจำลอง"
    },
    {
        "subjectId": "060360xx",
        "cooperativeEducation": false,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Elective Course in Information Technology 2",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06036019",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "โครงงาน 1",
        "engSubjectsName": "Project 1",
        "credit": "3(0-9-0)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางเทคโนโลยีสารสนเทศ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ"
    },
    {
        "subjectId": "06036086",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "หลักปรัชญาแห่งวิทยาศาสตร์",
        "engSubjectsName": "Philosophy of Science",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความหมายของคำว่า “วิทยาศาสตร์”; อะไรคือความจริงทางวิทยาศาสตร์; ธรรมชาติของวิทยาศาสตร์; กระบวนการทางวิทยาศาสตร์; ทฤษฎีและกฎทางวิทยาศาสตร์ – การค้นพบและการสร้าง; ธรรมชาติของความรู้ทางวิทยาศาสตร์; การออกแบบการทดลองทางวิทยาศาสตร์; การทดสอบสมมติฐาน; การตั้งสมมติฐาน; ความก้าวหน้าทางวิทยาศาสตร์ในโลกปัจจุบัน"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06036020",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "โครงงาน 2",
        "engSubjectsName": "Project 2",
        "credit": "3(0-9-0)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัย ในหัวข้อปัจจุบันที่น่าสนใจทางเทคโนโลยีสารสนเทศ ในรูปแบบโครงการที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงาน 1"
    },
    {
        "subjectId": "06036088",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "การคิดอย่างสร้างสรรค์",
        "engSubjectsName": "Creative Thinking",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "เข้าใจว่า “ความคิดสร้างสรรค์” คืออะไร; การคิดแก้ไขปัญหาอย่างสร้างสรรค์ ในสถานการณ์ที่กำกวมและซับซ้อน ซึ่งไม่สามารถแก้ไขได้โดยตรงโดยการใช้ตรรกะทั่วไป; การส่งเสริมความคิดสร้างสรรค์ในระดับบุคคล; การเสริมสร้างทักษะในการคิดอย่างสร้างสรรค์ให้ผู้อื่น; สภาพแวดล้อมที่ช่วยส่งเสริมความคิดสร้างสรรค์; การจัดการความคิดสร้างสรรค์ของทีมงานพัฒนานวัตกรรม; กระบวนการคิดอย่างสร้างสรรค์ และทฤษฎีต่างๆ ที่เกี่ยวข้อง"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": false,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "06036001",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ"
    },
    {
        "subjectId": "06036021",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Problem Solving in Information Technology",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิด และหลักการสร้างโปรแกรมคอมพิวเตอร์เบื้องต้น"
    },
    {
        "subjectId": "06036027",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โครงสร้างระบบคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "Computer Systems Organization and Operating System",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของคอมพิวเตอร์ องค์ประกอบของคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ อินพุตและเอาต์พุต ระบบปฏิบัติการ กระบวนการ การประสานเวลาของกระบวนการ การจัดกำหนดการของกระบวนการ การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการแฟ้มและอินพุตและเอาต์พุต"
    },
    {
        "subjectId": "06036085",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตเศรษฐศาสตร์เบื้องต้น",
        "engSubjectsName": "Introduction to Mathematical Economics",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาเครื่องมือทางคณิตศาสตร์ประกอบด้วย เมทริกซ์ การหาผลเฉลยของระบบสมการเชิงเส้น กฎของคราเมอร์อนุพันธ์ของฟังก์ชัน ฟังก์ชันกําลังสอง ค่าสูงสุดและค่าต่าสุด อนุพันธ์ย่อย และการอินทิเกรต เพื่อประยุกต์ใช้แก้ปัญหาทางเศรษฐศาสตร์และการพาณิชย์เบื้องต้นในชีวิตประจําวัน เช่น หาจุดสมดุลของราคาและปริมาณของสินค้าในตลาด วิเคราะห์การผลิต เมทริกซ์การเปลี่ยนถ่ายสถานะ ฟังก์ชันอุปสงค์ฟังก์ชันอุปทาน ฟังก์ชันต้นทุน ฟังก์ชันรายได้ฟังก์ชันยืดหยุ่น"
    },
    {
        "subjectId": "06036081",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "Foundation English 1",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะการใช้ภาษาอังกฤษเพื่อการฟัง การพูด การอ่าน และการเขียนในบริบทที่เกี่ยวข้องกับชีวิตประจําวัน ฝึกการใช้พจนานุกรม ศึกษาศัพท์สํานวน และภาษาจากบทอ่านที่คัดเลือกจากสิ่งพิมพ์ต่าง ๆ เช่น วารสาร หนังสือพิมพ์ทบทวนโครงสร้างไวยากรณ์และการใช้ภาษาในโอกาสต่างๆ"
    },
    {
        "subjectId": "06036083",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การพัฒนาทักษะการอ่านและเขียนภาษาอังกฤษ",
        "engSubjectsName": "Development of Reading and Writing Skill in English",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาวิธีการอ่านอย่างมีประสิทธิภาพ การอ่านจับใจความ การอ่านหนังสือพิมพ์ การอ่าน เพื่อแปลใจความ การพัฒนาทักษะการเขียน โดยเน้นการเขียนที่ถูกรูปแบบทางภาษาและไวยากรณ์ ฝึกการเขียนที่จะนําไปใช้ประโยชน์ทั้งทางด้านการศึกษาและอาชีพ เช่น การเขียนจดหมาย การกรอกใบสมัคร การเขียนรายงาน เป็นต้น"
    },
    {
        "subjectId": "06036002",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Mathematics for Information Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่อง  อนุพันธ์ของฟังก์ชัน  อนุพันธ์อันดับสูง  การประยุกต์ของอนุพันธ์ ปัญหาค่าสูงสุดและต่ำสุดของฟังก์ชัน  การอินทิเกรตและเทคนิคของการอินทเกรต  การประยุกต์ของการอินทิเกรต  ฟังก์ชันสองตัวแปร  อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์  ระบบสมการเชิงเส้น  และการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก"
    },
    {
        "subjectId": "06036004",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "องค์กรและการจัดการ",
        "engSubjectsName": "Management and Organization",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ภาคทฤษฎีและภาคปฏิบัติสำหรับการบริหารจัดการองค์กร ความเป็นผู้นำ การพัฒนากลยุทธ์ทางธุรกิจ พฤติกรรมองค์กร โครงสร้างองค์กร การจัดการทรัพยากรมนุษย์ การเปลี่ยนแปลงในองค์กร องค์กรสมัยใหม่ในยุคดิจิตัล"
    },
    {
        "subjectId": "06036022",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การวิเคราะห์และกระบวนการแก้ปัญหา ผังงาน แนะนำภาษาการสร้างโปรแกรม แนวคิดของโปรแกรมภาษาซี การแก้ปัญหาด้วยภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้น และข้อความสั่งกำหนดค่า โครงสร้างการวนซ้ำและเงื่อนไข การสร้างโปรแกรมเชิงโมดูล โครงสร้างโดยทั่วไปของฟังก์ชันภาษาซี การทำงานกับฟังก์ชัน แถวลำดับและตัวชี้ ชนิดข้อมูลที่ผู้ใช้กำหนดเอง แฟ้มอินพุตและเอาต์พุต"
    },
    {
        "subjectId": "06036090",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
        "engSubjectsName": "General Business",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาความหมายของกระบวนการบริหาร โดยเป็นเนื้อหาในองค์การธุรกิจ การใช้ทรัพยากรทางการบริหารให้เป็นประโยชน์ต่อธุรกิจ รูปแบบของการดำเนินงานทางธุรกิจ การจัดองค์การ การสร้างมนุษยสัมพันธ์ ความเป็นผู้นำและการจูงใจบุคคลภายในองค์การ และการนําหลักการพื้นฐานและความรู้ทั่วไปทางด้านการตลาดการบริหารงานบุคคลการบรหารการเงิน และการบัญชีมาใช้ในการบริหารธุรกิจขององค์การ"
    },
    {
        "subjectId": "06036082",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "Foundation English 2",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะการใช้ภาษาอังกฤษในการอ่าน เขียน ฟัง และพูดเพื่อการศึกษา เช่น การใช้หนังสืออ้างอิง การอ่านกราฟ ตาราง ฯลฯ การเขียนบทสรุป ฟัง พูด โต้ตอบแสดงความคิดเห็นเกี่ยวกับเรื่องที่อ่านหรือ ฟังได้รวมทั้งทบทวนโครงสร้าง ไวยากรณ์และการใช้ภาษาโอกาสต่างๆ เพิ่มเติม"
    },
    {
        "subjectId": "06036084",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษเพื่อการนำเสนอผลงานทางวิชาชีพ",
        "engSubjectsName": "English for Professional Presentation",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฝึกทักษะในการติดต่อสื่อความหมายและการพูดนําเสนอผลงานภาษาอังกฤษ มุ่งเน้นการนําทฤษฎีไปใช้รวมทั้งการฝึกปฏิบัติจริง อาทิเช่น การพัฒนาทักษะทั้งการจัดเตรียมข้อมูล การใช้สื่อประกอบการนําเสนอการพัฒนาบุคลิกภาพ เพื่อการนําเสนอผลงานได้อย่างมีประสิทธิภาพ"
    },
    {
        "subjectId": "06036003",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "Probability and Statistics",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบ ต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง การประมาณค่า การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบ เชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "06036005",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บัญชีการเงิน",
        "engSubjectsName": "Financial Accounting",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ทฤษฏีและฝึกปฏิบัติทางการบัญชี วงจรบัญชี การบันทึกรายการค้าในสมุดรายวันทั่วไป บัญชีแยกประเภท การปิดบัญชีและปรับปรุงรายการ การจัดทำงบการเงิน"
    },
    {
        "subjectId": "06036023",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานของโครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Basic Data Structure and Algorithms",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสต์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมแบบละโมภ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "06036028",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "พื้นฐานแนวคิดเครือข่ายคอมพิวเตอร์ หลักการสื่อสารข้อมูล เช่น สื่อ การเข้ารหัส การมอดูเลชั่น และการมัลติเพล็ก เป็นต้น การสวิทชิ่งแบบวงจรและแพคเกต อุปกรณ์เครือข่าย โมเดลอ้างอิงโอเอสไอ และชั้นของโพรโทคอลทีซีพี/ไอพี โพรโทคอลในชั้นแอพลิเคชั่น เช่น เอชทีทีพี เอฟทีพี เอสเอ็มทีพี พอพธรี และดีเอนเอส เป็นต้น โพรโทคอลในชั้นชั้นทรานสปอร์ต เช่น ทีซีพี และ ยูดีพี เป็นต้น ที่อยู่ไอพีเวอร์ชั่น 4 วีแอลเอสเอ็ม ไซเดอร์ ไอซีเอมพี ดีเอชซีพี และการเลือกเส้นทางแบบสถิต แลน อีเธอร์เน็ต เออาร์พี โพรโทคอลสแปนนิ่งทรี และการควบคุมการเข้าถึงสื่อ และเกริ่นนำเครือข่ายพื้นที่กว้าง"
    },
    {
        "subjectId": "06036087",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนรายงาน",
        "engSubjectsName": "Report Writing",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษารูปแบบ และวิธีการเขียนรายงาน รวมทั้งฝึกการเขียนรายงานรูปแบบต่าง ๆ เช่น รายงานข่าว รายงานการประชุม และรายงานเชิงวิชาการ เป็นต้น"
    },
    {
        "subjectId": "06036089",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "Entrepreneurship",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาเกี่ยวกับผู้ประกอบการที่ประสบความสําเร็จ ประเภทของผู้ประกอบการ การจัดตั้งธุรกิจ องค์ประกอบของการเขียนแผนธรกุ ิจ กลยทธุ ์การดําเนินการธุรกิจในหน้าที่ต่างๆ เทคนิคการบริหารธุรกิจสมัยใหม ่ และกรณีศึกษาการประกอบการธุรกิจที่ประสบความสําเร็จ"
    },
    {
        "subjectId": "06036006",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "Management Information Systems",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการ กลยุทธ์ทางเทคโนโลยีสารสนเทศ การวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร  แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06036008",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เทคโนโลยีธุรกิจดิจิทัล",
        "engSubjectsName": "Digital Business Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การประมวลผลแบบคลาวด์ อุปกรณ์สื่อสารเคลื่อนที่ ข้อมูลขนาดใหญ่ เว็บเซอร์วิส (Web services) และ เครือข่ายทางสังคม (Social networking) เทคโนโลยีและหลักการทำงาน วิธีปฏิบัติที่นิยมในปัจจุบัน แนวโน้มในอนาคต และผลกระทบต่อธุรกิจ"
    },
    {
        "subjectId": "06036011",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "Database System Concepts",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบแฟ้มข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ตาราง คีย์ กฎบูรณภาพ พีชคณิตเชิงสัมพันธ์ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่าง เอนทิตี การนอร์มัลไลซ์ เอสคิวแอล แนะนำการจัดการรายการเปลี่ยนแปลงและการบริหารฐานข้อมูล และปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล"
    },
    {
        "subjectId": "06036012",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "Human Interface Design",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ปัจจัยที่เกี่ยวกับมนุษย์และบทบาทในการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง เช่น อุปกรณ์ป้อนข้อมูลตัวอักษร อุปกรณ์กำหนดจุดและตำแหน่งเ เทคโนโลยีเสียงพูด และอุปกรณ์ความจริงเสมือน สัมพันธ แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิ เช่นการต่อประสานด้วยชุดคำสั่งการต่อประสานด้วยเมนู การต่อประสานด้วยภาษาธรรมชาตกระบวนการในการออกแบบและเครื่องมือช่วยออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมินผลการออกแบบ ประเด็นการออกแบบบนระบบปฏิบัติการสมัยใหม่และบนอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ"
    },
    {
        "subjectId": "06036013",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เว็บและเทคโนโลยีสื่อประสม",
        "engSubjectsName": "Web and Multimedia Technology",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ระบบสื่อประสม ประเภทของข้อมูลสื่อประสม การสร้างสื่อประสม การประมวลผลข้อมูลสื่อประสม การส่งผ่านข้อมูลสื่อประสม อุปกรณ์เก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม เทคโนโลยีสื่อประสมสำหรับเว็บ การประยุกต์ใช้งานสื่อประสม เครื่องมือในการประพันธ์สื่อประสมและเว็บ"
    },
    {
        "subjectId": "06036024",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจ",
        "engSubjectsName": "Business Information System Analysis and Design",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "เครื่องมือและวิธีการสำหรับการพัฒนาระบบสารสนเทศทางธุรกิจ แนวคิดการวิเคราะห์และออกแบบระบบสารสนเทศทางธุรกิจในปัจจุบัน แบบจำลองการวิเคราะห์ระบบ แบบจำลองการออกแบบระบบ ความสำคัญของกระบวนการควบคุมในขั้นตอนการวางแผน วิเคราะห์ จัดสร้าง และทดสอบระบบสารสนเทศทางธุรกิจเพื่อแก้ปัญหาการจัดการด้านธุรกิจ กรณีศึกษา"
    },
    {
        "subjectId": "06036007",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ  การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการโครงกาiการประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ  การจัดการการเปลี่ยนแปลง การควบคุมโครงการ และประเมินผลโครงการ"
    },
    {
        "subjectId": "06036009",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "เศรษฐศาสตร์เทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Economics of Information Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "หลักการเศรษฐศาสตร์เบื้องต้น แนวคิดและทฤษฎีเกี่ยวกับกระบวนนวัตกรรมและการเปลี่ยนแปลงเทคโนโลยี ตลาดเทคโนโลยีสารสนเทศ การประเมินการลงทุนทางด้านเทคโนโลยีสารสนเทศ ผลกระทบของการพัฒนาและการเปลี่ยนแปลงเทคโนโลยีต่อการพัฒนาเศรษฐกิจและอุตสาหกรรม การจ้างงาน การเจริญเติบโตของธุรกิจ ผลิตภาพ การถ่ายทอดเทคโนโลยี การวิจัยและพัฒนา การปรับตัวเข้าสู่สังคมสารสนเทศ"
    },
    {
        "subjectId": "06036010",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "กระบวนการธุรกิจและการวางแผนทรัพยากรองค์กร",
        "engSubjectsName": "Business Process and Enterprise Resource Planning",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กระบวนการธุรกิจหลักในองค์กร กระบวนการทางบัญชี กระบวนการได้มาซึ่งทรัพยากร  กระบวนการจัดการสินค้าและคลังสินค้า กระบวนการการผลิต และกระบวนการการขายสินค้าหรือบริการ การบูรณาการกระบวนการธุรกิจด้วยระบบวางแผนทรัพยากรองค์กร  แนวคิดการวางแผนทรัพยากรองค์กร เรียนรู้ทักษะเชิงปฏิบัติในการนำกระบวนการธุรกิจมาใช้งานบนแอพพลิเคชันมาตรฐานของระบบวางแผนทรัพยากรองค์กร"
    },
    {
        "subjectId": "06036014",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฏหมายไอที",
        "engSubjectsName": "Information System Security and IT Laws",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล อาชญากรรมคอมพิวเตอร์ การป้องกันและการสืบสวน การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ ทรัพย์สินทางปัญญา ความเป็นเจ้าของสารสนเทศ กฎหมายเกี่ยวกับลิขสิทธิ สิทธิบัตรและเครื่องหมายการค้า ความลับทางการค้า วัฒนธรรมองค์กร ความเป็นมืออาชีพ กฎระเบียบหลักเกณฑ์ทางวิชาชีพ ปัญหาเกี่ยวกับจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ การละเมิดลิขสิทธิ์ซอฟต์แวร์"
    },
    {
        "subjectId": "06036025",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "เทคโนโลยีเชิงอ็อบเจกต์",
        "engSubjectsName": "Object Oriented Technology",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การออกแบบและพัฒนาโปรแกรมเชิงอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะ ภาวะพหุสัณฐาน การพัฒนาส่วนต่อประสานกราฟิกกับผู้ใช้และการจัดการกับเหตุการณ์ โครงสร้างข้อมูลแบบแถวลำดับและคอลเลคชัน การจัดการกับสิ่งผิดปรกติ คลาสที่เกี่ยวข้องกับอินพุตและเอาต์พุต เธรด"
    },
    {
        "subjectId": "060360xx",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 1",
        "engSubjectsName": "Elective Course in Information Technology 1",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06036015",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การทำการตลาดดิจิทัล",
        "engSubjectsName": "Digital Marketing",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การทำการตลาดและธุรกิจแบบร่วมสมัย การโฆษณาแบบออนไลน์และออฟไลน์ในโลกยุคดิจิทัล เช่น การโฆษณาทางโทรทัศน์ หนังสือพิมพ์ การแสดงผลลัพธ์ การสืบค้น วิดีโอ และโทรศัพท์มือถือ เป็นต้น การจัดการสื่อและการโฆษณาทางดิจิทัล การรณรงค์สื่อสารทางการตลาดและการวางแผนการประเมิน การปฏิบัติทางการตลาดตามหลักจริยธรรม แนวคิดความรับผิดชอบต่อสังคมและการพัฒนาอย่างยั่งยืน กลยุทธ์การสร้างแบรนด์ (ตราสินค้า) หลักการออกแบบเว็บแอปพลิเคชันและแอปพลิเคชันบนโทรศัพท์มือถือสำหรับการตลาดดิจิทัล การคิดในการออกแบบการตลาด สื่อสังคมสำหรับจัดการแบรนด์และการโฆษณา"
    },
    {
        "subjectId": "06036016",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "ธุรกิจอัจฉริยะและข้อมูลขนาดใหญ่",
        "engSubjectsName": "Business Intelligence and Big Data",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ธุรกิจอัจฉริยะ (business Intelligence) และส่วนประกอบของมัน ข้อมูลขนาดใหญ่ (big data) และการวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) ลักษณะเฉพาะ 5 อย่างของข้อมูลขนาดใหญ่ – volume (ข้อมูลมหาศาล ขนาดใหญ่) variety (ข้อมูลที่มีความหลากหลายทั้งที่เป็นแบบโครงสร้าง หรือรูปแบบที่ไม่แน่นอน) velocity (ข้อมูลที่จะต้องวิเคราะห์เข้าสู่ระบบฐานข้อมูลอย่างรวดเร็ว โดยให้ความสำคัญกับข้อมูลที่เป็น real – time) veracity (ความถูกต้อง ครบถ้วนของข้อมูล) และ value (ข้อมูลที่สามารถนำมาใช้งานได้จริง) การทำคลังข้อมูล (data warehousing) การทำเหมืองข้อมูล (data Mining) การวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) การทำรายงานเชิงวิเคราะห์ (analytical reporting) การแสดงผลข้อมูล (data visualization)"
    },
    {
        "subjectId": "06036017",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "ระบบที่ใช้ทั้งองค์กร",
        "engSubjectsName": "Enterprise Systems",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความรู้พื้นฐานของระบบที่ใช้ทั้งองค์กร (Enterprise systems) ระบบเหล่านี้นั้นสามารถนำมาใช้ในการดำเนินธุรกิจในปัจจุบันได้อย่างไร  ระบบการจัดการทรัพยากรในองค์กร (Enterprise resource planning or ERP systems) ระบบการจัดการห่วงโซ่อุปทาน (Supply chain management or SCM systems) ระบบการจัดการลูกค้าสัมพันธ์ (Customer relationship management or CRM systems) ระบบการวิเคราะห์ทางธุรกิจ (Business Analytics) เน้นทั้งด้านวิธีการจัดการทางธุรกิจและด้านเทคโนโลยี"
    },
    {
        "subjectId": "06036018",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "สื่อสังคมและเครือข่ายสังคม",
        "engSubjectsName": "Social Media and Social Network",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ทฤษฏีและวิธีการประยุกต์ใช้สื่อสังคมในองค์กร เข้าใจการปรับเปลี่ยนพฤติกรรมของผู้คนในการมีปฏิสัมพันธ์กันโดยใช้สื่อสังคม ข้อดีและข้อเสียของการใช้สื่อสังคม การใช้สื่อสังคมกับธุรกิจ แนะนำเบื้องต้นเกี่ยวกับเครือข่ายสังคมที่เป็นที่นิยม; แนวคิดพื้นฐานของเครือข่าย พื้นฐานจิตวิทยาของเครือข่ายสังคม การวิเคราะห์เครือข่ายสังคม"
    },
    {
        "subjectId": "06036026",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "การพัฒนาโปรแกรมประยุกต์บนอุปกรณ์เคลื่อนที่",
        "engSubjectsName": "Mobile Application Development",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การแนะนำเทคโนโลยีและการเขียนโปรแกรมที่เกี่ยวข้องกับอุปกรณ์เคลื่อนที่ ได้แก่ มือถือแบบสมาร์ทโฟน แพด และแทบเลต การพัฒนาและทดสอบโปรแกรมประยุกต์สำหรับอุปกรณ์เคลื่อนที่โดยการทำงานจริงบนเครื่องจำลอง"
    },
    {
        "subjectId": "060360xx",
        "cooperativeEducation": true,
        "year": 3,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกทางเทคโนโลยีสารสนเทศ 2",
        "engSubjectsName": "Elective Course in Information Technology 2",
        "credit": "3(3-0-6) หรือ 3(2-2-5)"
    },
    {
        "subjectId": "06036046 หรือ 06036047",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 1,
        "thaiSubjectsName": "สหกิจศึกษา หรือ สหกิจศึกษาต่างประเทศ",
        "engSubjectsName": "COOPERATIVE EDUCATION or OVERSEA COOPERATIVE EDUCATION",
        "credit": "6(0-35-0) หรือ 6(0-35-0)"
    },
    {
        "subjectId": "06036086",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "หลักปรัชญาแห่งวิทยาศาสตร์",
        "engSubjectsName": "Philosophy of Science",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความหมายของคำว่า “วิทยาศาสตร์”; อะไรคือความจริงทางวิทยาศาสตร์; ธรรมชาติของวิทยาศาสตร์; กระบวนการทางวิทยาศาสตร์; ทฤษฎีและกฎทางวิทยาศาสตร์ – การค้นพบและการสร้าง; ธรรมชาติของความรู้ทางวิทยาศาสตร์; การออกแบบการทดลองทางวิทยาศาสตร์; การทดสอบสมมติฐาน; การตั้งสมมติฐาน; ความก้าวหน้าทางวิทยาศาสตร์ในโลกปัจจุบัน"
    },
    {
        "subjectId": "06036088",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "การคิดอย่างสร้างสรรค์",
        "engSubjectsName": "Creative Thinking",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "เข้าใจว่า “ความคิดสร้างสรรค์” คืออะไร; การคิดแก้ไขปัญหาอย่างสร้างสรรค์ ในสถานการณ์ที่กำกวมและซับซ้อน ซึ่งไม่สามารถแก้ไขได้โดยตรงโดยการใช้ตรรกะทั่วไป; การส่งเสริมความคิดสร้างสรรค์ในระดับบุคคล; การเสริมสร้างทักษะในการคิดอย่างสร้างสรรค์ให้ผู้อื่น; สภาพแวดล้อมที่ช่วยส่งเสริมความคิดสร้างสรรค์; การจัดการความคิดสร้างสรรค์ของทีมงานพัฒนานวัตกรรม; กระบวนการคิดอย่างสร้างสรรค์ และทฤษฎีต่างๆ ที่เกี่ยวข้อง"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกเสรี 1",
        "engSubjectsName": "Free Elective Course 1",
        "credit": "3(3-0-6)"
    },
    {
        "subjectId": "xxxxxxxx",
        "cooperativeEducation": true,
        "year": 4,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกเสรี 2",
        "engSubjectsName": "Free Elective Course 2",
        "credit": "3(3-0-6)"
    }
]