[
    {
        "subjectId": "06016301",
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Fundamentals",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016314",
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Problem Solving in Information Technology",
        "year": 1,
        "semeter": 1,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำการเขียน โปรแกรมคอมพิวเตอร์",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016311",
        "thaiSubjectsName": "เทคโนโลยีสื่อประสม",
        "engSubjectsName": "Multimedia Technology",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ระบบสื่อประสม ประเภทข้อมูลของสื่อประสม การสร้างสื่อประสม การประมวลผลข้อมูลสื่อประสม การส่งผ่านข้อมูลสื่อประสม ประเภทของไฟล์สื่อประสม อุปกรณ์การเก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม แอพลิเคชั่นสื่อประสม เครื่องมือการประพันธ์สื่อประสม",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016315",
        "thaiSubjectsName": "การสร้างโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "Computer Programming",
        "year": 1,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำภาษาการสร้างโปรแกรม การเขียนผังงาน แนวคิดของโปรแกรมภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้นและข้อความสั่งกำ หนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การประมวลผลสตริง การเขียนการเขียนฟังก์ชัน ตัวชี้ การเขียนข้อมูลชนิดโครงสร้าง การกำหนดคุณสมบัติของตัวแปร การจัดการหน่วยความจำ แฟ้มอินพุตและเอาต์พุต การประยุกต์ใช้กับไมโครคอนโทรลเลอร์",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016313",
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "Introduction to Computer Networks",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "หลักการพื้นฐานเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูล สถาปัตยกรรมเครือข่าย การแบ่งระดับชั้นการทำงานเครือข่ายแบบโอเอสไอและทีซีพีไอพี โพรโทคอลระดับแอพลิเคชัน สถาปัตยกรรมแอพลิเคชัน โพรโทคอลระดับทรานสปอร์ต รูปแบบการส่งข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโทคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิทชิงและแพ็คเก็ตสวิทชิง โพรโทคอลอินเตอร์เน็ต รูปแบบการหาเส้นทาง โพรโทคอลระดับดาต้าลิงก์ การควบคุมการเข้าถึงสื่อ ระบบหมายเลขที่อยู่บนเครือข่าย เทคโนโลยีอีเทอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายเสมือน เครือข่ายพื้นที่กว้าง เครือข่ายท้องถิ่นแบบไร้สาย โพรโทคอลและฟังก์ชั่นการทำงานระดับกายภาพ",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016316",
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "Data Structures and Algorithms",
        "year": 2,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016321",
        "thaiSubjectsName": "วิศวกรรมซอฟต์แวร์",
        "engSubjectsName": "Software Engineering",
        "year": 2,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความรู้เบื้องต้นเกี่ยวกับวิศวกรรมซอฟต์แวร์ กลุ่มซอฟต์แวร์และแนวโน้มความเปลี่ยนแปลง กรอบงานของกระบวนการวิศวกรรมซอฟต์แวร์ กระบวนการพัฒนาซอฟต์แวร์แบบอไจล์ แม่แบบสำหรับการ ออกแบบ วิธีปฏิบัติด้านวิศวกรรมซอฟต์แวร์ สภาพแวดล้อมการพัฒนาซอฟต์แวร์โดยใช้เวอร์ชั่นคอนโทรล แบบจำลองวุฒิภาวะและความสามารถเชิงบูรณาการ (ซีเอ็มเอ็มไอ) วิศวกรรมความต้องการ วิศวกรรมการวิเคราะห์และออกแบบ ความรู้เบื้องต้นเกี่ยวกับการทดสอบซอฟต์แวร์ กระบวนการยูนิฟาย์ การประเมินกระบวนการ และแบบจำลองกระบวนการเชิงบัญญัติและเชิงวิวัฒน์",
        "category": "หมวดวิชาบังคับเฉพาะแขนง"
    },
    {
        "subjectId": "06016322",
        "thaiSubjectsName": "การสร้างโปรแกรมเว็บ",
        "engSubjectsName": "Web Programming",
        "year": 2,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "การพัฒนาไดนามิกเว็บเพจ โพรโทคอลเอชทีทีพี แม่ข่ายเว็บ การพัฒนาโปรแกรมเว็บฝั่งแม่ข่าย การจัดการคุ้กกี้ การติดตามเซสชัน การพัฒนาโปรแกรมเว็บติดต่อกับฐานข้อมูล จาวาสคริปต์และเทคโนโลยีเอ แจ๊กซ์",
        "category": "หมวดวิชาบังคับเฉพาะแขนง"
    },
    {
        "subjectId": "06016309",
        "thaiSubjectsName": "ความมั่นคงของระบบสารสนเทศและกฏหมายไอที",
        "engSubjectsName": "Information System Security and IT Laws",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความมั่นคงของระบบสารสนเทศ ภัยคุกคาม ช่องโหว่ การประเมินและวิเคราะห์ความเสี่ยง นโยบายรักษาความปลอดภัยของระบบสารสนเทศ การจัดการความปลอดภัยของระบบสารสนเทศ การเข้ารหัสและถอดรหัสเพื่อความปลอดภัยของข้อมูล การพิสูจน์ตัวตน การควบคุมการเข้าถึงข้อมูล การรักษาความปลอดภัยของเครือข่ายคอมพิวเตอร์ กฎหมายและปัญหาจริยธรรมที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ ความเป็นส่วนตัวและความลับ อาชญากรรมคอมพิวเตอร์",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016310",
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "Human Interface Design",
        "year": 3,
        "semeter": 1,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "หลักการออกแบบโดยอาศัยผู้ใช้เป็นศูนย์กลาง ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ ขอบเขตของการออกแบบการเชื่อมต่อกับผู้ใช้และการออกแบบประสบการณ์ในการใช้งาน กระบวนการในการออกแบบการเชื่อมต่อกับผู้ใช้ เครื่องมือในการออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมิน การออกแบบการเชื่อมต่อกับผู้ใช้บนระบบปฏิบัติการสมัยใหม่และอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ",
        "category": "หมวดวิชาบังคับเฉพาะแขนง"
    },
    {
        "subjectId": "06016307",
        "thaiSubjectsName": "การบริหารโครงการเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "Information Technology Project Management",
        "year": 3,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ธรรมชาติและวงจรชีวิตของโครงการ การศึกษาความเป็นไปได้ของโครงการ เทคนิคการเลือกโครงการ องค์ความรู้สำหรับการบริหารโครงการ การจัดทีมงาน การจัดการขอบเขตของโครงการ การประมาณการโครงการ การจัดการตารางเวลา การจัดการคุณภาพ การจัดการความเสี่ยง การควบคุมโครงการ และประเมินผลโครงการ",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016348",
        "thaiSubjectsName": "การพัฒนาเกมขั้นสูง",
        "engSubjectsName": "Advanced Game Development",
        "year": 3,
        "semeter": 2,
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ความรู้ทางด้านคณิตศาสตร์และฟิสิกส์ที่จำเป็น ปัญญาประดิษฐ์ การออกแบบแผนที่เกม การสร้างเอฟเฟคสำหรับภาพและเสียง ส่วนติดต่อกับผู้ใช้สำหรับเกม แพลตฟอร์มสำหรับเกมในปัจจุบัน การพัฒนาเกมที่เชื่อมต่อเครือข่ายคอมพิวเตอร์ การพัฒนาเกมด้วยเทคโนโลยีความจริงเสริม การพัฒนาเกมสามมิติสำหรับอุปกรณ์พกพา",
        "category": "หมวดวิชาบังคับเฉพาะแขนง"
    },
    {
        "subjectId": "06016329",
        "thaiSubjectsName": "โครงงานทางด้านวิศวกรรมซอฟต์แวร์ 1",
        "engSubjectsName": " Project in Software Engineering 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางวิศวกรรมซอฟต์แวร์ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ",
        "category": "หมวดวิชาศึกษาทางเลือก"
    },
    {
        "subjectId": "06016339",
        "thaiSubjectsName": "โครงงานทางด้านเทคโนโลยีเครือข่ายและระบบ 1",
        "engSubjectsName": "Project in Network and System Technology 1",
        "year": 4,
        "semeter": 1,
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัยในหัวข้อปัจจุบันที่น่าสนใจทางเทคโนโลยีเครือข่ายและระบบ ในรูปแบบโครงการ ที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอหัวข้อ และผลการทดลองเบื้องต้นที่ได้จากการแก้ปัญหาเชิงปฏิบัติการ หรือจากการวิเคราะห์เชิงวิชาการ",
        "category": "หมวดวิชาศึกษาทางเลือก"
    },
    {
        "subjectId": "90401011",
        "thaiSubjectsName": "การประกอบการ",
        "engSubjectsName": "Entrepreneurship",
        "year": 4,
        "semeter": 2,
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ"
    },
    {
        "subjectId": "06016330",
        "thaiSubjectsName": "โครงงานทางด้านวิศวกรรมซอฟต์แวร์ 2",
        "engSubjectsName": "Project in Software Engineering 2",
        "year": 4,
        "semeter": 2,
        "credit": "3(0-9-0)",
        "thaiSubjectDetails": "ศึกษาค้นคว้าหรือวิจัย ในหัวข้อปัจจุบันที่น่าสนใจทางวิศวกรรมซอฟต์แวร์ ในรูปแบบโครงการที่สามารถประยุกต์ใช้ทฤษฎีที่เกี่ยวข้องทางการศึกษาด้านเทคโนโลยีสารสนเทศ ภายใต้การดูแลและแนะนำของอาจารย์ที่ปรึกษา เพื่อที่จะสามารถนำเสนอผลการทดลองที่สมบูรณ์ในหัวข้อที่ได้เสนอและศึกษาต่อเนื่องมาจากวิชาโครงงาน 1",
        "category": "หมวดวิชาศึกษาทางเลือก"
    },
    {
        "subject_id": "06016352",
        "thaiSubjectsName": "ระบบฐานข้อมูลขั้นสูง",
        "engSubjectsName": "Advanced Database Systems",
        "thaiSubjectDetails": "การจัดการรายการเปลี่ยนแปลง การกู้คืนโดยใช้เทคนิคลงบันทึกและการใช้แชโดว์เพจจิ้ง การจัดการบัฟเฟอร์ เทคนิคการควบคุมภาวะพร้อมกันแบบต่างๆ การกู้คืนจากความขัดข้องของรายการ เปลี่ยนแปลง การแก้ปัญหาภาวะติดตาย การประมวลผลข้อคำถาม การปรับข้อคำถามให้เหมาะที่สุด ฐานข้อมูลแบบกระจาย ฐานข้อมูลเชิงอ็อบเจกต์ หรือหัวข้ออื่นที่ผู้สอนเลือกตามความเหมาะสมกับเทคโนโลยี ปัจจุบัน",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    },
    {
        "subject_id": "06016365",
        "thaiSubjectsName": "คอมพิวเตอร์วิชัน",
        "engSubjectsName": "Computer Vision",
        "thaiSubjectDetails": "เทคนิคพื้นฐานในการประมวลผลภาพ การตรวจจับและตัดแยกคุณลักษณะเด่นจากภาพ รูปแบบการจัดเก็บข้อมูลรูปร่างของวัตถุในภาพ สีและความเข้มแสง การรู้จำวัตถุในภาพ วิชัน 3 มิติ การวิเคราะห์ข้อมูลเชิงพลวัต การประยุกต์ใช้คอมพิวเตอร์วิชัน เช่นระบบตรวจผลผลิตในโรงงานอุตสาหกรรม ระบบวิเคราะห์ภาพทางการแพทย์ ระบบรู้จำบุคคลโดยใช้เอกลักษณ์ของบุคคล ระบบขนส่งอัจฉริยะ ระบบรักษาความปลอดภัย",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาเลือก"
    }
]