[
    {
        "subjectId": "06016401",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "MATHEMATICS FOR INFORMATION TECHNOLOGY",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ลิมิตและความต่อเนื่องอนุพันธ์ของฟังก์ชันอนุพันธ์อันดับสูงการประยุกต์ของอนุพันธ์ปัญหา ค่าสูงสุดและต่ำสุดของฟังก์ชัน การอินทิเกรตและเทคนิคของการอินทเกรต การประยุกต์ของการ อินทิเกรตฟังก์ชันสองตัวแปร อนุพันธ์ย่อยพีชคณิตเชิงเส้น เมทริกซ์และดีเทอร์มิแนนท์ ระบบสมการเชิง เส้นและการหาผลเฉลยของระบบสมการเชิงเส้น เวกเตอร์สเปซ การแปลงเชิงเส้น การแปลงเมทริกซ์ เมทริกซ์เชิงตั้งฉาก"
    },
    {
        "subjectId": "06016402",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "INFORMATION TECHNOLOGY FUNDAMENTALS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ ระบบประมวลผลข้อมูล ฮาร์ดแวร์และซอฟต์แวร์ภาพรวมการทำงานของระบบปฏิบัติการ ข้อมูลและการแทนค่าข้อมูล การจัดการข้อมูล แนวคิดพื้นฐานสำหรับการสร้างโปรแกรมเทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล ระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ประเด็นทางด้านจริยธรรมและสังคมกับเทคโนโลยีสารสนเทศ"
    },
    {
        "subjectId": "06016411",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ระบบคอมพิวเตอร์เบื้องต้น",
        "engSubjectsName": "",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ระบบจำนวนระบบฐานสองพีชคณิตบูลีนเทคนิคการออกแบบเชิงดิจิทัล ลอจิกเกตและการลดจำนวน วงจรเชิงผสมเบื้องต้นหน่วยคำนวณและตรรก วิวัฒนาการของคอมพิวเตอร์ องค์ประกอบของระบบคอมพิวเตอร์และการเชื่อมต่อระหว่างกัน วิธีการคำนวณทางคณิตศาสตร์ของเครื่องคอมพิวเตอร์"
    },
    {
        "subjectId": "06066303",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาและการโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "PROBLEM SOLVING AND COMPUTER PROGRAMMING",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำการเขียน โปรแกรมคอมพิวเตอร์"
    },
    {
        "subjectId": "90641001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โรงเรียนสร้างเสน่ห์",
        "engSubjectsName": "CHARM SCHOOL ",
        "credit": "2(1-2-3)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": " เรียนรู้วิธีการสร้างเสน่ห์ให้ตนเองเพื่อการใช้ชีวิตและการทำงานในอนาคตอย่างมีความสุข ฝึกวิธีการวางตัว การสื่อสาร การมีมนุษยสัมพันธ์ การปรับบุคลิกภาพ และการมีจิตอาสา เพื่อสะท้อนคุณลักษณะความเป็นลูกพระจอมเกล้าลาดกระบัง"
    },
    {
        "subjectId": "96644007",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "FOUNDATION ENGLISH 1",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน A2 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "90641003",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "กีฬาและนันทนาการ",
        "engSubjectsName": "SPORTS AND RECREATIONAL ACTIVITIES ",
        "credit": "1(0-3-2)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": " ศึกษากฎ กติกา วัฒนธรรม สังคมทางกีฬา ความมีน้ำใจนักกีฬา หลักการออกกำลังกายที่ถูกต้อง การฝึกทักษะกีฬา และกิจกรรมนันทนาการ"
    },
    {
        "subjectId": "06016408",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การสร้างโปรแกรมเชิงวัตถุ",
        "engSubjectsName": "OBJECT-ORIENTED PROGRAMMING",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การออกแบบและพัฒนาโปรแกรมเชิงอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะ ภาวะพหุสัณฐาน การพัฒนาส่วนต่อประสานกราฟิกกับผู้ใช้และการจัดการกับเหตุการณ์ อาร์เรย์และคอลเลคชัน การจัดการกับสิ่งผิดปกติ คลาสที่เกี่ยวข้องกับอินพุตและเอาต์พุต เธรด"
    },
    {
        "subjectId": "06066001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "PROBABILITY AND STATISTICS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง ช่วงความเชื่อมั่น การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบเชิงเส้น การวิเคราะห์สหสัมพันธ์ "
    },
    {
        "subjectId": "06066101",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานทางธุรกิจสำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "BUSINESS FUNDAMENTALS FOR INFORMATION",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "สภาพแวดล้อมทางธุรกิจและระบบเศรษฐกิจ พื้นฐานของการบริหารการเงิน มูลค่าของเงินและต้นทุนของเงินทุน งบการเงิน การบริหารการผลิต การควบคุมสินค้าคงคลัง การตลาด พื้นฐานการจัดการ การจัดองค์กร การบริหารงานบุคคล จริยธรรมทางธุรกิจและความรับผิดชอบต่อสังคม"
    },
    {
        "subjectId": "06066301",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "DATA STRUCTURES AND ALGORITHMS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "96641002",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความฉลาดทางดิจิทัล",
        "engSubjectsName": "DIGITAL INTELLIGENCE QUOTIENT",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาทัศนคติและค่านิยมที่จำเป็นต่อการใช้ชีวิตในโลกดิจิทัล พัฒนาทักษะที่สำคัญสำหรับการขัดเกลาทางสังคมในโลกดิจิทัลโดยมุ่งเน้นที่อัตลักษณ์ของพลเมืองดิจิทัล การคิดอย่างมีวิจารณญาณ การจัดการความปลอดภัยทางไซเบอร์ การจัดการความเป็นส่วนตัว การจัดการเวลาหน้าจอ รอยเท้าทางดิจิทัล การจัดการการกลั่นแกล้งทางอินเทอร์เน็ต และความเห็นอกเห็นใจทางดิจิทัล เพื่อใช้ชีวิตอย่างชาญฉลาดในโลกดิจิทัล"
    },
    {
        "subjectId": "96644008",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "FOUNDATION ENGLISH 2",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน ภายใต้บริบทและสถานการณ์ที่หลากหลาย เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน B1 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06016403",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "เทคโนโลยีสื่อประสม",
        "engSubjectsName": "MULTIMEDIA TECHNOLOGY",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ประเภทของสื่อดิจิทัลการเก็บข้อมูลมัลติมีเดีย การบีบอัดข้อมูลมัลติมีเดีย การส่งเนื้อหามัลติมีเดีย รูปแบบไฟล์มัลติมีเดีย การประมวลผลข้อมูลมัลติมีเดียอุปกรณ์อินพุตเอาต์พุตมัลติมีเดียเซ็นเซอร์อุปกรณ์เคลื่อนที่ เทคโนโลยีเซิร์ฟเวอร์สื่อ เช่น การสตรีมวิดีโอ VoD, CDN และ CMS เซิร์ฟเวอร์ เทคโนโลยีมัลติมีเดียขั้นสูงและแอปพลิเคชั่น เช่น วิดีโอ 360 องศา ภาพ HDR เทคโนโลยี VR AR/MR เครื่องมือสำหรับสร้างเนื้อหามัลติมีเดียเชิงโต้ตอบ"
    },
    {
        "subjectId": "06016409",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การประมวลทางกายภาพ",
        "engSubjectsName": "PHYSICAL COMPUTING",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนวคิดของโปรแกรมภาษาซี ข้อมูลและชนิดของข้อมูลในภาษาซี ฟังก์ชันเบื้องต้นและข้อความสั่งกำหนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การเขียนฟังก์ชัน การเขียนข้อมูลชนิดโครงสร้าง ตัวชี้ ไมโครคอนโทรลเลอร์เบื้องต้น การเชื่อมต่อสำหรับส่งออก การเชื่อมต่อสำหรับนำเข้า ตัวเปลี่ยนแอนะล็อกเป็นดิจิทัล/ตัวเปลี่ยนดิจิทัลเป็นแอนะล็อก อินเทอร์เน็ตของสรรพสิ่งเบื้องต้น โพรโทคอลสำหรับอินเทอร์เน็ตของสรรพสิ่ง การทำให้เกิดผลของอินเทอร์เน็ตของสรรพสิ่งด้วยไมโครคอนโทรลเลอร์"
    },
    {
        "subjectId": "06016413",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "ระบบเครือข่ายเบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO NETWORK SYSTEMS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของเครือข่ายคอมพิวเตอร์และการสื่อสารข้อมูลสถาปัตยกรรมเครือข่ายและแบบจำลองแบบระดับชั้น โพรโตคอลระดับแอปพลิเคชัน สถาปัตยกรรมแอปพลิเคชัน โพรโตคอลระดับทรานสปอร์ต การส่งผ่านข้อมูลให้น่าเชื่อถือ การควบคุมความคับคั่ง โพรโตคอลระดับเครือข่าย เครือข่ายเซอร์กิตสวิตซ์และแพ็กเก็ตสวิตซ์ การกำหนดเส้นทาง โพรโตคอลอินเทอร์เน็ต โพรโตคอลระดับดาตาลิงก์ ระบบหมายเลขที่อยู่บนเครือข่าย การควบคุมการเข้าถึงสื่อ เทคโนโลยีอีเธอร์เน็ต เครือข่ายท้องถิ่น เครือข่ายท้องถิ่นเสมือน เครือข่ายท้องถิ่นแบบไร้สาย เครือข่ายพื้นที่กว้าง ฟังก์ชั่นการทำงานระดับกายภาพ การจัดการและการแก้ปัญหาเครือข่าย"
    },
    {
        "subjectId": "06066000",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "BDISCRETE MATHEMATICS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกะและเซต ความสัมพันธ์และฟังก์ชัน ลำดับและอนุกรม อุปนัยเชิงคณิตศาสตร์ คอมบินาทอรี่ส์ กราฟ ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด"
    },
    {
        "subjectId": "06066300",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "DATABASE SYSTEM CONCEPTS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ สกีมา อินแสตน รีเลชันชิป กฎบูรณภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่างเอนทิตี ฟังก์ชันดีเพนเดนซี นอร์มัลไลซ์เซชัน พีชคณิตเชิงสัมพันธ์ เอสคิวแอล การประมวลผลทรานแซคชัน แนวคิดคลังข้อมูลและการออกแบบ ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล"
    },
    {
        "subjectId": "06066304",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศ",
        "engSubjectsName": "INFORMATION SYSTEM ANALYSIS AND DESIGN",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การพัฒนาโดยใช้แนวคิดเชิงวัตถุ การวิเคราะห์และออกแบบ การเลือกโครงการและการจัดการ โครงการสารสนเทศ กำหนดความต้องการระบบ การวิเคราะห์ด้วยยูสเคส แบบจำลองกระบวนการ แบบจำลองข้อมูล การออกแบบสถาปัตยกรรมและกลยุทธการออก การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบส่วนจัดเก็บข้อมูล การออกแบบโปรแกรม คลาสและเมธอด การสร้างและการติดตั้งระบบ"
    },
    {
        "subjectId": "06016405",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานความมั่นคงปลอดภัยไซเบอร์",
        "engSubjectsName": "CYBERSECURITY FUNDAMENTAL",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ภัยและการโจมตีทางไซเบอร์ มุมมองและผลกระทบที่มีต่อผู้ใช้ ช่องโหว่และความเสี่ยงพื้นฐานมัลแวร์ความมั่นคงปลอดภัยของข้อมูลซอฟท์แวร์และเครือข่าย การกำหนดนโยบายและกลไกบังคับบริการ กลไกสนับสนุนและเครื่องมือป้องกันที่เกี่ยวกับการรักษาความมั่นคงปลอดภัยเครื่องมือและเทคโนโลยีความมั่นคงปลอดภัยภาพรวมการเข้าและถอดรหัสลับการยืนยันตัวตนการลงลายเซ็นดิจิตัลการควบคุมการเข้าถึงความปลอดภัยข้อมูลส่วนบุคคลกฎหมายและจริยธรรมที่เกี่ยวกับไซเบอร์"
    },
    {
        "subjectId": "06016410",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "วิศวกรรมซอฟต์แวร์",
        "engSubjectsName": "SOFTWARE ENGINEERING",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความรู้เบื้องต้นเกี่ยวกับวิศวกรรมซอฟต์แวร์กรอบงานของกระบวนการวิศวกรรมซอฟต์แวร์หลักปฎิบัติทางวิศวกรรมซอฟต์แวร์ กระบวนการพัฒนาซอฟต์แวร์แบบอไจล์ การประชุมของอไจล์ การวิเคราะห์และรวบรวมความต้องการแบบอไจล์ การสร้างแบบจำลองและจัดลำดับความสำคัญความต้องการ กระบวนการจัดการโครงการพัฒนาซอฟต์แวร์แบบสกรัมอย่างสมบูรณ์ พื้นฐานกระบวนการจัดการโครงการพัฒนาซอฟต์แวร์แบบลีนและคานบาน การออกแบบเชิงวัตถุขั้นสูง (ดีไซน์แพตเทิร์น) ความรู้เบื้องต้นเกี่ยวกับการทดสอบซอฟต์แวร์ พื้นฐานการพัฒนาโดยใช้การทดสอบเป็นตัวขับเคลื่อน แบบจำลองกระบวนการสำหรับการพัฒนาซอฟต์แวร์"
    },
    {
        "subjectId": "06016412",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างระบบคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "COMPUTER ORGANIZATION AND OPERATING SYSTEM",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "องค์ประกอบของคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ อินพุตและเอาต์พุต การทำงานร่วมกันขององค์ประกอบต่าง ๆ ภาพรวมการทำงานของระบบปฏิบัติการ กระบวนการ โพรเซสและเธรด การสลับการทำงาน การจัดการหน่วยความจำ หน่วยความจำเสมือน การใช้งานระบบปฏิบัติการยูนิค วีเอมแวร์หรือเวอร์ชวลบ้อกว์รวมถึงการใช้งานแพลตฟอร์มด๊อกเกอร์"
    },
    {
        "subjectId": "06066302",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การเขียนโปรแกรมเว็บพื้นฐาน",
        "engSubjectsName": "FUNDAMENTAL WEB PROGRAMMING",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนวคิดพื้นฐานและหลักการทำงานของระบบเว็บ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ การเขียนโปรแกรมเว็บฝั่งไคลแอนท์ HTML CSS JavaScript กระบวนการออกแบบส่วนต่อประสานกับผู้ใช้ การจัดการกับ Events การจัดการโครงสร้างเอกสารและ DOM การเขียนโปรแกรมเว็บฝั่งเซิร์ฟเวอร์ PHP การจัดการและการใช้งานฐานข้อมูล การใช้งานเฟรมเวิร์ค "
    },
    {
        "subjectId": "06016414",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "ระบบฐานข้อมูลแบบโนเอสคิวแอล",
        "engSubjectsName": "NOSQL DATABASE SYSTEMS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ความแตกต่างจากระบบฐานข้อมูลเชิงสัมพันธ์ ข้อดีและข้อเสียของฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ชนิดและโครงสร้างฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แบบคอลัมน์ แบบคีย์แวลยู แบบเอกสาร และแบบกราฟ ตัวอย่างการออกแบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ การใช้ภาษาเจสันกับฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ แนะนำภาษาเจสัน ไวยากรณ์ของเจสัน ชนิดข้อมูลของเจสัน"
    },
    {
        "subjectId": "06016415",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "วิศวกรรมซอฟต์แวร์",
        "thaiSubjectsName": "การเขียนโปรแกรมเชิงฟังก์ชัน",
        "engSubjectsName": "FUNCTIONAL PROGRAMMING",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กระบวนทัศน์การเขียนโปรแกรมแนวคิดทางฟังก์ชั่นคณิตศาสตร์และภาษาโปรแกรมแลมด้าแคลคูลัส ในการเขียนโปรแกรมเชิงฟังก์ชั่นโครงสร้างข้อมูลเชิงฟังก์ชั่นการประมวลผลขนานเชิงฟังก์ชัน"
    },
    {
        "subjectId": "06016419",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "โครงสร้างพื้นฐานเครือข่ายการสื่อสาร ",
        "engSubjectsName": "COMMUNICATION NETWORK INFRASTRUCTURE",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "มาตรฐานและแบบจำลองการสื่อสาร รวมถึงอุปกรณ์ตัวกลาง ได้แก่ แบบจำลอง โอเอสไอและทีซีพี/ไอพี สื่อตัวกลางสำหรับเครือข่าย ได้แก่ สื่อแบบมีสายและสื่อแบบไร้สาย มาตรฐานและเทคนิคการทำงานในระดับชั้นกายภาพ ได้แก่ การผสมสัญญาณ การสลับช่องสัญญาณ การเข้าถึงสื่อแบบหลายหน่วย กลไกและมาตรฐานการทำงานในระดับดาต้าลิ้งค์ ได้แก่ การสื่อสารระหว่างสองจุด การควบคุมการเข้าถึงสื่อตัวกลาง เครือข่ายแบบท้องถิ่น อีเธอร์เน็ต ไออีอีอี 802.1 และ 802.3 เครือข่ายท้องถิ่นเสมือน สวิตชิ่ง ระบบเครือข่ายแบบไร้สาย ได้แก่ เทคนิคการเข้าถึงแบบไร้สาย วายฟาย ไออีอีอี 802.11 บลูทูธ ซิกบี มาตรฐานเครือข่ายแบบเคลื่อนที่ โพรโตคอลในระดับเครือข่าย ได้แก่ การอ้างตำแหน่ง การเลือกเส้นทาง ความผิดพลาดและการแจ้งเตือน โพรโตคอลอินเทอร์เน็ต ไอพีเวอร์ชั่นสี ไอพีเวอร์ชั่นหก เออาร์พี อาร์เออาร์พี ดีเอชซีพี เอ็มพีแอลเอส การเลือกเส้นทางเครือข่าย ได้แก่ ตารางเส้นทาง อาร์ไอพี โอเอสพีเอฟ บีจีพี ไอเอส-ไอเอส การขนส่งและการติดต่อสื่อสารระหว่างโพรเซส ได้แก่ ฟังก์ชั่นการขนส่ง ทีซีพี ยูดีพี ซอกเก็ต ไอพีซี โพรโตคอลประยุกต์พื้นฐาน ได้แก่ เทลเน็ต เอฟทีพี ดีเอ็นเอส ฮูอีส โพรโตคอลการใช้งานจดหมาย ได้แก่ เอสเอ็มทีพี เอ็มไอเอ็มอี พีโอพี ไอเอ็มเอพี โพรโตคอลการใช้งานเว็บ ได้แก่ เอชทีทีพี การค้นหาเว็บ การให้บริการเว็บเซอร์วิส โพรโตคอลการใช้งานสื่อประสม ได้แก่ เอสดีพี เอสไอพี เอช 323 อาร์ทีพี อาร์ที่เอสพี อาร์เอสวีพี ระบบโทรศัพท์แบบไอพี โพรโตคอลการจัดการ ได้แก่ สถาปัตยกรรมการจัดการ หน้าที่การจัดการตามไอเอสโอ เอสเอ็นเอ็มพี เอ็มไอบี การจัดการแบบเว็บ ความมั่นคงปลอดภัยเครือข่าย ได้แก่ ไฟร์วอลล์ ระบบตรวจจับผู้บุกรุก ระบบป้องกันผู้บุกรุก การแปลงที่อยู่เครือข่าย เครือข่ายส่วนตัวเสมือน เอสเอสแอล/ทีแอลเอส เอสเอสเอช เอชทีทีพีเอส เอสเอฟทีพี"
    },
    {
        "subjectId": "06016420",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "เทคโนโลยีเครือข่ายและระบบ",
        "thaiSubjectsName": "ระบบโครงสร้างพื้นฐานและการบริการ",
        "engSubjectsName": "INFRASTRUCTURE SYSTEMS AND SERVICES",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำทรัพยากรคอมพิวเตอร์ที่ใช้ในระบบโครงสร้างพื้นฐานเทคโนโลยีสารสนเทศและการให้บริการ ทรัพยากรด้านการประมวลผล ทรัพยากรด้านการจัดเก็บ ทรัพยากรด้านการสื่อสาร การทำทรัพยากรเสมือนในระบบคอมพิวเตอร์ โครงสร้างพื้นฐานที่กำหนดด้วยซอฟท์แวร์ มุมมองด้านการให้บริการของทรัพยากรในระบบโครงสร้างพื้นฐานเทคโนดลยีสารสนเทศ บริการด้านการประมวลผลและจัดเก็บในบริการกลุ่มเมฆแบบสาธารณะและแบบส่วนตัว บริการด้านระบบเครือข่ายสื่อสารในกลุ่มเมฆ บริการด้านการจัดการบัญชีและการควบคุมการเข้าถึงความมั่นคงปลอดภัยในโครงสร้างพื้นฐาน การบริหารจัดการโครงสร้างพื้นฐาน การจัดการและบริการสำหรับศูนย์ข้อมูลสารสนเทศ"
    },
    {
        "subjectId": "06016424",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "พัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "HUMAN INTERFACE DESIGN",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "หลักการออกแบบโดยมีผู้ใช้เป็นศูนย์กลาง กระบวนการออกแบบส่วนต่อประสานกับผู้ใช้และประสบการณ์สำหรับผู้ใช้ การวิเคราะห์ผู้ใช้และการวิเคราะห์งาน ความต้องการด้านการใช้ประโยชน์ได้ ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ หลักการและข้อแนะนำในการออกแบบ เทคนิคการประเมินผล ข้อแนะนำพื้นฐานในการออกแบบสำหรับเว็บและแอพลิเคชันบนอุปกรณ์แบบพกพาได้ เครื่องมือในการสร้างต้นแบบ เทคโนโลยีอินพุทและเอาท์พุทสำหรับการปฏิสัมพันธ์กับมนุษย์ "
    },
    {
        "subjectId": "06016425",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "subjectAreas": "พัฒนาสื่อประสมและเกม",
        "thaiSubjectsName": "พื้นฐานการออกแบบทัศนศิลป์สำหรับสื่อปฏิสัมพันธ์",
        "engSubjectsName": "VISUAL DESIGN FUNDAMENTALS FOR INTERACTIVE MEDIA",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "องค์ประกอบของการออกแบบทัศนศิลป์ หลักการออกแบบทัศนศิลป์ ลำดับชั้นขององค์ประกอบเชิงทัศน์ การจัดวางองค์ประกอบ แบบอักษรและการเลือกใช้ ข้อแนะนำในการใช้สี การออกแบบและใช้งานไอคอน พื้นฐานการนำเสนอข้อมูลด้วยภาพ กระบวนการออกแบบทัศนศิลป์ การประยุกต์ใช้การออกแบบทัศนศิลป์สำหรับเว็บและสื่อปฏิสัมพันธ์ เครื่องมือและแหล่งทรัพยากรสำหรับการออกแบบทัศนศิลป์"
    }
]