[
    {
        "subjectId": "06026200",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "แคลคูลัส 1",
        "engSubjectsName": "CALCULUS 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ฟังก์ชัน, ลิมิต, ความต่อเนื่อง และการประยุกต์ใช้อุปนัยเชิงคณิตศาสตร์ แนะนําอนุพันธ์การหาอนุพันธ์ การประยุกต์ใช้อนุพันธ์ ปริพันธ์จํากัดเขต การปริพันธ์ด้วยปฏิยานุพันธ์การ ประยุกต์ใช้ปริพันธ์จํากัดเขต รูปแบบของการปริพันธ์ที่หาค่าไม่ได้ ปริพันธ์ไม่ตรงแบบ การหาปริพันธ์ด้วยวิธีเชิงตัวเลข อันดับและอนุกรมของจํานวนการกระจายอนุกรมเทเลอร์ของฟังก์ชันพื้นฐานการวิเคราะห์เวกเตอร์"
    },
    {
        "subjectId": "06026202",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พีชคณิตเชิงเส้น",
        "engSubjectsName": "LINEAR ALGEBRA",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบสมการเชิงเส่น การดําเนินการมูลฐาน การกําจัดเกาส์เซียน การกําจัดเกาส์-จอร์แดน ค่าลําดับชั้น การดําเนินการของเมทริกซ์ ผกผันของเมทริกซ์ เมทริกซ์มูลฐาน เมทริกซ์ย่อย และผลแบ่งส่วน เมทริกซ์ การแยกแบบแอลยู ดีเทอร์มิแนนต์ ตัวประกอบร่วมเกี่ยว เมทริกซ์ผูกพัน กฎคราเมอร์ ปริภูมิ เวกเตอร์ ปริภูมิย่อย ค่าลักษณะเฉพาะ เวกเตอร์ลักษณะเฉพาะ การทําให้เป็นเมริกซ์ทแยงมุม การแปลงเชิง เส้น เคอร์เนล เรนจ"
    },
    {
        "subjectId": "06066101",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางธุรกิจสำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "BUSINESS FUNDAMENTALS FOR INFORMATION TECHNOLOGY",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "สภาพแวดล้อมทางธุรกิจและระบบเศรษฐกิจ พื้นฐานของการบริหารการเงิน มูลค่าของเงินและต้นทุนของเงินทุน งบการเงิน การบริหารการผลิต การควบคุมสินค้าคงคลัง การตลาดพื้นฐานการจัดการ การจัดองค์กร การบริหารงานบุคคล จริยธรรมทางธุรกิจและความรับผิดชอบต่อสังคม"
    },
    {
        "subjectId": "06066303",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาและการโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "PROBLEM SOLVING AND COMPUTER PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำ การเขียน โปรแกรมคอมพิวเตอร"
    },
    {
        "subjectId": "90641001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โรงเรียนสร้างเสน่ห์",
        "engSubjectsName": "CHARM SCHOOL",
        "category": "หมวดวิชาบังคับ",
        "credit": "2(1-2-3)",
        "thaiSubjectDetails": "เรียนรู้การทำให้ตัวเองมีเสน่ห์เพื่อใช้ชีวิตและทำงานอย่างมีความสุข โดยฝึกมารยาท ทักษะในการสื่อสารและความสัมพันธ์ระหว่างบุคคล บุคลิกภาพ และจิตอาสาที่เหมาะสม เพื่อสะท้อนถึงคุณลักษณะและอัตลักษณ์ของ KMITL"
    },
    {
        "subjectId": "90641003",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "กีฬาและนันทนาการ",
        "engSubjectsName": "SPORTS AND RECREATIONAL ACTIVITIES",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-3-2)",
        "thaiSubjectDetails": "ศึกษากฎกติกากีฬา มารยาทในการเล่น ความมีน้ำใจนักกีฬา หลักการออกกำลังกาย ฝึกซ้อมกีฬา ฟิตเนส เล่นเกม และกิจกรรมสันทนาการ"
    },
    {
        "subjectId": "90644007",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "FOUNDATION ENGLISH 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน A2 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06026201",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "แคลคูลัส 2",
        "engSubjectsName": "CALCULUS 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ฟังก์ชันหลายตัวแปรและการประยุกต์ใช้ พีชคณิตของเวกเตอร์ในสามมิติ พิกัดเชิงขั้วแคลคูลัสของฟังก์ชันจำนวนจริงสองตัวแปร การหาอนุพันธ์และปริพันธ์ของฟังก์ชันจำนวนจริงและฟังก์ชันเวกเตอร์จำนวนจริงหลายตัวแปร แนะนำปริพันธ์เส้น เส้น ระนาบ และพื้นผิว ในปริภูมิสามมิติ แคลคูลัสของฟังก์ชันจำนวนจริงในปริภูมิสามมิติ ทฤษฎีบทหลักที่เกี่ยวกับการประยุกต์ เช่น ทฤษฎีบทของกรีน ทฤษฎีไดเวอร์เจนซ์ ทฎษฎีบทของเกาส์ ทฤษฎีบทของสโตกส์ เป็นต้น"
    },
    {
        "subjectId": "06026203",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "COMPUTER PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำภาษาการสร้างโปรแกรมเชิงโครงสร้างและเชิงวัตถุ การเขียนผังงาน แนวคิดของโปรแกรมฟังก์ชันเบื้องต้นและข้อความสั่งกำหนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การประมวลผลสตริง การเขียนการเขียนฟังก์ชัน การเขียนข้อมูลชนิดโครงสร้าง การเขียนข้อมูลเชนิดอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะภาวะพหุสัณฐาน"
    },
    {
        "subjectId": "06026205",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การตลาดเบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO MARKETING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "วิชานี้ศึกษาเกี่ยวกับพฤติกรรมของผู้บริโภค การกำหนดกลยุทธ์ส่วนแบ่งตลาด การกำหนดกลุ่มเป้าหมาย และการกำหนดตำแหน่งทางการตลาด รวมถึงการดำเนินการสร้างผลิตภัณฑ์ การกำหนดราคา การเลือกใช้ช่องทางจัดจำหน่ายตลอดจนการใช้การส่งเสริมการตลาดโดยคำนึงความรับผิดชอบสังคมเป็นหลัก แนวคิดและกลยุทธ์การตลาดดิจิทัล การตลาดผ่านสื่อดิจิทัล"
    },
    {
        "subjectId": "06066001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "PROBABILITY AND STATISTICS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง ช่วงความเชื่อมั่น การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบเชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "90641002",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความฉลาดทางดิจิทัล",
        "engSubjectsName": "DIGITAL INTELLIGENCE QUOTIENT",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาทัศนคติและค่านิยมที่จำเป็นต่อการใช้ชีวิตในโลกดิจิทัล พัฒนาทักษะที่สำคัญสำหรับการขัดเกลาทางสังคมในโลกดิจิทัลโดยมุ่งเน้นที่อัตลักษณ์ของพลเมืองดิจิทัล การคิดอย่างมีวิจารณญาณ การจัดการความปลอดภัยทางไซเบอร์ การจัดการความเป็นส่วนตัว การจัดการเวลาหน้าจอ รอยเท้าทางดิจิทัล การจัดการการกลั่นแกล้งทางอินเทอร์เน็ต และความเห็นอกเห็นใจทางดิจิทัล เพื่อใช้ชีวิตอย่างชาญฉลาดในโลกดิจิทัล"
    },
    {
        "subjectId": "90642033",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "กฎหมายสำหรับคนรุ่นใหม่",
        "engSubjectsName": "LAW FOR NEW GENERATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษากฎหมายและวิเคราะห์ข้อเท็จจริงที่เกิดขึ้นในสังคม บทบาทหน้าที่และสิทธิเสรีภาพในการแสดงความคิดเห็นในที่สาธารณะ การดูหมิ่นหรือหมิ่นประมาทผู้อื่น การใช้สื่อสังคมออนไลน์ภายใต้กรอบของกฎหมาย ความรับผิดที่เกี่ยวกับการกระทำผ่านระบบคอมพิวเตอร์ แนวคิดและหลักการของกฎหมายคุ้มครองผู้บริโภคที่มีต่อผู้ประกอบธุรกิจ ปัญหาความรับผิดจากการใช้งานลิขสิทธิ์หรือละเมิดทรัพย์สินทางปัญญาของผู้อื่น และสิทธิในการปกป้องงานลิขสิทธิ์ของตนเองตามกฎหมายลิขสิทธิ์"
    },
    {
        "subjectId": "90644008",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "FOUNDATION ENGLISH 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน ภายใต้บริบทและสถานการณ์ที่หลากหลาย เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน B1 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06026206",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การวิเคราะห์ข้อมูลและการโปรแกรม",
        "engSubjectsName": "DATA ANALYTICS AND PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ในภาคทฤษฎี แนะนำการวิเคราะห์ข้อมูลเชิงธุรกิจและการตัดสินใจ สถิติเชิงพรรณนาการวิเคราะห์ความแปรปรวนหลายตัวแปร การวิเคราะห์ความถดถอยเชิงเส้นอย่างง่าย การวิเคราะห์ความถดถอยเชิงซ้อน การวิเคราะห์จำแนกกลุ่ม(Discriminant Analysis) การวิเคราะห์ความถดถอยโลจิสติก การพยากรณ์และอนุกรมเวลา การหาค่าที่เหมาะสมที่สุด ในภาคปฏิบัติแนะนำการเขียนโปรแกรมทางสถิติ เช่น ภาษาอาร์ ประเภทข้อมูล ข้อมูลตัวแปรเดี่ยว ข้อมูลตัวแปรคู่ ข้อมูลหลายตัวแปร สถิติเชิงพรรณา ตัวแปรอาร์เรย์ เมตริกซ์ ข้อมูลรายการและเฟรมข้อมูลโครงสร้างการควบคุม การวนลูป การพล๊อตกราฟและกราฟฟิค การจัดการข้อมูล การสร้างฟังก์ชัน และแพคเกจ รวมทั้งการใช้โปรแกรมสำเร็จรูปทางสถิติในการวิเคราะห์ข้อมูล"
    },
    {
        "subjectId": "06066000",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "DISCRETE MATHEMATICS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกะและเซต ความสัมพันธ์และฟังก์ชัน ลำดับและอนุกรม อุปนัยเชิงคณิตศาสตร์คอมบินาทอรี่ส์กราฟ ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด"
    },
    {
        "subjectId": "06066300",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "DATABASE SYSTEM CONCEPTS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ สกีมา อินแสตน รีเลชันชิป กฎบูรณภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่างเอนทิตี ฟังก์ชันดีเพนเดนซี นอร์มัลไลซ์เซชัน พีชคณิตเชิงสัมพันธ์ เอสคิวแอล การประมวลผลทรานแซคชัน แนวคิดคลังข้อมูลและการออกแบบ ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล"
    },
    {
        "subjectId": "06066302",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนโปรแกรมเว็บพื้นฐาน",
        "engSubjectsName": "FUNDAMENTAL WEB PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานและหลักการทำงานของระบบเว็บ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ การเขียนโปรแกรมเว็บฝั่งไคลแอนท์ HTML CSS JavaScript กระบวนการออกแบบส่วนต่อประสานกับผู้ใช้ การจัดการกับ Events การจัดการโครงสร้างเอกสารและ DOM การเขียนโปรแกรมเว็บฝั่งเซิร์ฟเวอร์ PHP การจัดการและการใช้งานฐานข้อมูล การใช้งานเฟรมเวิร์ค"
    },
    {
        "subjectId": "06066304",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศ",
        "engSubjectsName": "INFORMATION SYSTEM ANALYSIS AND DESIGN",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การพัฒนาโดยใช้แนวคิดเชิงวัตถุ การวิเคราะห์และออกแบบ การเลือกโครงการและการจัดการ โครงการสารสนเทศ กำหนดความต้องการระบบ การวิเคราะห์ด้วยยูสเคส แบบจำลองกระบวนการ แบบจำลองข้อมูล การออกแบบสถาปัตยกรรมและกลยุทธการออก การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบส่วนจัดเก็บข้อมูล การออกแบบโปรแกรม คลาสและเมธอด การสร้างและการติดตั้งระบบ"
    },
    {
        "subjectId": "90644xxx",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกด้านภาษาและการสื่อสาร",
        "engSubjectsName": "ELECTIVE IN LANGUAGE AND COMMUNICATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6) หรือ 3(2-2-5)",
        "thaiSubjectDetails": ""
    },
    {
        "subjectId": "06026204",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เครือข่ายและความมั่นคงทางไซเบอร์เบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO NETWORKS AND CYBERSECURITY",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานเกี่ยวกับเครือข่ายคอมพิวเตอร์และความมั่นคงทางไซเบอร์ พื้นฐานการสื่อสารข้อมูลและการเชื่อมโยงเครือข่าย สถาปัตยกรรมเครือข่ายและอินเทอร์เน็ต แอปพลิเคชันและบริการบนเครือข่าย ภัยคุกคามและการโจมตีทางไซเบอร์ช่องโหว่และความเสี่ยง พื้นฐานมัลแวร์ การป้องกันความปลอดภัย การเข้ารหัสลับและการพิสูจน์ตัวตน การควบคุมการเข้าถึง กฏหมายและจริยธรรมทางไซเบอร์"
    },
    {
        "subjectId": "06026207",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบฐานข้อมูลแบบโนเอสคิวแอล",
        "engSubjectsName": "NOSQL DATABASE SYSTEMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ความแตกต่างจากระบบฐานข้อมูลเชิงสัมพันธ์ข้อดีและข้อเสียของฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ชนิดและโครงสร้างฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์แบบคอลัมน์แบบคีย์แวลยูแบบเอกสาร และแบบกราฟ ตัวอย่างการออกแบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์การใช้ภาษาเจสันกับฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์แนะนำภาษาเจสัน ไวยากรณ์ของเจสัน ชนิดข้อมูลของเจสัน"
    },
    {
        "subjectId": "06026208",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานวิทยาการข้อมูล",
        "engSubjectsName": "FUNDAMENTALS OF DATA SCIENCE",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ิทยาการข้อมูลกับแรงจูงใจเชิงธุรกิจ นิยามของวิทยาการข้อมูล กระบวนการทำวิทยาการข้อมูล เช่น กระบวนการ คิรสดีเอ็ม การทำความเข้าใจข้อมูล การเตรียมข้อมูล ดึงข้อมูลจากเว็บไซต์ การดึงข้อมูลจากเอพีไอ นิยามของปัญญาประดิษฐ์ การแทนความรู้ การใช้เหตุผลแบบตรรกศาสตร์และความน่าจะเป็น คอมพิวเตอร์วิทัศน์ การประมวลผลภาษาธรรมชาติ การเรียนรู้ของเครื่องจักร ภาษาไพธอนสำหรับวิทยาการข้อมูล"
    },
    {
        "subjectId": "06026209",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การแสดงข้อมูลด้วยแผนภาพ",
        "engSubjectsName": "DATA VISUALIZATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการการแสดงข้อมูลด้วยแผนภาพ การออกแบบการแสดงข้อมูลด้วยแผนภาพ เครื่องมือที่ใช้ การแสดงข้อมูลด้วยแผนภาพ การได้มาซึ่งข้อมูล การจัดระเบียบข้อมูล การเลือกแผนภูมิต่าง ๆ ที่เหมาะสม เช่น ฮีทโตรแกรม แผนภูมิการกระจาย แผนภูมิเส้น แผนภูมิแท่ง แผนภูมวงกลม แผนภูมิต้นไม้ แผนภูมิแบบเครือข่าย กราฟสตรีม แผนภูมิตัวชี้วัดผลงาน แผนที่ แผนภูมิแบบปฏิสัมพันธ์ การอธิบายแผนภูมิ หลักการเล่าเรื่องด้วยภาพ"
    },
    {
        "subjectId": "06026210",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การหาค่าที่เหมาะที่สุด",
        "engSubjectsName": "OPTIMIZATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การสร้างตัวแบบกำหนดการเชิงเส้น วิธีแก้ปัญหากำหนดการเชิงเส้น ปัญหาควบคู่ในกำหนดการเชิงเส้น กำหนดการเชิงเส้นและตัวแบบถดถอยควอนไทล์ การหาค่าเหมาะที่สุดกับปัญหากำลังสอง การหาค่าเหมาะสมที่สุดกับปัญหาคอน วิธีเกรเดียนต์เพื่อแก้ปัญหาการหาค่าเหมาะที่สุดกับปัญหาคอนเวกซ์ การหาค่าเหมาะที่สุดกับปัญหาสโทแคสติก วิธีสโทแคสติกเกรเดียนต์วิธีการเมตาฮิวริสติก"
    },
    {
        "subjectId": "06066102",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "MANAGEMENT INFORMATION SYSTEMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการการวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06066301",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "DATA STRUCTURES AND ALGORITHMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    }
    ,{
        "subjectId": "06026200",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "แคลคูลัส 1",
        "engSubjectsName": "CALCULUS 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ฟังก์ชัน, ลิมิต, ความต่อเนื่อง และการประยุกต์ใช้อุปนัยเชิงคณิตศาสตร์ แนะนําอนุพันธ์การหาอนุพันธ์ การประยุกต์ใช้อนุพันธ์ ปริพันธ์จํากัดเขต การปริพันธ์ด้วยปฏิยานุพันธ์การ ประยุกต์ใช้ปริพันธ์จํากัดเขต รูปแบบของการปริพันธ์ที่หาค่าไม่ได้ ปริพันธ์ไม่ตรงแบบ การหาปริพันธ์ด้วยวิธีเชิงตัวเลข อันดับและอนุกรมของจํานวนการกระจายอนุกรมเทเลอร์ของฟังก์ชันพื้นฐานการวิเคราะห์เวกเตอร์"
    },
    {
        "subjectId": "06026202",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พีชคณิตเชิงเส้น",
        "engSubjectsName": "LINEAR ALGEBRA",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบสมการเชิงเส่น การดําเนินการมูลฐาน การกําจัดเกาส์เซียน การกําจัดเกาส์-จอร์แดน ค่าลําดับชั้น การดําเนินการของเมทริกซ์ ผกผันของเมทริกซ์ เมทริกซ์มูลฐาน เมทริกซ์ย่อย และผลแบ่งส่วน เมทริกซ์ การแยกแบบแอลยู ดีเทอร์มิแนนต์ ตัวประกอบร่วมเกี่ยว เมทริกซ์ผูกพัน กฎคราเมอร์ ปริภูมิ เวกเตอร์ ปริภูมิย่อย ค่าลักษณะเฉพาะ เวกเตอร์ลักษณะเฉพาะ การทําให้เป็นเมริกซ์ทแยงมุม การแปลงเชิง เส้น เคอร์เนล เรนจ"
    },
    {
        "subjectId": "06066101",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางธุรกิจสำหรับเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "BUSINESS FUNDAMENTALS FOR INFORMATION TECHNOLOGY",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "สภาพแวดล้อมทางธุรกิจและระบบเศรษฐกิจ พื้นฐานของการบริหารการเงิน มูลค่าของเงินและต้นทุนของเงินทุน งบการเงิน การบริหารการผลิต การควบคุมสินค้าคงคลัง การตลาดพื้นฐานการจัดการ การจัดองค์กร การบริหารงานบุคคล จริยธรรมทางธุรกิจและความรับผิดชอบต่อสังคม"
    },
    {
        "subjectId": "06066303",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาและการโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "PROBLEM SOLVING AND COMPUTER PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและเกริ่นนำ การเขียน โปรแกรมคอมพิวเตอร"
    },
    {
        "subjectId": "90641001",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โรงเรียนสร้างเสน่ห์",
        "engSubjectsName": "CHARM SCHOOL",
        "category": "หมวดวิชาบังคับ",
        "credit": "2(1-2-3)",
        "thaiSubjectDetails": "เรียนรู้การทำให้ตัวเองมีเสน่ห์เพื่อใช้ชีวิตและทำงานอย่างมีความสุข โดยฝึกมารยาท ทักษะในการสื่อสารและความสัมพันธ์ระหว่างบุคคล บุคลิกภาพ และจิตอาสาที่เหมาะสม เพื่อสะท้อนถึงคุณลักษณะและอัตลักษณ์ของ KMITL"
    },
    {
        "subjectId": "90641003",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "กีฬาและนันทนาการ",
        "engSubjectsName": "SPORTS AND RECREATIONAL ACTIVITIES",
        "category": "หมวดวิชาบังคับ",
        "credit": "1(0-3-2)",
        "thaiSubjectDetails": "ศึกษากฎกติกากีฬา มารยาทในการเล่น ความมีน้ำใจนักกีฬา หลักการออกกำลังกาย ฝึกซ้อมกีฬา ฟิตเนส เล่นเกม และกิจกรรมสันทนาการ"
    },
    {
        "subjectId": "90644007",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "FOUNDATION ENGLISH 1",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน A2 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06026201",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "แคลคูลัส 2",
        "engSubjectsName": "CALCULUS 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ฟังก์ชันหลายตัวแปรและการประยุกต์ใช้ พีชคณิตของเวกเตอร์ในสามมิติ พิกัดเชิงขั้วแคลคูลัสของฟังก์ชันจำนวนจริงสองตัวแปร การหาอนุพันธ์และปริพันธ์ของฟังก์ชันจำนวนจริงและฟังก์ชันเวกเตอร์จำนวนจริงหลายตัวแปร แนะนำปริพันธ์เส้น เส้น ระนาบ และพื้นผิว ในปริภูมิสามมิติ แคลคูลัสของฟังก์ชันจำนวนจริงในปริภูมิสามมิติ ทฤษฎีบทหลักที่เกี่ยวกับการประยุกต์ เช่น ทฤษฎีบทของกรีน ทฤษฎีไดเวอร์เจนซ์ ทฎษฎีบทของเกาส์ ทฤษฎีบทของสโตกส์ เป็นต้น"
    },
    {
        "subjectId": "06026203",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การโปรแกรมคอมพิวเตอร์",
        "engSubjectsName": "COMPUTER PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำภาษาการสร้างโปรแกรมเชิงโครงสร้างและเชิงวัตถุ การเขียนผังงาน แนวคิดของโปรแกรมฟังก์ชันเบื้องต้นและข้อความสั่งกำหนดค่า โครงสร้างการวนซ้ำและเงื่อนไข อาร์เรย์ การประมวลผลสตริง การเขียนการเขียนฟังก์ชัน การเขียนข้อมูลชนิดโครงสร้าง การเขียนข้อมูลเชนิดอ็อบเจกต์ หลักการห่อหุ้ม คลาสและอ็อบเจกต์ เมธอดและการส่งสาร การสืบทอดคุณลักษณะภาวะพหุสัณฐาน"
    },
    {
        "subjectId": "06026205",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การตลาดเบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO MARKETING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "วิชานี้ศึกษาเกี่ยวกับพฤติกรรมของผู้บริโภค การกำหนดกลยุทธ์ส่วนแบ่งตลาด การกำหนดกลุ่มเป้าหมาย และการกำหนดตำแหน่งทางการตลาด รวมถึงการดำเนินการสร้างผลิตภัณฑ์ การกำหนดราคา การเลือกใช้ช่องทางจัดจำหน่ายตลอดจนการใช้การส่งเสริมการตลาดโดยคำนึงความรับผิดชอบสังคมเป็นหลัก แนวคิดและกลยุทธ์การตลาดดิจิทัล การตลาดผ่านสื่อดิจิทัล"
    },
    {
        "subjectId": "06066001",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความน่าจะเป็นและสถิติ",
        "engSubjectsName": "PROBABILITY AND STATISTICS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ความน่าจะเป็นและตัวแปรสุ่ม การแจกแจงความน่าจะเป็นแบบไม่ต่อเนื่องและแบบต่อเนื่อง ฟังก์ชันของตัวแปรสุ่ม การแจกแจงของตัวอย่าง ช่วงความเชื่อมั่น การทดสอบสมมติฐาน การถดถอยอย่างง่ายและการถดถอยเชิงซ้อนในตัวแบบเชิงเส้น การวิเคราะห์สหสัมพันธ์"
    },
    {
        "subjectId": "90641002",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความฉลาดทางดิจิทัล",
        "engSubjectsName": "DIGITAL INTELLIGENCE QUOTIENT",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษาทัศนคติและค่านิยมที่จำเป็นต่อการใช้ชีวิตในโลกดิจิทัล พัฒนาทักษะที่สำคัญสำหรับการขัดเกลาทางสังคมในโลกดิจิทัลโดยมุ่งเน้นที่อัตลักษณ์ของพลเมืองดิจิทัล การคิดอย่างมีวิจารณญาณ การจัดการความปลอดภัยทางไซเบอร์ การจัดการความเป็นส่วนตัว การจัดการเวลาหน้าจอ รอยเท้าทางดิจิทัล การจัดการการกลั่นแกล้งทางอินเทอร์เน็ต และความเห็นอกเห็นใจทางดิจิทัล เพื่อใช้ชีวิตอย่างชาญฉลาดในโลกดิจิทัล"
    },
    {
        "subjectId": "90642033",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "กฎหมายสำหรับคนรุ่นใหม่",
        "engSubjectsName": "LAW FOR NEW GENERATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ศึกษากฎหมายและวิเคราะห์ข้อเท็จจริงที่เกิดขึ้นในสังคม บทบาทหน้าที่และสิทธิเสรีภาพในการแสดงความคิดเห็นในที่สาธารณะ การดูหมิ่นหรือหมิ่นประมาทผู้อื่น การใช้สื่อสังคมออนไลน์ภายใต้กรอบของกฎหมาย ความรับผิดที่เกี่ยวกับการกระทำผ่านระบบคอมพิวเตอร์ แนวคิดและหลักการของกฎหมายคุ้มครองผู้บริโภคที่มีต่อผู้ประกอบธุรกิจ ปัญหาความรับผิดจากการใช้งานลิขสิทธิ์หรือละเมิดทรัพย์สินทางปัญญาของผู้อื่น และสิทธิในการปกป้องงานลิขสิทธิ์ของตนเองตามกฎหมายลิขสิทธิ์"
    },
    {
        "subjectId": "90644008",
        "cooperativeEducation": true,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "FOUNDATION ENGLISH 2",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน ภายใต้บริบทและสถานการณ์ที่หลากหลาย เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน B1 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06026206",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การวิเคราะห์ข้อมูลและการโปรแกรม",
        "engSubjectsName": "DATA ANALYTICS AND PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ในภาคทฤษฎี แนะนำการวิเคราะห์ข้อมูลเชิงธุรกิจและการตัดสินใจ สถิติเชิงพรรณนาการวิเคราะห์ความแปรปรวนหลายตัวแปร การวิเคราะห์ความถดถอยเชิงเส้นอย่างง่าย การวิเคราะห์ความถดถอยเชิงซ้อน การวิเคราะห์จำแนกกลุ่ม(Discriminant Analysis) การวิเคราะห์ความถดถอยโลจิสติก การพยากรณ์และอนุกรมเวลา การหาค่าที่เหมาะสมที่สุด ในภาคปฏิบัติแนะนำการเขียนโปรแกรมทางสถิติ เช่น ภาษาอาร์ ประเภทข้อมูล ข้อมูลตัวแปรเดี่ยว ข้อมูลตัวแปรคู่ ข้อมูลหลายตัวแปร สถิติเชิงพรรณา ตัวแปรอาร์เรย์ เมตริกซ์ ข้อมูลรายการและเฟรมข้อมูลโครงสร้างการควบคุม การวนลูป การพล๊อตกราฟและกราฟฟิค การจัดการข้อมูล การสร้างฟังก์ชัน และแพคเกจ รวมทั้งการใช้โปรแกรมสำเร็จรูปทางสถิติในการวิเคราะห์ข้อมูล"
    },
    {
        "subjectId": "06066000",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์ไม่ต่อเนื่อง",
        "engSubjectsName": "DISCRETE MATHEMATICS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ระบบตัวเลข ตรรกะและเซต ความสัมพันธ์และฟังก์ชัน ลำดับและอนุกรม อุปนัยเชิงคณิตศาสตร์คอมบินาทอรี่ส์กราฟ ระบบพีชคณิต ทฤษฎีสารสนเทศและการเข้ารหัสและระบบสถานะจำกัด"
    },
    {
        "subjectId": "06066300",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "DATABASE SYSTEM CONCEPTS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล ระบบฐานข้อมูลและสภาพแวดล้อม ระบบจัดการฐานข้อมูล ชนิดของฐานข้อมูล แบบจำลองข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ สกีมา อินแสตน รีเลชันชิป กฎบูรณภาพ พจนานุกรมข้อมูล แบบจำลองความสัมพันธ์ระหว่างเอนทิตี ฟังก์ชันดีเพนเดนซี นอร์มัลไลซ์เซชัน พีชคณิตเชิงสัมพันธ์ เอสคิวแอล การประมวลผลทรานแซคชัน แนวคิดคลังข้อมูลและการออกแบบ ปฏิบัติการด้านการจำลองข้อมูลและภาษาฐานข้อมูล"
    },
    {
        "subjectId": "06066302",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การเขียนโปรแกรมเว็บพื้นฐาน",
        "engSubjectsName": "FUNDAMENTAL WEB PROGRAMMING",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานและหลักการทำงานของระบบเว็บ เครื่องมือสำหรับการออกแบบและพัฒนาเว็บ การเขียนโปรแกรมเว็บฝั่งไคลแอนท์ HTML CSS JavaScript กระบวนการออกแบบส่วนต่อประสานกับผู้ใช้ การจัดการกับ Events การจัดการโครงสร้างเอกสารและ DOM การเขียนโปรแกรมเว็บฝั่งเซิร์ฟเวอร์ PHP การจัดการและการใช้งานฐานข้อมูล การใช้งานเฟรมเวิร์ค"
    },
    {
        "subjectId": "06066304",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การวิเคราะห์และออกแบบระบบสารสนเทศ",
        "engSubjectsName": "INFORMATION SYSTEM ANALYSIS AND DESIGN",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การพัฒนาโดยใช้แนวคิดเชิงวัตถุ การวิเคราะห์และออกแบบ การเลือกโครงการและการจัดการ โครงการสารสนเทศ กำหนดความต้องการระบบ การวิเคราะห์ด้วยยูสเคส แบบจำลองกระบวนการ แบบจำลองข้อมูล การออกแบบสถาปัตยกรรมและกลยุทธการออก การออกแบบส่วนติดต่อกับผู้ใช้ การออกแบบส่วนจัดเก็บข้อมูล การออกแบบโปรแกรม คลาสและเมธอด การสร้างและการติดตั้งระบบ"
    },
    {
        "subjectId": "90644xxx",
        "cooperativeEducation": true,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "วิชาเลือกด้านภาษาและการสื่อสาร",
        "engSubjectsName": "ELECTIVE IN LANGUAGE AND COMMUNICATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6) หรือ 3(2-2-5)",
        "thaiSubjectDetails": ""
    },
    {
        "subjectId": "06026204",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เครือข่ายและความมั่นคงทางไซเบอร์เบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO NETWORKS AND CYBERSECURITY",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "แนวคิดพื้นฐานเกี่ยวกับเครือข่ายคอมพิวเตอร์และความมั่นคงทางไซเบอร์ พื้นฐานการสื่อสารข้อมูลและการเชื่อมโยงเครือข่าย สถาปัตยกรรมเครือข่ายและอินเทอร์เน็ต แอปพลิเคชันและบริการบนเครือข่าย ภัยคุกคามและการโจมตีทางไซเบอร์ช่องโหว่และความเสี่ยง พื้นฐานมัลแวร์ การป้องกันความปลอดภัย การเข้ารหัสลับและการพิสูจน์ตัวตน การควบคุมการเข้าถึง กฏหมายและจริยธรรมทางไซเบอร์"
    },
    {
        "subjectId": "06026207",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบฐานข้อมูลแบบโนเอสคิวแอล",
        "engSubjectsName": "NOSQL DATABASE SYSTEMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "แนะนำระบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ความแตกต่างจากระบบฐานข้อมูลเชิงสัมพันธ์ข้อดีและข้อเสียของฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์ชนิดและโครงสร้างฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์แบบคอลัมน์แบบคีย์แวลยูแบบเอกสาร และแบบกราฟ ตัวอย่างการออกแบบฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์การใช้ภาษาเจสันกับฐานข้อมูลแบบไม่ใช่เชิงสัมพันธ์แนะนำภาษาเจสัน ไวยากรณ์ของเจสัน ชนิดข้อมูลของเจสัน"
    },
    {
        "subjectId": "06026208",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานวิทยาการข้อมูล",
        "engSubjectsName": "FUNDAMENTALS OF DATA SCIENCE",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "ิทยาการข้อมูลกับแรงจูงใจเชิงธุรกิจ นิยามของวิทยาการข้อมูล กระบวนการทำวิทยาการข้อมูล เช่น กระบวนการ คิรสดีเอ็ม การทำความเข้าใจข้อมูล การเตรียมข้อมูล ดึงข้อมูลจากเว็บไซต์ การดึงข้อมูลจากเอพีไอ นิยามของปัญญาประดิษฐ์ การแทนความรู้ การใช้เหตุผลแบบตรรกศาสตร์และความน่าจะเป็น คอมพิวเตอร์วิทัศน์ การประมวลผลภาษาธรรมชาติ การเรียนรู้ของเครื่องจักร ภาษาไพธอนสำหรับวิทยาการข้อมูล"
    },
    {
        "subjectId": "06026209",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การแสดงข้อมูลด้วยแผนภาพ",
        "engSubjectsName": "DATA VISUALIZATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "หลักการการแสดงข้อมูลด้วยแผนภาพ การออกแบบการแสดงข้อมูลด้วยแผนภาพ เครื่องมือที่ใช้ การแสดงข้อมูลด้วยแผนภาพ การได้มาซึ่งข้อมูล การจัดระเบียบข้อมูล การเลือกแผนภูมิต่าง ๆ ที่เหมาะสม เช่น ฮีทโตรแกรม แผนภูมิการกระจาย แผนภูมิเส้น แผนภูมิแท่ง แผนภูมวงกลม แผนภูมิต้นไม้ แผนภูมิแบบเครือข่าย กราฟสตรีม แผนภูมิตัวชี้วัดผลงาน แผนที่ แผนภูมิแบบปฏิสัมพันธ์ การอธิบายแผนภูมิ หลักการเล่าเรื่องด้วยภาพ"
    },
    {
        "subjectId": "06026210",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การหาค่าที่เหมาะที่สุด",
        "engSubjectsName": "OPTIMIZATION",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "การสร้างตัวแบบกำหนดการเชิงเส้น วิธีแก้ปัญหากำหนดการเชิงเส้น ปัญหาควบคู่ในกำหนดการเชิงเส้น กำหนดการเชิงเส้นและตัวแบบถดถอยควอนไทล์ การหาค่าเหมาะที่สุดกับปัญหากำลังสอง การหาค่าเหมาะสมที่สุดกับปัญหาคอน วิธีเกรเดียนต์เพื่อแก้ปัญหาการหาค่าเหมาะที่สุดกับปัญหาคอนเวกซ์ การหาค่าเหมาะที่สุดกับปัญหาสโทแคสติก วิธีสโทแคสติกเกรเดียนต์วิธีการเมตาฮิวริสติก"
    },
    {
        "subjectId": "06066102",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "ระบบสารสนเทศเพื่อการจัดการ",
        "engSubjectsName": "MANAGEMENT INFORMATION SYSTEMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(3-0-6)",
        "thaiSubjectDetails": "บทบาทของเทคโนโลยีสารสนเทศในธุรกิจ แนวคิดระบบสารสนเทศและการจัดการการวางแผนเทคโนโลยีสารสนเทศเชิงกลยุทธ์ ความสอดคล้องของเทคโนโลยีสารสนเทศกับกลยุทธ์ทางธุรกิจ การได้มาซึ่งระบบสารสนเทศ ระบบสารสนเทศตามลักษณะที่สนับสนุนการทำงาน ระบบสารสนเทศระดับองค์กร แนวโน้มการประยุกต์ใช้เทคโนโลยีสารสนเทศ จริยธรรมและประเด็นทางสังคม"
    },
    {
        "subjectId": "06066301",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "โครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "DATA STRUCTURES AND ALGORITHMS",
        "category": "หมวดวิชาบังคับ",
        "credit": "3(2-2-5)",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสท์ สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและการค้นหาข้อมูล อัลกอริทึมแบบละโมบ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    }

]