[
    {
        "subjectId": "06036100",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "พื้นฐานทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "INFORMATION TECHNOLOGYFUNDAMENTALS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำเทคโนโลยีสารสนเทศ องค์ประกอบของระบบคอมพิวเตอร์ โปรแกรมและแอปพลิเคชัน ภาพรวมการทำงานของระบบปฏิบัติการ การแทนและจัดการข้อมูล ฐานข้อมูล การพัฒนาระบบ เครื่องมือในการพัฒนาแอปพลิเคชัน การสื่อสารดิจิทัล ความปลอดภัย จริยธรรม และความเป็นส่วนตัวทางดิจิทัล"
    },
    {
        "subjectId": "06036101",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "คณิตศาสตร์สำหรับธุรกิจ",
        "engSubjectsName": "MATHEMATICS FOR BUSINESS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ฟังก์ชันเชิงเส้นและไม่เชิงเส้น ซึ่งรวมถึงฟังก์ชันต้นทุน ฟังก์ชันรายรับ ฟังก์ชันอุปสงค์และอถปทานการแก้ระบบสมการเชิงเส้น คณิตศาสตร์ที่เกี่ยวข้องกับการเงิน เช่น ดอกเบี้ยเชิงเดี่ยวดอกเบี้ยทบต้น มูลค่าของเงินตามเวลา อนุพันธ์เละอนุพันธ์ย่อยของฟังก์ชัน และบทประยุกต์ทางธุรกิจ กำหนดการเชิงเส้น และพีชคณิตเมทริกซ์ ซึ่งประกอบด้วย การดำเนินการเกี่ยวกับเลขคณิต การคูณ ตัวผกผัน และการหาผลเฉลยของระบบสมการโดยใช้ ตัวผกผัน การดำเนินการตามแถว และกฎคาร์เมอร์ โดยหัวข้อทั้งหมดอาจถูกเสริมด้วยโปรแกรมคำนวณทางคณิตศาสตร์"
    },
    {
        "subjectId": "06036118",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การแก้ปัญหาทางด้านเทคโนโลยีสารสนเทศ",
        "engSubjectsName": "",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "กลยุทธ์และหลักการแก้ปัญหา การคิดเชิงคำนวณ การคิดแบบขั้นตอนวิธี ผังงาน แนวคิดและหลักการสร้างโปรแกรมคอมพิวเตอร์เบื้องต้น"
    },
    {
        "subjectId": "96641001",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "โรงเรียนสร้างเสน่ห์",
        "engSubjectsName": "",
        "credit": "2(1-2-3)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "เรียนรู้การทำให้ตัวเองมีเสน่ห์เพื่อใช้ชีวิตและทำงานอย่างมีความสุข โดยฝึกมารยาท ทักษะในการสื่อสารและความสัมพันธ์ระหว่างบุคคล บุคลิกภาพ และจิตอาสาที่เหมาะสม เพื่อสะท้อนถึงคุณลักษณะและอัตลักษณ์ของ KMITL"
    },
    {
        "subjectId": "96641003",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "กีฬาและนันทนาการ",
        "engSubjectsName": "SPORTS AND RECREATIONAL ACTIVITIES",
        "credit": "1(0-3-2)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษากฎกติกากีฬา มารยาทในการเล่น ความมีน้ำใจนักกีฬา หลักการออกกำลังกาย ฝึกซ้อมกีฬา ฟิตเนส เล่นเกม และกิจกรรมสันทนาการ"
    },
    {
        "subjectId": "96644007",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 1",
        "engSubjectsName": "FOUNDATION ENGLISH 1",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน A2 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "96644042",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 1,
        "thaiSubjectsName": "การสื่อสารและการนำเสนออยางมืออาชีพ",
        "engSubjectsName": "PROFESSIONAL COMMUNICATION AND PRESENTATION",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": " พัฒนาทักษะการรู้เท่าทันสื่อ เรียนรู้การวิเคราะห์และประเมินสถานการณ์ และคัดกรองเนื้อหาเพื่อให้ได้ประเด็นสำคัญในการนำเสนอ เรียนรู้การเลือกสื่อการนำเสนอให้เหมาะสม เรียนรู้ภาษาวาจาและภาษากายที่เหมาะสมสำหรับบริบทต่างๆ"
    },
    {
        "subjectId": "06036102",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "การวิเคราะห์เชิงสถิติสำหรับธุรกิจ",
        "engSubjectsName": "STATISTICAL ANALYSIS FOR BUSINESS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "สถิติในงานธุรกิจ แนวคิดพื้นฐานทางสถิติ วิธีการวัดข้อมูล แผนภูมิและกราฟ การกระจายความถี่กราฟข้อมูลเชิงปริมาณและเชิงคุณภาพ กราฟข้อมูลสองตัวแปร แผนภาพกระจาย สถิติพรรณนา การวัดแนวโน้มสู่ศูนย์กลาง การวัดความแปรปรวน การวัดรูปทรง การแจกแจงและการสุ่มตัวอย่าง การแจกแจงแบบไม่ต่อเนื่องและต่อเนื่อง การแจกแจงทวินาม การกระจายปัวซอง การแจกแจงยูนิฟอร์ม การแจกแจงแบบปกติแนวคิดพื้นฐานของการทดสอบสมมติฐานทางสถิติสำหรับธุรกิจ สถิติ z สถิติ t สถิติ F แนวคิดพื้นฐานของการประมาณแบบช่วงและความเชื่อมั่น ในประชากรหนึ่งและสองประชากร การออกแบบการทดลองสำหรับการทดสอบสมมติฐานทางธุรกิจ การถดถอยเชิงเส้นแบบง่ายและพหุคูณ การฝึกปฏิบัติกับซอฟต์แวร์ทางสถิติสำหรับสถิติเชิงพรรณนาและเชิงอนุมาน"
    },
    {
        "subjectId": "06036109",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "กระบวนการและโมเดลทางธุรกิจ",
        "engSubjectsName": "BUSINESS PROCESSES AND BUSINESS MODEL",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "พื้นฐานของกระบวนการทางธุรกิจ องค์ประกอบพื้นฐานของวัฏจักรธุรกิจ รูปแบบต่างๆของโมเดลธุรกิจ เทคนิคช่วยออกแบบโมเดลธุรกิจ กระบวนการออกแบบโมเดลธุรกิจเพื่อช่วยในการออกแบบโมเดลธุรกิจเพื่อช่วยในการออกแบบโมเดลธุรกิจที่เป็นนวัตกรรมใหม่ โดยเชื่อมโยงแนวคิด เทคนิค และเครื่องมือทั้งหมดในการสร้างโมเดลธุรกิจ กรณีศึกษาโมเดลธุรกิจต่างๆ ตัวอย่างโมเดลธุรกิจสตาร์ทอัพที่ประสบความสำเร็จ "
    },
    {
        "subjectId": "06036119",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "พื้นฐานการเขียนโปรแกรม",
        "engSubjectsName": "PROGRAMMING FUNDAMENTALS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนวคิดพื้นฐานของการเขียนโปรแกรม ตัวแปร นิพจน์ และคำสั่ง เงื่อนไขและการเรียกซ้ำ ฟังก์ชันและค่าที่ส่งกลับ การวนซ้ำและสตริง, การเก็บรวบรวมข้อมูล, การจัดการไฟล์, กรณีศึกษา"
    },
    {
        "subjectId": "06036125",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "สถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ",
        "engSubjectsName": "COMPUTER ARCHITECTURE AND OPERATING SYSTEM",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "วิวัฒนาการของคอมพิวเตอร์, พื้นฐานความรู้เกี่ยวกับคอมพิวเตอร์, การคำนวณทางคณิตศาสตร์ในคอมพิวเตอร์, ข้อมูลและการส่งข้อมูล, สถาปัตยกรรมของหน่วยความจำ, บัสและหน่วยความจำแคช, การเชื่อมต่อและการสื่อสาร, โครงสร้างของหน่วยประมวลผล, การคำนวณแบบขนานและไปทไลน์, เทคโนโลยีของไมโครโพรเซสเซอร์, อินเตอร์รัพท์, การทำดีเอ็มเอ, โปรแกรมอินพทเอาต์พุต, ระบบปฎิบัติการ, โปรเซสและ เทรด, การจัดการหน่วยความจำของระบบปฏิบัติการ, การจัดการไฟล"
    },
    {
        "subjectId": "96641002",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ความฉลาดทางดิจิทัล",
        "engSubjectsName": "DIGITAL INTELLIGENCE QUOTIENT",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ศึกษาทัศนคติและค่านิยมที่จำเป็นต่อการใช้ชีวิตในโลกดิจิทัล พัฒนาทักษะที่สำคัญสำหรับการขัดเกลาทางสังคมในโลกดิจิทัลโดยมุ่งเน้นที่อัตลักษณ์ของพลเมืองดิจิทัล การคิดอย่างมีวิจารณญาณ การจัดการความปลอดภัยทางไซเบอร์ การจัดการความเป็นส่วนตัว การจัดการเวลาหน้าจอ รอยเท้าทางดิจิทัล การจัดการการกลั่นแกล้งทางอินเทอร์เน็ต และความเห็นอกเห็นใจทางดิจิทัล เพื่อใช้ชีวิตอย่างชาญฉลาดในโลกดิจิทัล"
    },
    {
        "subjectId": "96644008",
        "cooperativeEducation": false,
        "year": 1,
        "semeter": 2,
        "thaiSubjectsName": "ภาษาอังกฤษพื้นฐาน 2",
        "engSubjectsName": "FOUNDATION ENGLISH 2",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "การฝึกทักษะภาษาอังกฤษสี่ทักษะ ได้แก่ การฟัง การพูด การอ่าน และการเขียน ภายใต้บริบทและสถานการณ์ที่หลากหลาย เพื่อใช้ในชีวิตประจำวันและเพื่อการศึกษาต่อ นักเรียนได้รับการคาดหวังให้สอบผ่าน B1 หรือระดับที่สูงกว่าของ Common European Framework of Reference for Languages (CEFR)"
    },
    {
        "subjectId": "06036103",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บูรณาการเทคนิคเชิงสถิติสำหรับธุรกิจ",
        "engSubjectsName": "INTEGRATION OFSTATISTICALTECHNIQUES FOR BUSINESS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ข้อมูลและสถิติ การประยุกต์ใช้สถิติในธุรกิจและเศรษฐศาสตร์ สถิติสำหรับข้อมูลขนาดใหญ่และการทำเหมืองข้อมูล การคลีนข้อมูล แผนภาพตารางและกราฟ การสร้างแดชบอร์ด แนวทางปฏิบัติในการสร้างภาพข้อมูล มาตรวัดเชิงตัวเลข การแจกแจงตัวแปรสุ่ม การแจกแจงแบบสองตัวแปร ความแปรปรวนร่วม และสหสัมพันธ์แบบเพียร์สัน การวิเคราะห์และตีความการถดถอยพหุคูณ การพยากรณ์ การวิเคราะห์แนวโน้ม การแตกตัวแปรฤดูกาล อัตถดถอย และอัตสหสัมพันธ์ การวิเคราะห์ข้อมูลทหมวดหมู่ สถิติไร้พารามิเตอร์การทดสอบอันดับวิลค็อกซัน สหสัมพันธ์แบบสเปียร์แมน การวิเคราะห์การตัดสินใจทางธุรกิจ การตัดสินใจภายใต้ความไม่แน่นอนและความเสี่ยง การประยุกต์ใช้เทคนิคทางสถิติกับกรณีศึกษาทางธุรกิจและการเงิน แนวปฏิบัติเชิงสถิติในการตัดสินใจทางธุรกิจ"
    },
    {
        "subjectId": "06036104",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "องค์กรและการจัดการ",
        "engSubjectsName": "MANAGEMENT AND ORGANIZATIONS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ภาคทฤษฎีและภาคปฏิบัติสำหรับการบริหารจัดการองค์กร ความเป็นผู้นำ การพัฒนากลยุทธ์ทางธุรกิจ พฤติกรรมองค์กร โครงสร้างองค์กร การจัดการทรัพยากรมนุษย์ การเปลี่ยนแปลงในองค์กร องค์กรสมัยใหม่ในยุคดิจิทัล"
    },
    {
        "subjectId": "06036105",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "บัญชีการเงินสำหรับผู้มิใช่นักบัญชี",
        "engSubjectsName": "FINANCIAL ACCOUNTING FOR NON-ACCOUNTANTS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความรู้เบื้องต้นในการทำบัญชีในธุรกิจ โดยเน้นที่หลักการพื้นฐานและการปฏิบัติของบัญชีการเงินการแยกแยะ วิเคราะห์ บันทึก และผ่านรายการ ธุรกรรมทางธุรกิจ รวมถึงกระบวนการปรับปรุง การจัดทำงบการเงิน และกระบวนการปิด เพื่อทำให้วงจรการบัญชีสมบูรณ์ การบันทึกและวิเคราะห์การบัญชีสำหรับกิจการที่ขายสินค้า สินค้าคงคลัง ทรัพย์สิน หนี้สิน ทุน และกระแสเงินสด การวิเคราะห์งบการเงินเบื้องต้น"
    },
    {
        "subjectId": "06036117",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "อัจฉริยะทางธุรกิจและข้อมูลขนาดใหญ่",
        "engSubjectsName": "BUSINESS INTELLIGENCE AND BIG DATA",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ธุรกิจอัจฉริยะ (business Intelligence) และส่วนประกอบของมัน ข้อมูลขนาดใหญ่ (big data)และการวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) ลักษณะเฉพาะ 5 อย่างของข้อมูลขนาดใหญ่ -volume (ข้อมูลมหาศาล ขนาดใหญ่) variety (ข้อมูลที่มีความหลากหลายทั้งที่เป็นแบบโครงสร้างหรือรูปแบบที่ไม่แน่นอน) velocity (ข้อมูลที่จะต้องวิเคราะห์เข้าสู่ระบบฐานข้อมูลอย่างรวดเร็ว โดยให้ความสำคัญกับข้อมูลที่เป็น real – time) veracity (ความถูกต้อง ครบถ้วนของข้อมูล) และ value (ข้อมูลที่สามารถนำมาใช้งานได้จริง) การทำคลังข้อมูล (data warehousing) การทำเหมืองข้อมูล (data Mining)การวิเคราะห์ข้อมูลขนาดใหญ่ (big data analytics) การทำรายงานเชิงวิเคราะห์ (analytical reporting)การแสดงผลข้อมูล (data visualization) "
    },
    {
        "subjectId": "06036120",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "หลักการโครงสร้างข้อมูลและอัลกอริทึม",
        "engSubjectsName": "DATA STRUCTURES AND ALGORITHMS PRINCIPLES",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ชนิดของข้อมูล โครงสร้างข้อมูลและชนิดข้อมูลแบบนามธรรม โครงสร้างข้อมูลพื้นฐาน เช่น ลิสต์สแต็ก และคิว โครงสร้างข้อมูลแบบพลวัต คำศัพท์เฉพาะเกี่ยวกับทรี ไบนารีทรี ไบนารีเสิร์ชทรี เอวีแอลทรี กราฟ การวิเคราะห์โปรแกรมเชิงเวลาและพื้นที่ อัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมแบบละโมภ อัลกอริทึมแบบแบ่งเพื่อเอาชนะ อัลกอริทึมเกี่ยวกับกราฟ และการเขียนโปรแกรมพลวัต"
    },
    {
        "subjectId": "06036122",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 1,
        "thaiSubjectsName": "การสื่อสารด้วยภาพสำหรับธุรกิจ",
        "engSubjectsName": "VISUAL COMMUNICATION FORBUSINESS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำระบบสื่อประสม ประเภทของข้อมูลสื่อประสม อาทิเช่น ภาพถ่าย ภาพกราฟิกแบบสเกลาร์และแบบเวกเตอร์ ภาพแบบจำลอง 3 มิติ เสียง และวีดีโอ การสร้างสื่อประสม อุปกรณ์เก็บข้อมูลสื่อประสม การนำเสนอข้อมูลสื่อประสม การประยุกต์ใช้งานสื่อประสม"
    },
    {
        "subjectId": "06036108",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เศรษฐศาสตร์เทคโนโลยีสารสนเทศ",
        "engSubjectsName": "ECONOMICS OFINFORMATION TECHNOLOGY",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "หลักการเศรษฐศาสตร์เบื้องต้น แนวคิดและทฤษฎีเกี่ยวกับกระบวนนวัตกรรมและการเปลี่ยนแปลงเทคโนโลยี ตลาดเทคโนโลยีสารสนเทศ การประเมินการลงทุนทางด้านเทคโนโลยีสารสนเทศผลกระทบของการพัฒนาและการเปลี่ยนแปลงเทคโนโลยีต่อการพัฒนาเศรษฐกิจและอุตสาหกรรม การจ้างงาน การเจริญเติบโตของธุรกิจ ผลิตภาพ การถ่ายทอดเทคโนโลยี การวิจัยและพัฒนา การปรับตัวเข้าสู่สังคมสารสนเทศ"
    },
    {
        "subjectId": "06036111",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เทคโนโลยีดิจิทัลสำหรับธุรกิจ",
        "engSubjectsName": "DIGITAL TECHNOLOGY FOR BUSINESS",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "ความรู้พื้นฐานในเทคโนโลยีปัจจุบันที่กำลังถูกใช้ในภาคธุรกิจ, ความรู้เบื้องต้นเกี่ยวกับการประมวลผลบนระบบคลาวด์ ข้อมูลขนาดใหญ่ ปัญญาประดิษฐ์ การค้นคืนข้อมูลสารสนเทศ เว็บ และสื่อสั่งคม ซึ่งนำไปสู่ การทำการเปลี่ยนแปลงทางดิจิทัล วิธีปฏิบัติที่นิยมในปัจจุบัน แนวโน้มในอนาคตและผลกระทบต่อธุรกิจ"
    },
    {
        "subjectId": "06036112",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "แนวคิดระบบฐานข้อมูล",
        "engSubjectsName": "DATABASE SYSTEM CONCEPTS",
        "credit": "3(2-2-5)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนะนำฐานข้อมูลและระบบจัดการฐานข้อมูล แบบจำลองสำหรับฐานข้อมูลและสถาปัตยกรรมฐานข้อมูล แบบจำลองฐานข้อมูลเชิงสัมพันธ์ ความซ้ำซ้อนของข้อมูลและปัญหาที่เกิดจากความซ้ำซ้อนของฐานข้อมูลการทำฐานข้อมูลให้อยู่ในรูปแบบที่พร้อมใช้งานในระดับต่างๆ ตั้งแต่1NF-5NF แบบจำลองความสัมพันธ์ระหว่างเอนทิตี และการแปลงรูปเป็นฐานข้อมูลเชิงสัมพันธ์กรณีศึกษาการออกแบบฐานข้อมูล การเขียนโปรแกรมด้วยภาษาฐานข้อมูล เอสคิวแอลขั้นต้นจนถึงขั้นสูง"
    },
    {
        "subjectId": "06036113",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "การออกแบบส่วนต่อประสานกับมนุษย์",
        "engSubjectsName": "HUMAN INTERFACE DESIGN",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "หลักการออกแบบโดยมีผู้ใช้เป็นศูนย์กลาง กระบวนการออกแบบส่วนต่อประสานกับผู้ใช้และประสบการณ์สำหรับผู้ใช้ การวิเคราะห์ผู้ใช้และการวิเคราะห์งาน ความต้องการด้านการใช้ประโยชน์ได้ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ หลักการและข้อแนะนำในการออกแบบ เทคนิคการประเมินผลข้อแนะนำพื้นฐานในการออกแบบสำหรับเว็บและแอพลิเคชันบนอุปกรณ์แบบพกพาได้ เครื่องมือในการสร้างต้นแบบ เทคโนโลยีอินพุทและเอาท์พุทสำหรับการปฏิสัมพันธ์กับมนุษย์"
    },
    {
        "subjectId": "06036124",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "เครือข่ายคอมพิวเตอร์และความมั่นคงทางไซเบอร์เบื้องต้น",
        "engSubjectsName": "INTRODUCTION TO COMPUTER NETWORK AND CYBERSECURITY",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": "แนวคิดเกี่ยวกับเครือข่ายคอมพิวเตอร์และความมั่นคงปลอดภัยไซเบอร์พื้นฐาน, การเชื่อมโยงเครือข่ายและอินเทอร์เน็ต, หลักการสื่อสาร, สถาปัตยกรรมเครือข่ายและแอพลิเคชัน, แอพลิเคชันและบริการบนเครือข่าย, ภัยและการโจมตีทางไซเบอร์, ช่องโหว่และความเสี่ยง, พื้นฐานมัลแวร์, เครื่องมือรักษาความปลอดภัย, การเข้ารหัสลับ, การพิสูจน์ตัวตน, การลงลายเซ็นดิจิทัล, การควบคุมการเข้าถึง,ความปลอดภัยข้อมูลส่วนบุคคล, กฎหมายและจริยธรรมที่เกี่ยวกับไซเบอร์"
    },
    {
        "subjectId": "9664xxxx",
        "cooperativeEducation": false,
        "year": 2,
        "semeter": 2,
        "thaiSubjectsName": "วิชาเลือกหมวดวิชาศึกษาทั่วไป สำหรับหลักสูตรนานาชาติ 1",
        "engSubjectsName": "GE ELECTIVE COURSE REQUIREMENT 1",
        "credit": "3(3-0-6)",
        "category": "หมวดวิชาบังคับ",
        "thaiSubjectDetails": ""
    }
]